{
  "elementalIdentity": "You are the Earth Pig, and if there's a more generous, grounded, and quietly powerful combination in the sixty-sign cycle, I haven't found it. Your archetype—the Abundant Provider—isn't some feel-good label. It's literal. Earth gives you the capacity to hold, nurture, and cultivate. Pig gives you the instinct to share what you've built. Where other signs hoard or strategize, you create surplus and distribute it naturally. This isn't martyrdom; it's your actual pleasure. You find satisfaction in full tables, comfortable homes, and people who feel safe in your presence. But let's be clear: your generosity flows from abundance, not depletion. When your resources are intact, you're magnificent. When they're drained, you become something else entirely—immovable, resentful, a mountain that refuses to budge. Earth is the center of the Wu Xing cycle, the element that all others pivot around. It generates Metal, meaning your stability creates clarity and structure for others. It controls Water, meaning you can absorb emotional chaos and give it form. But Earth also gets controlled by Wood and generates into Metal, which means you're vulnerable to depletion from two directions—people who take endlessly (Wood penetrating) and your own tendency to give everything away (generating Metal). The Pig nature amplifies this. Pigs are epicureans, creatures of comfort and pleasure who believe life should be enjoyed. Combined with Earth, you don't just enjoy life—you cultivate it. You build gardens, literal and metaphorical. You create environments where things grow. Other Earth signs might be cautious or calculating. The Earth Ox hoards. The Earth Dog guards. You? You spread the feast. Your shadow is worth naming directly: you can become a black hole of need when your Earth is depleted. A weak Earth Pig doesn't ask for help; they collapse inward, passive-aggressive and immovable, expecting others to notice and rescue them. You can also overindulge to the point of stagnation. Earth that doesn't move becomes mud. A Pig that doesn't pace itself becomes sluggish. Your challenge isn't learning to give less—it's learning to receive, to let others nourish you, and to recognize when your soil is exhausted before you become barren. What makes you unique among the sixty signs is this: you are the only combination that embodies true, sustainable generosity. Fire Pig burns out giving. Metal Pig gives with strings attached. Water Pig gives to manipulate connection. Wood Pig gives to grow influence. You give because your Earth is fertile and your Pig nature knows that abundance shared becomes more abundant. When you're balanced, you are the person everyone wants at the table—not because you're entertaining, but because your presence makes everything feel richer, safer, more possible.",
  "elementInDepth": "Earth is the fulcrum. It's the pause between seasons, the center that holds, the ground beneath every other element's drama. For you as the Earth Pig, this element doesn't just describe you—it defines your entire operational system. Your Earth manifests as capacity. Not potential, not promise—actual capacity to hold, process, and transform. You can sit with someone's grief without flinching. You can hear ten different opinions and synthesize them into something workable. You can take a chaotic situation and, through sheer presence, make it feel manageable. This is Earth's superpower: it receives everything and composts it into something usable. In the productive cycle, Earth generates Metal. For you, this means your stability and nurturing directly create clarity, boundaries, and structure—both in yourself and others. When you're grounded, you naturally help people find their shape. You're the friend who helps someone finally quit the bad job, leave the wrong relationship, see what they actually need. You generate Metal without trying. But here's the edge: if you over-generate, if you give too much structure to others, your own Earth depletes. You become the therapist with no one to talk to, the provider with an empty pantry. Metal needs to be fed, but not at the cost of your soil. In the controlling cycle, Earth controls Water. This is where your power sits. Water is emotion, chaos, the formless realm of feeling. Earth absorbs it, gives it banks, makes it a river instead of a flood. You can handle emotional intensity that would drown other signs. People sense this. They bring you their problems, their fears, their unprocessed everything. Your Earth soaks it up. But—and this is critical—Earth that absorbs too much Water becomes waterlogged. Muddy. Heavy. Immovable. You stop being fertile ground and become a swamp. This is your most common imbalance: overcontrolling Water until you're saturated with everyone else's emotional refuse. The destructive cycle matters too. Wood controls Earth. Wood penetrates, breaks up, demands. For you, this shows up as people or situations that constantly need more—the friend with endless crises, the job that never lets you rest, the family member who treats you like an ATM. Wood isn't evil; it's growth. But unchecked Wood will deplete your Earth entirely, turning you from rich soil into dust. You must learn to recognize Wood energy in your life and set boundaries before depletion happens. When your Earth is strong, you are unshakeable. You have energy to give, space to hold, resources to share. You feel satisfied, embodied, generous without effort. You sleep well. Your home feels like a sanctuary. You enjoy food, touch, comfort without guilt. You create value effortlessly. When your Earth is depleted, everything inverts. You become needy but won't ask. Passive but resentful. You overeat or stop eating. You can't say no but radiate irritation when people ask. You stop maintaining your space. You feel simultaneously exhausted and restless. This is Earth turning to mud—no structure, no fertility, just heaviness. Your work is to keep your Earth tilled, fertilized, and allowed to rest in fallow periods. Not every season is planting season. Even the most abundant soil needs winter.",
  "yearAhead2026": "The Year of the Fire Horse arrives in 2026, and for you, Earth Pig, this is a year of productive friction. Fire generates Earth in the Wu Xing cycle—the Horse's flames will feed your soil. But Fire also demands movement, risk, and visibility, everything your Pig nature instinctively resists. The Horse gallops; you prefer to settle. The Horse performs; you nurture quietly. This tension is the entire story of your 2026. The opportunity: Fire's energy will supercharge your capacity. You'll have more energy, more ideas, more drive than you've felt in years. The Horse brings momentum, and because Fire feeds Earth, this momentum will actually land—it won't just be chaos. This is a year when your projects gain traction, when your generosity gets recognized, when the structures you've been building finally become visible. The warning: Fire can also bake Earth into hardpan if it's too intense. The Horse's speed and intensity might exhaust you, especially if you try to match its pace. You're not built for sprint culture. Your power is in sustained cultivation, not explosive action. If you push yourself to perform like a Fire sign, you'll deplete fast. Q1 (February-April): The year opens with momentum. Fire Horse energy arrives, and you'll feel the surge immediately. This is your planting season—start the projects, have the conversations, make the commitments. Your Earth is being fed; use this energy to establish what matters. Watch for overcommitment. The Horse's enthusiasm is contagious, but you don't need to say yes to everything. Choose your rows carefully. Socially, you'll be more visible than usual. People will seek you out. Let them, but maintain your center. Fire can scatter Earth if you're not rooted. Q2 (May-July): Mid-year brings heat, literally and figuratively. This is when the Fire Horse energy peaks, and you might feel pushed beyond your comfort zone. Projects accelerate. Demands increase. The temptation will be to people-please your way through it. Don't. This is your season to practice boundaries without guilt. Say no to what depletes you. Delegate. Let others carry some weight. The Horse wants to run; you don't have to chase it. Focus on what you can sustain, not what looks impressive. Financial opportunities may appear—the Fire is generating abundance—but scrutinize them. Not every opportunity is your opportunity. Q3 (August-October): Late summer into autumn is your natural season, and you'll feel the shift. The Fire Horse energy starts to mellow as the year moves toward Metal season. This is harvest time for you—literally reaping what you planted in Q1. You'll see results. Projects complete. Relationships deepen. Your effort pays off. This is also when you need to rest. Earth after Fire needs recovery time. Don't immediately start the next big thing. Let your soil rest. Compost the year's experiences. Process what worked and what didn't. The Horse energy will still push for more, but you can slow down now. Your power is in the pause. Q4 (November-January): The year closes in Metal energy (late autumn, early winter), and you'll feel relief. Metal gives Earth shape and definition. After the Fire Horse's intensity, this will feel like finally being able to breathe and organize. Use this quarter to consolidate gains, set up systems, and prepare for the next cycle. Relationships that started in the Fire may now need structure—definitions, commitments, clarity. Your Earth will be ready to provide this. Financially, lock in what you've earned. Overall strategy for 2026: Let Fire feed you, but don't try to become Fire. Stay rooted. Move when it's right, not when it's exciting. Receive the abundance that's coming, but protect your resources. This is a year of visible growth if you pace yourself, or burnout if you don't. You choose.",
  "compatibilityMap": "Your relationship dynamics as an Earth Pig are entirely about capacity and reciprocity. You assess compatibility—consciously or not—based on whether someone can receive what you offer and whether they refill your reserves. You're not transactional, but you're also not a martyr. You need mutuality, even if it doesn't look symmetrical. Best elemental matches: Water signs are your natural partners. Water nourishes Earth, and you need nourishing. Water Rabbit, Water Goat, Water Pig—these combinations give you emotional depth and replenishment. They fill your well. With Water partners, you don't have to perform. They appreciate your steadiness without demanding you be more exciting. In romance, this creates deep, satisfying intimacy. In friendship, it creates safety. The shadow: Water can also overwhelm Earth if the Water sign is unbalanced. A Water partner in chaos will flood you. You'll absorb their emotions until you're waterlogged. This pairing works only if the Water sign has some self-regulation. Fire signs are complex for you. Fire generates Earth—technically supportive—but Fire is also demanding, restless, and dramatic. Fire Snake or Fire Horse can energize you, push you out of complacency, bring excitement to your stable world. In romance, this creates passion and growth. But Fire also exhausts Earth if it burns too hot. Fire partners may see your slowness as boring. You may see their intensity as draining. This works best when the Fire sign appreciates your groundedness and you appreciate their spark—but both must actively choose balance. Fire friendships are easier than Fire romances; you can enjoy their energy in doses without merging your lives. Metal signs are interesting. You generate Metal, meaning you naturally support Metal Ox, Metal Rooster, Metal Monkey. You help them find clarity and structure. But generating Metal depletes you if it's one-directional. Metal partners must give back—usually through loyalty, clarity, and helping you set boundaries. A balanced Metal partner protects your generosity from being exploited. They sharpen your edges. In romance, Metal can feel cold at first, but depth develops. Metal teaches you discernment. In friendship, Metal is your strategic advisor, the one who tells you when someone's using you. Most challenging combinations: Wood signs control Earth, and this is your relational danger zone. Wood Tiger, Wood Rabbit, Wood Dragon—these signs will penetrate your boundaries, demand your resources, and grow through your soil. It's not malicious; it's their nature. Wood needs to expand, and Earth is where it plants roots. In romance, this can feel like you're the eternal provider and they're the eternal grower. You give; they take. It can work if the Wood sign is mature enough to recognize your limits and actively reciprocates. But immature Wood will drain you dry. Wood friendships often feel one-sided. You're the one they call in crisis, but where are they when you need support? Another Earth sign—Earth Ox, Earth Goat—seems safe, but it's often stagnant. Two Earth signs can build a lovely, comfortable life together, but without other elements in the mix, there's no movement. You might feel secure but unstimulated. In romance, this can become roommates who care for each other but lack spark. In friendship, it's reliable but flat. How you love: You love through provision. You cook, you create comfort, you make space. You remember what someone needs and quietly provide it. You're not verbally effusive, but your actions are encyclopedic. You show love by making life easier, softer, more abundant. How you fight: You go silent and immovable. Earth under stress becomes a wall. You won't yell—you'll just stop engaging. You become passive-aggressive, martyred, a stone that refuses to budge. Your partner has to draw you out, and if they can't, the resentment calcifies. How you grow: You grow through being received. When someone truly sees your generosity, appreciates your steadiness, and gives back—not necessarily in kind, but genuinely—you blossom. You need to feel that your abundance creates abundance, not just depletion.",
  "elementalBalanceGuide": "Balancing your Earth is non-negotiable maintenance, not optional self-care. When your Earth is balanced, you function. When it's not, everything breaks down. Here's how to actually manage it. Signs your Earth is excessive: You feel heavy, sluggish, unable to move. You're overthinking everything, stuck in loops. You're overindulging—too much food, too much comfort, too much inertia. Your body feels dense. You're holding onto everything: clutter, relationships, grudges, extra weight. You can't let anything go. Excessive Earth becomes mud: no flow, no life, just sticky stagnation. This happens when you've been too stationary, when you haven't let Wood energy break up your soil, when you've been saying yes to everything and moving through nothing. To clear excess Earth: Introduce Wood. Movement, flexibility, growth. Start a physical practice—yoga, dance, walking in nature. Wood breaks up stagnant Earth. Declutter aggressively. Let things go. Clean out your closets, your calendar, your contact list. Earth accumulates; you must periodically release. Reduce heavy foods. Excess Earth shows up as overconsumption. Lighter, fresher foods. More vegetables, less density. Let Wind move through your life—open windows, change routines, try something new. Signs your Earth is deficient: You feel ungrounded, anxious, unable to settle. You can't hold anything—not food, not commitments, not relationships. You're scattered, flighty, unreliable. You have no appetite or irregular digestion. You feel disconnected from your body. You can't nurture yourself or others. Deficient Earth is dust: no substance, no fertility, no capacity. This happens after prolonged depletion—too much giving, too much absorbing of others' emotions, too much Wood draining you, not enough Fire feeding you. To rebuild deficient Earth: Introduce Fire. Warmth, nourishment, energy. Spend time in sunlight. Eat warm, cooked foods. Be around people who energize you rather than drain you. Reduce what you're holding for others. Stop being everyone's therapist. Let people carry their own emotional water for a while. Practice embodiment. Get into your body—massage, baths, physical touch, grounding exercises. Walk barefoot. Garden. Handle soil. Routine and rhythm. Deficient Earth needs structure to rebuild. Regular meals, consistent sleep, predictable rhythms. Seasonal awareness: Late summer (the transition between seasons, roughly mid-August to mid-September) is your power time. This is when Earth element peaks in nature. Use this season to reset, nourish, and restore your reserves. If you do nothing else, prioritize yourself during late summer. Autumn (Metal season) is when you naturally start to generate outward. You'll feel called to help others find structure. This is fine, but monitor your reserves. Don't overgive in autumn. Winter (Water season) is when you'll be called on to absorb everyone's emotional chaos. Holidays, darkness, introspection—people will bring you their Water. Protect your boundaries fiercely in winter. Let some Water flow past you without absorbing it. Spring (Wood season) will challenge you. Wood energy demands growth, movement, change. You'll feel penetrated, pushed, disrupted. This is necessary—Wood tills your soil—but limit how much Wood you allow in. Say no to chaotic people and situations in spring. Summer (Fire season) feeds you. Soak it up. Let Fire energize you. This is when you should be most active, most visible, most generous. Fire replenishes Earth, so use summer to build your reserves for the rest of the year. Daily practices: Morning: Ground before you engage. Feet on floor, breath in belly, ten minutes of silence before you start providing for others. Midday: Check in. Are you holding too much? What can you put down? Throughout: Notice who and what depletes you versus feeds you. Adjust accordingly. Evening: Physical release. Move your body, even gently. Earth needs to circulate, not stagnate. Environment: Your space should be comfortable but not cluttered. Earth accumulates, so you must actively curate. Warm colors, soft textures, spaces that feel contained but not cramped. Bring in plants (Wood to break up stagnation) and natural light (Fire to feed you). Keep your center clear—literally. The center of your home should be open, uncluttered. Earth is the center; honor that. Final word: You are not a resource to be mined. You are soil that must be tended. Treat yourself as carefully as you treat everyone else, and your abundance becomes truly inexhaustible."
}