{
  "elementalIdentity": "You are the Earth Rooster—the Diligent Master who builds empires one perfect brick at a time. Where other Roosters strut and perform, you root down. Your element doesn't just stabilize the Rooster's famous precision; it transforms it into something relentless and enduring. The Rooster gives you the eye for detail, the intolerance for mediocrity, the compulsion to correct what's wrong. Earth gives you the stamina to actually finish what you start, the weight to make your words land with authority, and the patient brutality to outlast everyone who doubted you.\n\nThis combination creates something rare: a perfectionist who can execute. Most Roosters exhaust themselves in displays of competence, burning bright and flaming out. You? You're the one still standing when the chaos clears, having methodically restructured everything while others were busy having opinions about it. Your Earth element sits at the center of the Wuxing cycle—the fulcrum point where all transformations pass through. This means you instinctively understand how to take raw potential and make it real. You see the gap between what is and what should be, and you have the grit to close it.\n\nThe archetype of Diligent Master isn't about dominance through force—it's about dominance through sheer, stubborn reliability. You master through repetition, through showing up when inspiration has long abandoned everyone else. Where Fire Roosters burn with charisma and Metal Roosters cut with criticism, you compress. You densify. You take the Rooster's natural inclination toward order and make it immovable. People might call you rigid, but what they're really encountering is someone who refuses to compromise on standards because you've learned that excellence isn't a mood—it's a practice.\n\nYour shadow is obvious: you can become so invested in the correct way of doing things that you calcify. Earth energy in excess turns to mud or stone. You risk becoming the person who knows the right answer but has forgotten why it matters. The Rooster's critical eye, filtered through Earth's need for stability, can make you punishing—to yourself first, then to everyone around you. You hold grudges not because you're petty but because you remember every deviation from what was promised, every shortcut taken, every standard lowered. You carry the weight of other people's incompetence like sediment in your bones.\n\nBut here's what makes you formidable: when Earth Roosters commit, they don't waver. You're not chasing novelty or validation. You're building something that will outlast your own need for recognition. The world needs fewer performers and more masons. You're the mason. Among the sixty signs, you're the one who understands that transformation isn't dramatic—it's incremental, deliberate, and usually involves getting your hands dirty in ways that won't photograph well. That's your gift. Own it without apology.",
  "elementInDepth": "Earth is the element of Late Summer—that humid, heavy time when growth slows and everything ripens into harvest or rot. It governs the center, the axis around which the other four elements spin. In the Wuxing productive cycle, Earth generates Metal and is generated by Fire. In the destructive cycle, Earth controls Water and is controlled by Wood. For you as an Earth Rooster, this isn't abstract philosophy—it's the operating system running under your personality.\n\nWhen your Earth is strong, you're unshakeable. You can absorb criticism that would flatten others, process it, and extract anything useful while discarding the rest. Strong Earth gives you that quality people describe as 'grounded'—you're present, reliable, able to hold space for other people's chaos without getting swept into it. This is when your Rooster precision becomes most valuable: you can see exactly what needs to happen and you have the endurance to see it through. You become the person others lean on not because you're warm and fuzzy, but because you're structurally sound.\n\nBut Earth doesn't stay balanced by accident. When your Earth becomes excessive—usually through overwork, over-responsibility, or the grinding need to control outcomes—you turn stagnant. Excess Earth manifests as stubbornness that calcifies into obstinacy. You stop adapting. Your diligence becomes martyrdom. You start wearing your exhaustion as proof of your virtue, and your critical Rooster eye turns inward with punishing accuracy. You ruminate. You can't let things go. Your body might reflect this too: that heavy, stuck feeling, digestive sluggishness, the sense that you're carrying more weight than your frame was designed for. This is Earth turning to mud—fertile ground becomes a swamp.\n\nWhen your Earth is depleted, the Rooster anxiety amplifies. Without that stabilizing center, your perfectionism detaches from reality and becomes free-floating criticism. You lose your ability to prioritize—everything feels urgent, nothing feels manageable. Depleted Earth makes you scattered despite your best efforts at control, and the more you try to force structure, the more brittle you become. You need Earth's nourishing quality to metabolize experience, and without it, you're just accumulating stress like unpaid debt.\n\nThe productive cycle offers you a roadmap. Fire generates Earth—meaning passion, inspiration, and creative heat are what feed your stability. When you're running on empty, you don't need more discipline; you need more fire. You need to remember why you're building what you're building. Conversely, you generate Metal—your diligent work produces clarity, refinement, and structure. When you're functioning well, you naturally create systems that cut through confusion. But if you're trying to generate Metal from depleted Earth, you're just producing rigidity without wisdom.\n\nThe destructive cycle reveals your friction points. You control Water—emotion, flow, adaptability—which means you can dam up feelings and redirect chaos. But this also means you can become controlling of anything that feels too fluid or undefined. And Wood controls you—growth, expansion, new ideas can overwhelm your need for stability. When Wood is pushing on you (new projects, demands for flexibility, rapid change), you'll feel it as threat to your foundation. Your work is learning when to yield rather than simply compress harder.",
  "yearAhead2026": "The Year of the Fire Horse arrives in 2026, and it's bringing weather you didn't order. Fire and Horse together create intensity, volatility, and a pace that offends your Earth Rooster sensibilities. The Horse is freedom-obsessed, impulsive, and allergic to the methodical approach you've perfected. Fire accelerates everything, burning away the careful planning you prefer. This year will test whether your diligence has made you adaptable or just entrenched. The opportunity here is significant—Fire generates Earth in the productive cycle, meaning this year can fuel you if you're willing to let it. But that's a big 'if.'\n\nQ1 (Late January through March) starts with friction. The Fire Horse energy explodes out of the gate while you're still checking your systems and making sure everything is properly accounted for. You'll feel the pressure to move faster than feels safe, to commit before you've done due diligence. Resist the urge to dig in defensively. Instead, identify one area where you've been stuck in productive cycle paralysis—where your caution has become procrastination. Let the Horse energy kick you forward there. Not everywhere, just somewhere specific. This is also when you'll need to watch for Fire depleting your Metal (which you generate)—meaning your clarity and boundaries might feel compromised. Protect your structure without becoming brittle.\n\nQ2 (April through June) brings the heat. Fire is amplifying everything, including the critical voice in your head. This is when your Earth element can either absorb that fire productively or turn to baked clay. The key is remembering that Fire should feed you, not exhaust you. Where are you being called to care more, not just work harder? The Rooster in you will want to perfect; the Fire Horse year will punish perfection that delays action. This is your quarter to practice 'good enough executed' over 'perfect planned.' In relationships and collaborations, you'll encounter people moving at Horse pace. Instead of judging their lack of your diligence, see if you can borrow some of their momentum in short bursts. You don't have to become them; you just need to not be an immovable object when movement is required.\n\nQ3 (July through September) is late summer—your element's season. This is your power window. The Fire Horse is still running, but now you've got elemental reinforcement. This is when your Earth Rooster nature can do what it does best: take all the chaotic energy from the first half of the year and consolidate it into something lasting. What got started sloppily? Refine it now. What's been moving too fast to assess? Evaluate now. But don't retreat into pure maintenance mode. The Horse energy is still active—use it for bold implementation of what you've been building. Launch something. Commit to something publicly. Let your diligence be visible instead of just internal.\n\nQ4 (October through December) requires you to release. This is the hardest part for Earth Roosters—letting the year complete without trying to fix everything that didn't go according to plan. The Fire Horse year will leave loose ends. It will have been messier than you wanted. Your task in Q4 is to harvest what worked and compost what didn't without turning it into evidence of failure. As the year winds down, start building your reserves for 2027 (Fire Goat year—more manageable for you). The final quarter is about acknowledging that some speed and some chaos actually served you, even if it felt wrong in your body. What did you accomplish that you wouldn't have if you'd been allowed to move at your preferred pace? That's the gift. Don't waste it by wishing it had been different.",
  "compatibilityMap": "Earth Roosters don't do casual connection—you do structural alignment. Your relationships are built like architecture: they either have integrity or they collapse, and you can tell the difference before the first beam is set. Your Earth element makes you less flashy than other Roosters in love, but more enduring. You're not trying to dazzle; you're trying to find someone who can stand weight-bearing responsibility alongside you without crumbling.\n\nYour best elemental matches are Metal and Fire, but for different reasons. Metal signs (especially Metal Ox or Metal Snake) speak your language of refinement and standards. You generate Metal in the cycle, which means you naturally produce what they value—structure, clarity, reliability. With Metal partners, there's mutual respect for precision. You both understand that love isn't just feeling; it's execution. The danger here is becoming too rigid together, building a relationship so well-defended that nothing spontaneous can penetrate it. You'll need to consciously introduce Water energy (emotion, flow, vulnerability) or you'll create a fortress with nothing alive inside it.\n\nFire matches (Fire Dragon, Fire Horse, even Fire Rooster) feed you energetically. Fire generates Earth—they provide the passion and vision that replenishes your reserves when diligence has drained you. These relationships feel more volatile because Fire doesn't have your patience, but they keep you from calcifying. A Fire partner will frustrate you regularly by caring less about method and more about momentum, but they'll also remind you why you're building what you're building. In romance, this can be electric. In friendship, it's the person who drags you out of your workshop and makes you remember you're alive. Just watch that you don't become the eternal responsible one while they get to play eternal inspiration.\n\nWater signs are your control relationship—literally, you control Water in the destructive cycle. Water Rat, Water Pig, Water Rabbit all bring emotional depth and adaptability that you naturally want to contain and direct. These relationships often start with you feeling needed—they're fluid, you're stable; they provide intuition, you provide form. But 'control' in Wuxing isn't dominance; it's regulation. The shadow here is damming them up so completely that the relationship becomes about your need for order rather than mutual growth. Water partners will feel smothered if you can't let them flow. They'll leave not with a fight but with a slow disappearance. If you can learn to channel rather than contain, these relationships teach you that not everything needs to be structured to be valuable.\n\nWood signs (Wood Tiger, Wood Rabbit) are the ones who control you, and this is often where Earth Roosters experience the most growth and the most frustration. Wood breaks up Earth—they expand, they grow, they demand flexibility you don't naturally possess. Wood partners will push you to evolve past your own methods. They'll question your systems, ignore your carefully laid plans, and somehow still get results. This drives you insane and also keeps you from becoming obsolete. In romance, these are passionate but combative—lots of push-pull. In friendship, they're the ones who won't let you become a rigid, joyless perfectionist. You need some Wood in your life, even when you hate it.\n\nEarth-to-Earth relationships (another Earth Rooster, Earth Ox, Earth Dog) are safe and potentially stagnant. You understand each other's need for stability, but you can also enable each other's worst tendencies. Two Earth signs can build an impressive life together and still be emotionally malnourished because nobody's introducing any other element. If you choose this, make sure you're consciously bringing in Fire (shared passions), Metal (shared standards that elevate you), or Water (emotional honesty) from outside sources. Otherwise you're just two people who are really good at enduring together, which isn't the same as thriving.",
  "elementalBalanceGuide": "Balancing your Earth element isn't about achieving some mythical state of permanent equilibrium—it's about recognizing when you've tipped too far into excess or deficiency and knowing what corrective measures actually work. Earth Roosters tend toward excess because your combination naturally accumulates: responsibility, standards, grievances, work. You take on weight, and your instinct is to just bear it because that's what diligent people do. This is noble and also stupid.\n\nSigns of Earth excess: You can't delegate. You're holding grudges about things that happened months ago. Your body feels heavy in a way that's not about actual weight—it's density, sluggishness, that stuck feeling. You're ruminating in loops, replaying conversations or scenarios where things didn't meet your standards. Your digestion is off (Earth governs the digestive system's transformation function in TCM, though we're not making health claims—just noting the traditional correspondence). You've become the person who says 'yes' to every responsibility and then resents everyone for taking you up on it. You're getting diminishing returns on effort—working harder but producing less.\n\nWhen Earth is excessive, you need to introduce Wood and Metal strategically. Wood to break up the stagnation—this means new projects that you actually find exciting, not just more obligations. It means letting something grow wild instead of managed. Go somewhere you've never been. Learn something that has nothing to do with your expertise. Let yourself be a beginner at something. Metal to refine and cut away—you generate Metal, so this should feel natural. What needs to be eliminated? What responsibility can you release not because you failed but because it's complete or no longer relevant? Get ruthless about your 'yes.' Every new commitment is weight; make sure it's worth carrying.\n\nSigns of Earth deficiency: You're scattered despite your best efforts at control. You can't prioritize—everything feels equally urgent. You're not finishing things, which is unusual for you. You feel ungrounded, anxious in a free-floating way that your Rooster mind can't fix with planning. You're craving stability but unable to create it. You might be skipping meals, living in your head, disconnected from your body and physical space. You're getting pushed around by other people's needs or demands because you've lost your center.\n\nWhen Earth is deficient, you need Fire first, then Earth reinforcement. Fire generates Earth—you need passion, warmth, inspiration. This isn't frivolous; it's fuel. What do you actually care about underneath all the should-dos? Reconnect with that. Spend time with Fire people who remind you why anything matters. Get literal fire into your environment—cook something, light candles, sit in sun. Then reinforce Earth directly: get physical in a grounded way (walking, not spin class), eat warm, nourishing foods (your element governs transformation of food to energy), clean and organize your immediate space (not as productivity hack but as literal grounding practice). Touch earth—garden, pottery, anything with your hands in soil or clay.\n\nSeasonal awareness matters for you. Late Summer (the transition between seasons, roughly late July through September) is your power time. This is when you should tackle the big projects, make important decisions, do your most demanding work. You have elemental backup. Late Winter into Early Spring is your challenging time—Wood is rising, breaking up structures, demanding flexibility right when you want to hunker down. Don't plan your most demanding commitments then if you can avoid it. Use that time for planning and preparation instead of execution.\n\nDaily practices that actually work for Earth Roosters: Morning routine that's consistent but not punishing—you need rhythm, not rigidity. Ten minutes of absolutely nothing (not meditation with goals, just sitting) to prevent accumulation before it starts. One thing each day that you do imperfectly on purpose—this trains you out of the excellence-or-nothing trap. Evening practice of physical completion: write down what got finished today, not what's still pending. This helps Earth energy consolidate instead of scatter.\n\nEnvironment adjustments: Your space should have visible order (your Rooster needs this) but warm tones and natural materials (your Earth needs this). Harsh minimalism will deplete you. Cluttered chaos will make you insane. Aim for structured coziness. Clay, ceramic, wood, warm yellows and browns. Weight and texture—things that feel substantial to touch. This isn't aesthetics; it's energetic alignment.\n\nThe fundamental practice for Earth Roosters is learning the difference between diligence and grinding yourself into dust. You're here to build things that last, but you can't build from depletion. Your element sits at the center—it transforms everything, but it needs to be fed by Fire and allowed to generate Metal. You're not meant to just endure everything. You're meant to be the foundation that's strong because it's nourished, not because it's suffered. That's the difference between mastery and martyrdom. Choose accordingly."
}