{
  "elementalIdentity": "You are the Fire Pig, and that makes you a walking paradox that most people will never fully understand. Fire wants to leap, to conquer, to be seen. The Pig wants to nurture, to include, to feed everyone at the table. Put them together and you get someone who charges into battle with a casserole dish in one hand and a manifesto in the other. You're the Warm-Hearted Champion because your fire doesn't burn for personal glory alone—it burns for causes, for people, for ideals that matter. But make no mistake: you are NOT a soft touch. Your warmth has teeth.\n\nThe Pig nature gives you an almost unsettling generosity. You genuinely want others to thrive, to be happy, to have enough. But fire adds a twist—you don't just want to help people, you want to transform them, ignite them, push them toward their potential whether they asked for it or not. This is where you can become insufferable if you're not careful. Your heart is in the right place, but your delivery can scorch. You have opinions, strong ones, and you're not shy about sharing them. The Pig makes you inclusive; the fire makes you evangelical. You want everyone at the feast, but you also want them to see things your way.\n\nAmong the 60 signs, you're one of the rare combinations where passion and compassion genuinely coexist. Most fire signs—Fire Horse, Fire Rooster—burn primarily for themselves. Their heat is about personal achievement, dominance, legacy. You're different. Your fire is other-focused, which makes you both more palatable to be around and more prone to martyrdom. You will absolutely set yourself on fire to keep others warm, and then resent them for not noticing. That's your shadow. You give and give until you're depleted, and then you explode in righteous fury because nobody appreciated the depth of your sacrifice.\n\nThe archetype of the Warm-Hearted Champion means you're at your best when you're fighting for something bigger than yourself. You need a cause, a mission, a reason to mobilize all that heat and heart. Without it, you become scattered, pouring your energy into a thousand small acts of service that leave you exhausted and unfulfilled. You're not meant to be a behind-the-scenes supporter. You're meant to lead with passion, to inspire, to rally people around a vision. But here's the trick: your leadership style is collaborative, not authoritarian. You lead by pulling people in, making them feel valued and part of something meaningful. That's the Pig gift. You make people feel like they belong, and then the fire motivates them to rise.",
  "elementInDepth": "Fire in you is not the wild, untamed blaze of the Horse or the precise, focused heat of the Snake. Your fire is a bonfire—communal, warm, meant to gather people. It crackles with enthusiasm and lights up the space around you, but it also demands constant feeding. You need fuel: connection, purpose, validation, inspiration. When your fire is strong, you're magnetic. People want to be near you because you radiate possibility. You make them feel like the world is full of potential, like together you can build something that matters. Your optimism is infectious, your energy relentless.\n\nBut fire generates earth in the Wu Xing cycle, and that's where things get complicated for you. Earth is about stability, groundedness, responsibility. When your fire is strong and healthy, you naturally create earth—you build things, you follow through, you turn your visions into reality. But if your fire is too strong, unchecked by other elements, you burn out your earth before it can solidify. You start a hundred projects and finish none. You commit to too many people and can't show up for any of them fully. You become all heat and no substance, all passion and no plan. This is the Fire Pig trap: you want to do everything for everyone, and you end up scattered, exhausted, and ineffective.\n\nFire controls metal in the cycle, which means when your fire is balanced, you have the power to cut through nonsense, to refine ideas, to bring clarity and precision to chaotic situations. Metal is about boundaries, structure, discernment. A healthy Fire Pig knows how to say no, how to prioritize, how to channel their abundant energy into focused action. But when your fire is weak—when you're depleted, uninspired, or disconnected from purpose—you lose that metal control. You become indecisive, porous, unable to set limits. People take advantage of your generosity. You say yes when you mean no. You absorb everyone else's problems and lose sight of your own needs.\n\nWhen fire is depleted in your chart, you don't just lose energy—you lose meaning. A Fire Pig without fire is a deeply sad thing to witness. You become cynical, resentful, withdrawn. The warmth that defines you curdles into bitterness. You start keeping score of everything you've given and everything you haven't received in return. You stop believing in people, in causes, in the possibility of change. This is your darkness: the extinguished fire, the cold hearth. It's not dramatic like the collapse of some fire signs. It's quiet, insidious, a slow dimming that others might not even notice until you're almost gone.\n\nTo keep your fire strong, you need to be ruthlessly honest about what feeds it and what drains it. Not all connection nourishes you. Not all causes are worth your energy. You need to choose carefully, which goes against every Pig instinct you have. The Pig wants to include everyone; fire demands selectivity. Learning to balance these two impulses is your life's work. When you get it right—when you're channeling your fire toward something you truly care about, surrounded by people who reciprocate your energy—you're unstoppable. You become the kind of person who changes lives, who builds movements, who leaves the world warmer than you found it.",
  "yearAhead2026": "2026 is the Year of the Fire Horse, and for you, Fire Pig, this is both an opportunity and a potential powder keg. The Horse shares your fire element, which means the year's energy will feel familiar, activating, even intoxicating. But the Horse is wild fire—individualistic, restless, hungry for freedom and adventure. Your Pig nature, which craves connection and collective purpose, will feel the tension. This year will ask you to integrate some of the Horse's fierce independence without losing your essential warmth. It's a year for bold moves, but you'll need to make sure you're moving toward something that truly matters to you, not just reacting to the Horse's frenetic energy.\n\nQ1 (January–March) arrives with the Horse year already galloping. You'll feel a surge of energy and possibility right out of the gate. This is prime time for initiating projects, especially those that combine your passion with practical impact. The Horse energy will push you to take risks you'd normally overthink. Let it. But here's the warning: don't commit to everything that sounds exciting. The Horse tempts you with a thousand directions; you need to choose one or two that align with your deeper values. Use the first quarter to clarify what you're fighting for this year. Write it down. Make it specific. The clearer you are now, the less scattered you'll be later.\n\nQ2 (April–June) brings the first test. The Horse's independence will start chafing against your collaborative nature. You might find yourself in conflicts with partners, team members, or loved ones who want you to slow down or include them more in your decision-making. Don't bulldoze through this. The Pig in you knows that relationships are your foundation; the fire just makes you impatient. This quarter is about learning to move fast without leaving people behind. Practice bringing others into your vision rather than assuming they should just keep up. Also, watch for burnout. The double fire of Horse year plus your own fire element can lead to exhaustion if you're not careful. Build in rest, even if it feels counterintuitive.\n\nQ3 (July–September) shifts the energy. The Horse year's momentum will start to stabilize, and you'll have a chance to assess what's working and what's not. This is your recalibration period. Some of the things you started in Q1 will have revealed themselves as distractions. Let them go. The Pig hates quitting, but fire knows that sometimes you need to burn away the dead wood to let the real growth happen. Focus on depth over breadth in this quarter. Go deeper with the people and projects that are actually feeding your fire. This is also a good time for personal reflection. Are you living in alignment with what you said mattered to you at the start of the year? Adjust course if needed.\n\nQ4 (October–December) is about harvest and completion. The Horse year will be winding down, and you'll want to finish strong. This quarter rewards follow-through. If you've been disciplined about focus, you'll see real results now—projects completed, relationships deepened, goals achieved. If you scattered your energy, you'll feel the frustration of having a lot of half-finished things. Either way, use Q4 to close loops. Finish what you can, release what you can't, and start preparing for the transition into the next year. The Fire Horse year will have taught you something essential about balancing independence with connection, passion with sustainability. Take those lessons into 2027 with you.",
  "compatibilityMap": "Let's be clear: you are not easy to love, Fire Pig. You're warm, generous, endlessly enthusiastic, but you're also intense, demanding, and prone to emotional overwhelm. You need someone who can handle heat without getting burned, someone who appreciates your depth without drowning in it. Element compatibility gives us a map, but remember—this is about energy dynamics, not destiny. Any pairing can work if both people are willing to grow.\n\nYour best elemental match is Earth. Earth is nourished by fire in the Wu Xing cycle, which means your natural energy feeds them. Earth people—Earth Ox, Earth Snake, Earth Pig, Earth Rat—provide the stability and groundedness you desperately need. They're not intimidated by your passion; they know how to receive it and turn it into something lasting. An Earth partner will help you finish what you start, will remind you to rest, will build the structure around your vision. In return, you bring warmth, excitement, and inspiration to their sometimes overly cautious nature. This is a generative pairing. You grow each other. In romance, it's steady and deeply satisfying once you adjust to different paces. In friendship, it's the person who's been there for decades, the one who knows how to calm you down and hype you up in equal measure.\n\nWood is another strong match. Fire needs wood to burn, and you'll find wood people—Wood Tiger, Wood Rabbit, Wood Dragon—endlessly fascinating and inspiring. They bring creativity, flexibility, and growth-oriented energy that aligns with your need for meaning and expansion. This pairing is dynamic, full of ideas and late-night conversations about changing the world. But here's the risk: you can burn through them if you're not careful. Wood feeds fire, but if you take and take without giving them space to regenerate, you'll exhaust them. In romance, this is passionate but requires conscious effort to maintain balance. In friendship, it's the co-conspirator relationship, the person you start movements and businesses and adventures with.\n\nWater is your most complex relationship. Water controls fire in the cycle, which means Water people—Water Pig, Water Rat, Water Monkey—have the power to extinguish you or temper you depending on how it's handled. At best, water provides the cooling, reflective energy that keeps you from burning out. They help you process emotions, add depth to your passion, teach you patience. At worst, they make you feel diminished, criticized, dampened. You'll feel like they're constantly raining on your parade, and they'll feel like you're too much, too loud, too intense. This pairing requires immense maturity from both sides. In romance, it can be profound if you're both committed to balance. In friendship, it's often easier—they're the person who tells you hard truths you need to hear.\n\nMetal is challenging. Fire controls metal, which means you have the upper hand energetically, but that doesn't make it easy. Metal people—Metal Rooster, Metal Dog, Metal Monkey—bring precision, boundaries, and high standards that can feel like judgment to your expansive Pig nature. You'll want to break through their walls with your warmth, and they'll want you to be more disciplined and focused. This creates friction. The gift is that metal can help you refine your ideas and cut away what's not essential, but you have to be willing to receive that feedback without taking it as rejection. In romance, this pairing requires work and often benefits from outside support. In friendship, it's the person who keeps you honest and sharp.\n\nFire-to-fire pairings, like you with another Fire sign, are explosive. Too much heat, not enough balance. It can be thrilling short-term—the intensity, the mutual understanding, the shared passion. But long-term, you need elements that complement and balance you, not amplify your existing tendencies. Use fire friendships for inspiration and momentum, but build your foundation with earth and wood.",
  "elementalBalanceGuide": "Balancing fire when you're a Fire Pig is non-negotiable. You can't just burn bright and hope for the best. Unchecked fire in you leads to burnout, scattered energy, broken relationships, and cynicism. Fire excess looks like this: you're constantly in motion but accomplishing little, you're irritable and impatient with people who can't keep up, you're starting fights over small things because you're overstimulated, you're not sleeping well, your mind races, you feel wired but also exhausted. You're all output, no input. This is when you need to actively bring in water and earth energy to cool and ground yourself.\n\nWater energy comes through stillness and depth. You need practices that slow you down and force you inward. Sit by actual water—ocean, river, lake—and just be there. No agenda, no phone, just you and the water. Let it regulate your nervous system. Take long baths. Swim if you can. Water helps you process the emotional intensity you carry. Journal not about what you're doing, but about what you're feeling. Fire Pigs often avoid their deeper emotions because there's always something more urgent to do, someone else who needs help. But those unprocessed feelings are fuel leaks, draining your fire without you realizing it. Water practices create the space for emotional digestion.\n\nEarth energy comes through structure and physicality. You need routines, even though your fire resists them. Wake up at the same time. Eat meals sitting down. Finish one project before starting three more. Earth is about completion, and completion is what feeds your sense of meaning. Work with your hands—garden, cook, build something tangible. The Pig in you loves this; fire just makes you impatient with the pace. Slow down anyway. Earth energy also comes through your physical environment. Clear the clutter. Create spaces that feel solid and stable. Your surroundings should ground you, not amp you up. Warm lighting, natural materials, places to rest—these aren't luxuries for you, they're necessities.\n\nFire deficiency is less common for you but devastating when it happens. It looks like apathy, disconnection, going through the motions without any real enthusiasm. You stop caring about your causes. You stop believing change is possible. You withdraw from people and isolate yourself. This happens when you've given too much for too long without replenishing, when you've been repeatedly disappointed or betrayed, when you've lost sight of what you're fighting for. To rebuild fire, you need inspiration and connection. Surround yourself with wood energy—creative people, new ideas, growth-oriented environments. Read books that reignite your passion. Watch films that move you. Have conversations with people who still believe in something. Let their fire rekindle yours. But do it selectively. You don't need to save everyone; you need to save yourself first.\n\nSeasonally, summer is your natural high season. Your fire is strongest, your energy peaks, your social calendar fills. Lean into this, but don't overdo it. Summer is when you're most prone to excess. Build in rest even when you feel invincible. Autumn is when you need to start banking energy, preparing for the inward turn of winter. This is hard for you because autumn's metal energy wants to cut away and pare down, and your Pig nature resists letting go. Do it anyway. Release commitments that aren't serving you. Winter is your challenge. Short days, cold weather, less social energy—this can deplete your fire fast. You need practices that generate internal warmth: movement, heat, light, connection. Don't hibernate completely; you'll spiral. But don't force summer-level activity either. Find the middle path. Spring is when your fire starts rebuilding naturally. Use wood's growth energy to start new projects, but pace yourself. Don't blow all your energy in the first burst of enthusiasm.\n\nDaily, you need both activation and regulation. Morning is for igniting your fire: movement, light, something that gets your blood moving and your mind engaged. Evening is for cooling and grounding: dimmer lights, slower pace, practices that help you transition out of go-mode. You cannot stay in high gear all day and then wonder why you can't sleep. Fire needs to be tended, not just unleashed. The balance is dynamic, shifting based on what your life is asking of you, but the principle remains: feed your fire with purpose and connection, cool it with stillness and water, ground it with earth and completion. When you get this right, you're the person everyone wants in their corner—the Warm-Hearted Champion who actually has the energy to fight and the wisdom to fight for what matters."
}