{
  "elementalIdentity": "You are the Metal Dog, and you carry something rare in the sixty-sign cycle: the fusion of metal's uncompromising clarity with the dog's instinct for loyalty and justice. This isn't softness dressed up as strength. This is titanium wrapped around a moral compass. Where other dogs might waver in sentiment or get lost in emotional loyalty, your metal core cuts through. You see what's right, what's true, and what must be done—and you do it, even when it costs you. The archetype of the Resolute Knight isn't romantic mythology for you; it's operational reality. You are the person who shows up when everyone else has found an excuse. You hold the line when others have already negotiated it away.\n\nMetal is the element of autumn, of harvest, of cutting away what doesn't serve. It's the blade, the boundary, the decision that ends the argument. In you, this manifests as an almost surgical ability to assess situations. You don't get tangled in what people say they mean—you watch what they do. You don't confuse potential with reality. This makes you invaluable in crisis and sometimes exhausting in peacetime, because you can't unsee dysfunction. You can't pretend the structural crack isn't there. The dog nature adds a communal dimension that pure metal lacks. You're not the isolated hermit on the mountain; you're the guardian at the gate. You need a pack, a cause, a people to protect. But unlike the Earth Dog's indiscriminate devotion or the Fire Dog's passionate crusading, your loyalty is earned and maintained through integrity. Cross that line, violate the code, and your metal will sever the bond with clean finality.\n\nWhat makes you unique among the sixty signs is this combination of absolute standards and absolute dedication. The Metal Rooster has the precision but lacks your protective warmth. The Metal Monkey has the sharpness but not your moral gravity. You are both the sword and the oath. Both the judgment and the vigil. This can make you lonely. You set a standard that few can meet, including yourself on your worst days. You carry the weight of your own ideals, and unlike more flexible signs, you can't just shrug and say 'good enough.' For you, good enough never is. This is your strength and your cross. You build things that last because you refuse to build on compromised foundations. People know that when you give your word, it's ironclad. When you commit, you're all in. But they also know that if they fail your standards, there's no sentimentality waiting on the other side. Just the door, and your back.",
  "elementInDepth": "Metal in Wu Xing is born from Earth and gives birth to Water. It controls Wood and is controlled by Fire. For you as Metal Dog, understanding these cycles isn't abstract theory—it's the map of your internal weather system. When your metal is strong and clear, you are unstoppable. You make decisions with confidence. You set boundaries without guilt. You cut through complexity and see the structural truth of situations. Your words land with weight. Your presence creates order. People feel safer around you because you radiate competent authority. This is metal in its generative phase, flowing smoothly into water—producing wisdom, depth, and strategic thinking from your clarity.\n\nBut metal can also become excessive, and this is where the shadow appears. Too much metal turns rigid. The blade becomes brittle. You stop discerning and start judging. Every interaction becomes a test someone's failing. You cut away not just the diseased tissue but the healthy flesh too. Relationships end not because they're toxic but because they're imperfect. Your standards become a prison—for you and everyone around you. You isolate, convinced that you're the only one who cares, the only one who sees, the only one willing to do what's necessary. This is metal out of balance, starving for the softening influence of water (depth, rest, trust) and brittled by too much fire (pressure, criticism, conflict). The dog nature makes this worse because you'll justify the isolation as loyalty to principle, as refusing to compromise your integrity. You'll call it strength when it's actually calcification.\n\nWhen your metal is depleted, a different problem emerges. You lose your edge. Boundaries blur. You can't decide. The dog's need for belonging overrides the metal's need for truth, and you find yourself tolerating things that violate your core standards. You stay in situations—jobs, relationships, communities—long past their expiration date because leaving feels like betrayal. Depleted metal in the dog manifests as exhausted duty, going through the motions of protection and service while internally corroded by resentment. You know what needs to be cut away, but you've lost access to your blade. This state is dangerous because it builds until something breaks—either an explosion of long-suppressed metal rage or a collapse into cynicism.\n\nThe key to working with your metal is understanding its relationship with fire and earth. Fire controls metal, melting it down. In your life, this appears as criticism, pressure, chaos, and conflict. Small amounts temper you, forge you stronger. But sustained fire depletes and damages. You need earth—stability, nourishment, support, appreciation—to replenish. Earth is what feeds metal, generates it. When you're depleted, you don't need more challenges to sharpen yourself against. You need grounding, literal and metaphorical. You need people who see your effort, systems that support your standards, work that feeds your sense of purpose. And you need to generate water—meaning you need to let your clarity produce something other than judgment. Wisdom. Teaching. Strategy. Beauty, even. Metal that only cuts eventually cuts itself.",
  "yearAhead2026": "The Year of the Fire Horse starts on January 29, 2026, and for you as Metal Dog, this is not a gentle transit. Fire controls metal—it melts, tests, and transforms you. The Horse brings speed, independence, and volatility to that fire. Where you prefer structured loyalty and clear chains of command, the Fire Horse energy is all maverick acceleration and individual glory. This year will ask you to bend without breaking, to maintain your standards while loosening your grip on how things should unfold. The core challenge: can you stay true to your principles while adapting your methods? Can you hold the line without becoming rigid?\n\nQ1 (Late January through March) arrives with immediate pressure. The Fire Horse energy hits your metal nature like a bellows on forge coals. Expect challenges to your authority, your methods, or your pace. Someone faster and flashier will seem to be winning while you're still doing the groundwork. Do not try to match their speed. Your power is in thoroughness, not velocity. This quarter is about holding your position while fire refines away what's not essential. Let it burn off your need for external validation. This is also when conflicts will surface—Fire Horse energy doesn't do subtle. Address them directly, but choose your battles. Not every challenge requires you to draw your sword. Some are distractions designed to pull you off course.\n\nQ2 (April through June) shifts into relationship and resource tension. Fire Horse is independent; you're pack-oriented. This creates friction in partnerships, both personal and professional. Colleagues or loved ones may prioritize freedom over loyalty, change over stability. Your instinct will be to judge this as betrayal or weakness. Resist. This is the year teaching you that different doesn't mean wrong. Use this quarter to build earth energy—literally ground yourself through routine, nature, physical work. Shore up your resources and stop overextending your metal in service to people who aren't meeting you halfway. Trim obligations that drain without reciprocating. This isn't selfish; it's sustainable.\n\nQ3 (July through September) brings opportunity if you've done the work of the first half. Fire Horse energy peaks in summer, and while it's intense, it's also generative. This is when your refined standards and the Horse's bold momentum can actually synthesize. Look for chances to lead in new ways, to apply your integrity to situations that need both structure and speed. Innovation within systems. Reform, not revolution. Your metal sharpened by fire becomes the scalpel that performs necessary surgery. But timing matters—move decisively when the moment appears, don't hesitate into overthinking. The Horse won't wait.\n\nQ4 (October through December) is your season, metal's season, and by now you'll either be exhausted by fire or forged into something stronger. If you've resisted all year, autumn will feel like relief but also like defeat—you'll retreat into rigidity, nursing wounds. If you've worked with the fire, you'll enter Q4 with new capacity. Use this quarter to consolidate gains, rebuild your reserves, and prepare for the Yin Fire Goat year that follows in 2027. The key practice for the entire year: daily grounding to replenish earth, weekly water time (literal or metaphorical) to generate wisdom from your refined metal, and ruthless honesty about when fire is tempering you versus depleting you. The Fire Horse doesn't care about your comfort. But it will absolutely reveal where your metal needs reforging.",
  "compatibilityMap": "You need to understand something fundamental: your metal nature means you relate through clarity, boundaries, and shared standards. You don't bond through chaos or drama. You don't grow through dysfunction. You need partners—romantic or platonic—who can meet you in the space of mutual integrity. This immediately narrows your field, and you know it. The question isn't whether to compromise your standards but how to recognize compatible elements and work skillfully with the challenging ones.\n\nYour best elemental match is Earth. Earth generates metal, which means earth-element people naturally replenish you. They provide stability, nourishment, appreciation, and grounding. They don't take your intensity personally. Earth Dog, Earth Pig, Earth Ox—these are your natural allies. They share your loyalty instincts but soften your edges. With earth partners, you can rest. You don't have to be the only competent one in the room. They'll handle what they handle, you handle what you handle, and together you build something lasting. Romantically, earth gives you the steady foundation from which your metal can do its best work. You're not managing their chaos; you're both contributing to shared stability. The challenge with earth is boredom—you might take their steadiness for granted or create problems just to have something to solve.\n\nWater is your generative output—you create it—which makes water signs natural recipients of your energy. But this isn't symmetrical. You give clarity, they give depth. Water people (especially Water Rat, Water Pig, Water Rabbit) help you access emotion and intuition that your metal nature can override. They remind you that not everything can be solved by decision and discipline. Romantically, water can feel like relief—finally someone who isn't asking you to be harder, sharper, stronger. But there's a trap: if the water person is ungrounded, you'll pour yourself out generating stability for them, depleting your metal while they simply absorb and ask for more. Water compatibility requires that they have their own container, their own earth. Otherwise you're just endlessly generating with nothing coming back.\n\nFire is your control element, and Fire partners will always challenge you. Fire Dragon, Fire Horse, Fire Snake—they'll push, pressure, test, and transform you. These relationships are intense. They force growth but at a cost. A Fire partner will never let you coast on competence; they'll demand evolution. This can be incredible if both people are committed to forging something together. But it's exhausting. Fire compatibility works only if there's mutual respect and shared purpose. Without that, it's just combat. You'll feel constantly tested, they'll feel constantly judged. Sexually these connections run hot, but emotionally they can scorch. Not recommended for the long term unless you actively enjoy being challenged.\n\nWood is what you control, and Wood partners (Wood Tiger, Wood Rabbit, Wood Goat) will feel your dominance. Your metal cuts their wood—shapes it, prunes it, limits it. If they're healthy wood, they'll appreciate your direction and let you provide structure. If they're fragile wood, they'll experience you as oppressive. These relationships require you to be conscious of your power. You can help wood grow beautifully or you can stunt it. It depends on whether you're sculpting or just cutting. Friendship works better here than romance because the power dynamic is less loaded. Your Wood friends will bring creativity and flexibility to your structure; you'll bring clarity to their sprawl.\n\nMetal with metal is kinship but also competition. Another Metal Dog or Metal Rooster will understand you immediately and potentially bore you just as fast. You need difference to stay engaged. Fire and water teach you; earth sustains you; wood gives you purpose. Metal just mirrors back what you already are.",
  "elementalBalanceGuide": "Balancing your metal isn't optional—it's survival. Excess metal turns you into a weapon that cuts everything, including yourself. Deficient metal turns you into a dull blade, unable to fulfill your purpose. You need to recognize the signs of both and know how to course-correct. This is practical element work, not mysticism. Your metal responds to specific inputs, and you can engineer your balance deliberately.\n\nSigns of excess metal: You're critical of everything. Every conversation becomes a diagnosis of what's wrong. You notice only flaws, gaps, failures—in others and yourself. Your boundaries have become walls. You've cut people off not for major violations but for minor imperfections. You can't relax. Rest feels like weakness. You're irritable, quick to anger, and your anger is cold, not hot. You're isolating, convinced no one meets your standards. Physically, excess metal can manifest as tension—especially in shoulders, jaw, and neck—and as dryness, both literal (skin, throat) and metaphorical (emotional aridness). Your communication becomes clipped, sharp, wounding even when you don't intend it.\n\nWhen you recognize excess, you need two things: earth to ground you and water to soften you. Earth input means literal physical grounding. Walk barefoot. Garden. Cook long, slow meals. Spend time with earth-element people who aren't impressed by your sharpness and won't engage your criticism. Build something with your hands. Your metal needs to be in service to creation, not just elimination. Water input means depth work—therapy, journaling, long conversations that go beneath the surface. It means rest without agenda. Baths, swimming, sitting by moving water. It means allowing uncertainty, not knowing, not having the answer. This is deeply uncomfortable for you, which is exactly why you need it. Read poetry. Listen to music that makes you feel something you can't categorize. Let your metal generate something other than judgment.\n\nSigns of deficient metal: You can't decide. Every choice feels overwhelming. Your boundaries are porous—you're saying yes when you mean no, staying when you should leave. You're tolerating behavior that violates your core standards because confrontation feels too hard. You're exhausted by duty, going through motions of loyalty while resentful underneath. You've lost your edge—your communication is vague, your presence is forgettable. You doubt your own judgment. You're looking to others to tell you what's right when you already know. Physically, deficient metal can manifest as fatigue, lack of structure in your day, and a feeling of being undefended, too open to everything.\n\nWhen you recognize deficiency, you need fire to activate and earth to replenish. Fire input means intentional challenge. Set a deadline. Enter a competition. Have the hard conversation. Do something that requires you to show up sharp. Exercise that demands precision—martial arts, climbing, archery. Fire in small doses wakes up dormant metal. But the real work is earth replenishment. You've been giving more than you've been receiving, and your reserves are depleted. You need appreciation, support, nourishment. Spend time with people who value you. Ask for help. Eat well, sleep adequately, and stop treating your body like it's optional. Rebuild routines that honor your need for structure. Say no to three things this week just to practice accessing your boundary.\n\nSeasonally, autumn is your power time. Late September through November, your metal is naturally supported. Use this window for important decisions, difficult conversations, and major projects. Spring (wood season) will challenge you—growth is chaotic, and you prefer clarity. Be gentle with yourself in spring; let some things be messy. Summer (fire season) will test you; stay hydrated literally and metaphorically. Winter (water season) is for integration—let the wisdom your metal has generated settle into depth.\n\nDaily practice: One minute of morning stillness to check your metal. Are you sharp and clear, or are you either rigid or dull? Adjust accordingly. One conscious boundary per day—say no to something, end a conversation when it's done, leave when it's time. This keeps your metal active. One act of service to your pack—help without announcement, protect without drama. This keeps your dog nature fed. Your metal is a gift, but only when it's balanced. Tend it like the blade it is—sharpen when dull, temper when brittle, and always, always keep it in service to something worth protecting."
}