{
  "elementalIdentity": "You are the Wood Goat, and you occupy a rare space in the zodiac where creative vision meets emotional permeability. Your archetype — the Artistic Dreamer — isn't just poetic window dressing. It describes the specific tension that defines your existence: wood's drive to grow and expand fused with the goat's tendency to wander, absorb, and feel everything. Where other wood signs push forward with bamboo-like determination, you grow like a vine, seeking support, winding around structures, adapting your shape to whatever you touch. This makes you remarkably flexible but also chronically uncertain about your own form. Wood wants to rise toward light. The goat wants to belong, to merge, to be accepted. This combination creates someone who dreams in color and texture, who feels the world aesthetically before they think it through logically, but who second-guesses nearly every impulse because they're terrified of growing in the wrong direction. You're not weak — that's a misread of your nature. You're receptive. Your wood element gives you an artist's eye, a ability to see potential in raw material, whether that's a blank canvas, an empty room, or a broken person. The goat's nature makes you empathetic to the point of porousness. You don't just understand suffering; you absorb it. This is your gift and your curse. You can create beauty that moves people because you've internalized their pain. But you also carry weight that isn't yours, and you struggle to differentiate between your authentic growth direction and the needs of everyone around you. Other wood signs — the Tiger, the Rabbit, even the Dragon — have a clearer sense of their trajectory. You don't. You're the wood sign that questions whether you should even be growing at all, whether your dreams are valid, whether you deserve the sunlight. This doubt isn't a flaw in your design; it's part of how you stay flexible enough to create something genuinely original. Rigid wood snaps. You bend. The challenge is that bending can become collapsing if you're not careful. Your artistic nature isn't about whether you paint or write or make music, though many of you do. It's about how you process reality: through pattern, through feeling, through aesthetic coherence rather than logical sequence. You need beauty the way other signs need achievement or security. Ugliness — in environment, in relationship dynamics, in daily routine — depletes you faster than actual hardship. You can endure difficulty if it has meaning, shape, poetry. You cannot endure meaningless grinding. The dreamer part of your archetype is equally literal. You live partially in potential, in what-could-be, and this makes present reality feel simultaneously too harsh and too small. You're the sign most likely to sacrifice practical stability for a vision only you can see, then panic when the bills come due. The Wood Goat doesn't fit neatly into conventional success frameworks, and you waste years trying to before you finally accept that your path looks different.",
  "elementInDepth": "Wood in your chart functions like water seeking cracks in stone — persistent but indirect, growth-oriented but opportunistic. Where wood in the Tiger is a thunderstorm of expansion and wood in the Rabbit is steady spring growth, your wood is the artist's wood: responsive, interpretive, shaped by what it encounters. This element gives you your core strengths: adaptability, creativity, emotional intelligence, and an instinct for nurturing growth in others. But wood in the goat configuration faces a specific vulnerability. The goat's yin metal nature creates an internal control cycle before you even interact with the external world. Metal controls wood in the destructive cycle, which means you have a built-in tendency toward self-pruning, self-criticism, and cutting yourself down before anyone else can. This isn't about low self-esteem in the pop psychology sense. It's an elemental dynamic where your own animal nature constantly questions and refines your wood impulses. This can produce exquisite taste and high standards, or it can produce paralysis. When your wood is strong — when you're in environments that support growth, around people who believe in your vision, engaged in work that feels meaningful — you're remarkably productive in a distinctly non-linear way. Your growth isn't about climbing a ladder; it's about sending out shoots in multiple directions, seeing what takes root, creating a network of interconnected projects and relationships. Strong wood gives you the confidence to follow your aesthetic instincts without constantly seeking external validation. You create because the growth impulse itself is satisfying. You collaborate because extending yourself toward others feels natural. You take risks because you trust that even if this particular branch doesn't bear fruit, the overall organism is healthy. But when your wood is depleted — and this happens easily because the goat's nature is to give and accommodate — you become stuck, anxious, and creatively blocked. Depleted wood in a Wood Goat looks like someone who has all the vision but none of the vitality to execute. You see what could be beautiful but lack the energy to make it real. You feel what others need but have nothing left to offer. This is when you become passive-aggressive, when your flexibility curdles into resentment, when you start blaming external circumstances for your internal depletion. The productive cycle offers you a lifeline: wood generates fire. When you channel your growth energy into passion, excitement, genuine enthusiasm, you complete the cycle and avoid stagnation. This means you need to regularly transform your dreaming into doing, your sensitivity into expression, your empathy into art or action. Fire isn't foreign to you; it's what your wood wants to become. The problem is that the goat's nature often resists this transformation because fire is bold and you fear being too much, too visible, too demanding. You'd rather stay in the wood phase, nurturing and supporting, because it feels safer. But wood that never generates fire just piles up as dead material. The destructive cycle where wood controls earth reveals another dimension of your nature. You have more power than you realize over earth types — the Ox, the Dragon, the Dog, the Goat itself in its earth years. Your ideas can destabilize their structures. Your emotional fluidity can overwhelm their need for solid ground. But you rarely wield this power consciously because you're too busy trying not to inconvenience anyone. Learning to consciously direct your wood energy, to control rather than be controlled, is part of your developmental path. It feels unnatural at first, almost aggressive. But it's actually how you maintain healthy boundaries and prevent your own depletion.",
  "yearAhead2026": "The Year of the Fire Horse starting February 2026 is going to push you in ways you're not expecting, and whether that push propels you forward or knocks you over depends entirely on choices you make in the first quarter. Fire Horse years are dramatic, fast-paced, and uninterested in subtlety. For you as a Wood Goat, this is both opportunity and threat. The fire element is your natural child in the productive cycle — wood generates fire — which means 2026 wants to take your ideas, your dreams, your carefully nurtured visions and set them ablaze. This can be spectacular or devastating. The Horse energy is direct, ambitious, and socially bold, which is essentially everything the goat nature resists. But here's what you need to understand: this year isn't asking your permission. It's going to accelerate your timeline whether you're ready or not. Q1 — February through April — is your critical window. This is when you establish which of your wood-phase projects are ready to catch fire and which need to stay protected. Be ruthlessly honest with yourself about what's actually developed versus what's still just a pleasant daydream. The Fire Horse has no patience for half-formed ideas, but it will amplify anything that has real structure. If you've been working on something — a creative project, a relationship, a career pivot — and it has actual bones under the vision, introduce it to fire in Q1. Put it out publicly, have the difficult conversation, make the commitment. If it's not ready, protect it. The Horse energy will trample seedlings without noticing. This is also when you'll feel the strongest pull to be more visible than comfortable. Accept some of that discomfort. The year is training you in fire skills. Q2 — May through July — brings the resource question. Fire consumes wood to sustain itself, and you're going to feel the drain. This is when your tendency to over-give and deplete yourself becomes dangerous. The Horse year will present opportunities that sound exciting but cost more than you can see upfront. Your discernment practice in Q2 is to ask: does this opportunity feed my fire or just burn my wood? Does it transform my creative energy into something greater, or does it just extract from me? You'll need to say no more than usual, and it will feel like you're missing out. You're not. You're maintaining the resource base that makes the rest of the year sustainable. Watch for Fire Horse people entering your life — they'll be charismatic, confident, and initially inspiring. Some will be genuine collaborators who help you access your own fire. Others will be pyromaniacs who want to use your wood as fuel for their agenda. Learn to tell the difference quickly. Q3 — August through October — is your performance period. Whatever caught fire in Q1 and survived the resource management of Q2 now needs to be actively tended and directed. This is not the time to retreat into your dreamer nature or wait for things to unfold organically. The Fire Horse year rewards bold action and punishes hesitation. Your wood flexibility is an asset here, but only if you're using it to navigate obstacles, not avoid commitment. This quarter will test whether you've actually developed fire skills or just borrowed someone else's enthusiasm. Relationships accelerate in Q3 — for better or worse. Partnerships that have real heat move to the next level. Ones that have been sustained by your people-pleasing catch fire and burn out. Let them. Q4 — November through January — is integration and recovery. By this point you'll be exhausted in a way that feels different from your usual depletion. This is fire fatigue: too much yang, too much output, too much exposure. The year's final months ask you to bank the coals and return to your wood nature, but transformed. You're not the same Wood Goat who entered the year. You've developed fire capacities that were always potential but never tested. Use Q4 to process what happened, to turn experience into wisdom, to let your wood nature repair and prepare for the next growth phase. The biggest trap of 2026 is believing you need to become a Fire Horse to succeed in a Fire Horse year. You don't. You need to be a Wood Goat who has learned to generate and direct fire intentionally, then return to your wood nature without shame. This year is teaching you that your sensitivity and creativity are not weaknesses to overcome but resources to transform into impact. By the end of 2026, you should have at least one dream that is no longer just a dream, one vision that has become visible reality, and a new relationship to your own power that doesn't apologize for existing.",
  "compatibilityMap": "Your relationship dynamics are more complex than most signs because you lead with emotional receptivity rather than fixed identity. You don't have strong walls, which means you take on the elemental quality of whoever you're close to. This is your superpower and your liability. In elemental terms, you're most naturally compatible with fire and water types, but for entirely different reasons and with different outcomes. Fire signs — the Snake, the Horse, especially the Fire variations — excite you in ways that feel like coming alive. Fire needs wood to sustain itself, and you instinctively want to provide that fuel. These relationships are passionate and inspiring but dangerous if imbalanced. A healthy fire partner transforms your creative potential into actualized work, gives you confidence to be visible, and shares enough warmth that you stop shrinking. An unhealthy fire partner just burns through you, using your ideas and emotional labor as fuel for their agenda while leaving you depleted and empty. The key with fire types is that you must maintain enough self-awareness to notice when feeding the fire stops being generative and starts being consumptive. In romance, fire signs will pursue you intensely initially, drawn to your sensitivity and depth. The sex is often exceptional because you're so responsive and they're so present. But long-term success requires that you develop enough fire of your own that the relationship is about two flames dancing, not one flame and a pile of kindling. In friendship, fire types are the ones who pull you out of your hermit phases and remind you that visibility isn't death. Water signs — the Rat, the Pig, and especially water-year variations — feel like home in ways that can be too comfortable. Water nourishes wood in the productive cycle, and these people often support your growth without demanding you be anything other than what you are. Water types understand your emotional complexity and don't require you to perform certainty you don't feel. These relationships are deeply intimate and restorative but can become stagnant if neither person pushes the other toward fire. You can spend years in a water-nourished relationship feeling supported but not growing, comfortable but not creating. The risk is mutual stagnation: two people who understand each other perfectly but enable each other's avoidance of risk. In romance, water signs offer emotional safety you crave, but you may eventually feel the relationship lacks spark or direction. In friendship, they're your processing partners, the ones who can hold space for your full emotional range. Earth signs — the Ox, the Dragon, the Dog, other Goats in earth years — present your most challenging dynamic. Wood controls earth in the destructive cycle, which means you have inherent power over earth types even though you rarely feel powerful. They sense this and often respond with resistance or attempts to contain your fluidity. Earth needs stability; you need flexibility. Earth plans; you dream. Earth accumulates; you distribute. These relationships require enormous effort and usually work only when the earth person has strong water in their chart or you have strong earth elements that bridge the gap. The sexual dynamic is often fraught — they want consistency, you want responsiveness. They experience your changeability as flakiness; you experience their stability as rigidity. In professional contexts, earth types can provide structure for your creativity, but they'll try to own the output. In friendship, you probably won't stay close unless there's a strong secondary element connecting you. Metal signs — the Monkey, the Rooster — are the hidden difficulty. Metal controls wood in the destructive cycle, and you feel this as a constant pruning of your natural expression. Metal types are often attracted to your creativity but immediately want to refine it, edit it, make it more precise. They see potential in you but always with the assumption that you need cutting back to reach it. This can be useful in small doses — a metal mentor or editor who sharpens your work — but in intimate relationships it becomes death by a thousand cuts. You start to internalize their criticism, becoming unable to grow freely. The sex is often technically skilled but emotionally disconnected. They're performing; you're feeling. Romance with metal types rarely works long-term unless they have significant water or fire softening their edges. In all relationships, your challenge is the same: you must maintain enough wood integrity that you bend without breaking, adapt without disappearing. You need to learn the difference between healthy compromise and self-erasure. The right partner for a Wood Goat isn't someone who completes you — that's a trap that leads to codependence. The right partner is someone who tends the conditions for your growth while maintaining their own root system, someone who can handle your emotional weather without trying to control it, and someone who believes in your dreams enough to occasionally push you to make them real.",
  "elementalBalanceGuide": "Balancing your wood energy is a daily practice, not a destination, and it looks different depending on whether you're dealing with excess or deficiency. Most Wood Goats spend more time in deficiency than excess because your animal nature gives so readily and your wood doesn't know how to stop without feeling selfish. Deficient wood shows up as creative blockage, decision paralysis, resentment that you can't articulate, physical stiffness especially in the neck and shoulders, feeling simultaneously exhausted and restless, and a loss of vision for your own life while you can still clearly see everyone else's potential. When your wood is deficient, you need to actively build it back, and this requires being more selfish than feels natural. Stop pruning yourself preemptively. Stop asking permission to take up space. Start saying the first thing that comes to mind instead of the carefully edited version. Engage with living green things — not as metaphor but as actual practice. Tend plants, spend time in forests, watch things grow. Your element learns from direct contact with its own nature. You need morning sunlight on your face, the literal east-facing direction, spring energy even in other seasons. Mornings are your power time as a wood sign; use them for your own creative work before you give energy to anyone else's agenda. If you're depleted, you must generate fire even when you don't feel like it: move your body with intensity, have the difficult conversation, share the unfinished work, do the scary thing. Fire transforms stagnant wood. Excess wood is rarer in Wood Goats but appears when you're finally in a supportive environment and suddenly over-commit, over-grow, and send shoots in too many directions without enough root depth. Excess wood looks like scattered energy, starting many projects and finishing none, emotional volatility, judgmental righteousness about your aesthetic or values, insomnia with racing thoughts, and inflammation or tension headaches. When wood is excessive, you need to intentionally direct it into fire or allow metal to prune. This means choosing one or two primary focuses and killing the rest, at least for now. It means accepting critical feedback without taking it as personal attack. It means intense physical activity that burns through the excess energy — run until you're tired, not just until you've thought through your problems. Excess wood also needs earth's grounding: routine, weight-bearing exercise, protein-heavy foods, time with earth-element people who slow you down. Your seasonal awareness must be precise. Spring is your native season, but you can overdo it — too much new beginning without completion of old growth. Spring asks you to initiate but also to thin the seedlings. You can't grow everything. Summer supports your wood by allowing it to generate fire naturally, and you should use summer for maximum visibility and output. This is when you share work, perform, teach, lead. Autumn is your hardest season because metal energy is strong and you feel it as cutting back, dying back, losing momentum. Don't resist this. Autumn is when you learn to let go of what didn't work, to compost failed projects, to make peace with what you're not going to become. This is not defeat; it's necessary for next spring's growth. Winter requires you to rest in ways that feel like death if you're not prepared. You need actual dormancy: less social interaction, more internal processing, permission to not produce. Water is feeding your roots in winter even though nothing visible is happening. Your environment shapes your wood energy more than most signs because you're so permeable. You need beauty in your immediate surroundings — this is not optional or indulgent. Ugly spaces make your wood sick. Your nervous system calms in natural materials, in spaces with plants, in rooms with eastern light. You cannot sustain yourself in fluorescent corporate environments or minimalist spaces that prioritize function over feeling. Your home should be a little overgrown, a little crowded with meaningful objects, full of textures that want touching. Color matters: greens obviously, but also the colors of fire since that's your generative direction. Avoid excessive white or metal tones. The daily practice that serves you most is morning pages or any form of unedited creative expression before your critical metal voice wakes up fully. Your wood needs to move freely before it gets pruned. Physical flexibility practices — yoga, stretching, dance — keep your element literally flexible and prevent the stiffness that comes from blocked wood. You need regular contact with people who believe in your vision, not to validate your existence but to remind you that your way of seeing has value. And you need to practice the hard fire skill of completion: finishing things even when they're not perfect, sharing work before you think it's ready, letting others see your process. Your elemental balance isn't about becoming more metal-like in your discipline or more earth-like in your stability. It's about being so deeply rooted in your wood nature that you can generate fire confidently, receive water without drowning, touch earth without being controlled, and allow metal to prune without being destroyed. This is the work of your lifetime."
}