{
  "elementalIdentity": "You are the Wood Rat, and your existence is a study in controlled urgency. While other Rats scatter and scramble, you grow with purpose. Wood gives your Rat nature something it desperately needs: a trunk to climb, roots to anchor the constant mental motion. You're not just surviving—you're establishing ecosystems. The Resourceful Pioneer archetype fits because you don't merely find opportunities; you plant them, tend them, watch them mature. Your mind works like spring itself: relentless, optimistic, always pushing through the last frost.\n\nThe Rat brings cleverness, adaptability, and an almost supernatural ability to sense what's coming. Add Wood—the element of vision, expansion, and upward growth—and you get someone who doesn't just react to circumstances but actively shapes the landscape around them. You're strategic but not cold. You accumulate but not out of fear. Where the Metal Rat hoards and the Water Rat flows opportunistically, you build networks that grow organically. You see the forest AND the trees, which frankly exhausts you sometimes.\n\nWhat makes you distinct among the sixty signs is this: you have the Rat's survival instinct married to Wood's faith in tomorrow. Most Rats operate from scarcity consciousness, always preparing for winter. You prepare too, but you're simultaneously planting next year's harvest. This makes you the entrepreneur, the community organizer, the person who starts the co-op or the side venture that somehow becomes an empire. You don't wait for permission or perfect conditions. You're disgustingly good at starting things.\n\nBut here's the shadow: Wood Rats can become controlling in their benevolence. You want things to grow YOUR way, according to YOUR vision. When people don't follow your carefully laid plans, you experience it as personal betrayal. Your flexibility—Wood's great gift—can calcify into rigidity when you're stressed. You stop being the bendable willow and become the stubborn oak that won't yield an inch. The Rat's anxiety amplifies this. You'll lie awake obsessing over all the things that could go wrong with your plans, all the people who might not do their part.\n\nYour gift to the world is generative leadership. You create abundance, not through domination but through cultivation. You see potential in people and projects others overlook. You're willing to invest time and energy upfront because you understand growth cycles. The trade-off? You can be maddeningly idealistic, disappointed when reality doesn't match your vision of what could be. You're pioneering new ground, which means you're often alone at the frontier, wondering why others don't see what's so obvious to you. They will, eventually. Wood Rats are usually ten years ahead, which is both your genius and your curse.",
  "elementInDepth": "Wood in Chinese elemental theory is the energy of spring, expansion, and unrestrained growth. It's Yang within Yin—active, upward, insistent. In your Rat nature, this manifests as directed ambition rather than scattered hustle. Regular Rats are like water finding cracks; you're more like roots breaking through concrete. Patient but unstoppable. Wood gives you something most Rats lack: genuine idealism. You actually believe things can improve, communities can thrive, systems can be redesigned. This isn't naivety—it's Wood's fundamental nature asserting itself through your Rat pragmatism.\n\nIn the productive cycle, your Wood generates Fire. This is crucial for you. When you're balanced, your growth energy naturally transforms into passionate action, enthusiasm, visibility. You don't just plan; you inspire. People catch your vision because your Wood feeds the Fire of collective excitement. This is why Wood Rats make excellent movement-starters, founders, teachers. You generate the fuel others need to burn bright. But this also means you can deplete yourself feeding everyone else's flames. You give and give, feeding Fire, until your Wood is stripped bare.\n\nWood controls Earth in the destructive cycle, which shapes your relationship with stability and structure. At your best, you bring necessary disruption to stagnant systems. You break up compacted soil so new things can grow. You challenge traditions that have ossified into obstacles. But when your Wood is excessive—overgrown, unrestrained—you become controlling, critical, unable to let things be. You micromanage, you over-organize, you turn collaborative projects into vehicles for your vision alone. You're basically trying to control Earth energy out of existence, which never works.\n\nWhen your Wood is strong, you're magnificent. Creative, generous, strategic, connected to long-term vision. You build networks effortlessly. You see three moves ahead. You're flexible enough to adapt but rooted enough to persist. You balance the Rat's cleverness with Wood's compassion, making you shrewd but not cruel, ambitious but not ruthless. Strong Wood gives you the confidence to take risks because you trust your ability to grow through challenges.\n\nDepleted Wood is a different story. When your Wood energy is weak—through overextension, lack of rest, or spending too much time in Metal environments (criticism, rigidity, cutting)—your Rat nature spirals. The anxiety intensifies. The resourcefulness becomes mere scrambling. You lose connection to your vision and just react, react, react. Depleted Wood makes you brittle, resentful, exhausted. You snap at people, abandon projects halfway through, feel like nothing you plant ever grows. You stop trusting the process and start forcing outcomes, which of course makes everything worse.\n\nMetal controls Wood in the elemental cycle, and this is where your real vulnerability lives. Harsh criticism, rigid systems, cutting remarks—these don't just hurt your feelings; they sever your energetic roots. You need to be careful around Metal-dominant people and environments. They can prune you helpfully or cut you down entirely, and you won't always see it coming. Water nourishes Wood, which is why you flourish around Water signs and in fluid, emotionally honest environments. You need that nourishment, that permission to grow wild occasionally.",
  "yearAhead2026": "The Fire Horse year arrives, and it's not here to coddle you. Fire Horse energy is bold, fast, untamed—everything happens at gallop speed with mane flying. For you, Wood Rat, this is simultaneously energizing and exhausting. Your Wood generates Fire, remember, so you're literally fueling this year's intensity. The question is whether you'll do it consciously or burn yourself out feeding a wildfire you can't control.\n\nThe opportunity: 2026 wants what you have. Fire Horse years reward pioneers, visionaries, people willing to move quickly on instinct. Your Wood Rat combination has been preparing for this. All those seeds you planted, networks you built, ideas you developed—they can catch fire now in the best sense. This is a year for bold moves, public launches, expansion. The Horse brings momentum and the Fire brings visibility. If you've been too cautious, too hidden, too careful, 2026 will drag you into the spotlight whether you're ready or not. Might as well step forward deliberately.\n\nThe warning: Fire consumes Wood. You already tend to over-give, over-plan, over-extend. The Fire Horse year will tempt you to do even more. Every opportunity looks golden, every project seems urgent, everyone needs your energy. You'll feel simultaneously powerful and depleted, sometimes within the same afternoon. Your challenge is discernment. Not every fire needs your Wood. Some blazes aren't yours to fuel. The Horse energy is impulsive; your Rat nature is strategic. Let the Rat lead on timing even when Fire Horse is pushing for immediate action.\n\nQ1 (January-March): The year starts with you feeling the pressure build. Fire Horse energy is gathering, and your instinct will be to prepare frantically. Don't. Use these months for strategic pruning instead. Cut away commitments that drain you. Strengthen your roots. The growth explosion comes later; early 2026 is for getting clear on what you actually want to expand. One focused priority beats five scattered efforts.\n\nQ2 (April-June): Now we're moving. This is your power quarter. Spring energy aligns with your Wood nature while Fire Horse momentum builds. Launch, announce, initiate. Your ideas have legs now. Collaborations form quickly. But watch for the tendency to say yes to everything. The Horse brings opportunities at speed; your Rat discernment must keep pace. Choose growth that aligns with your core vision, not just what's available.\n\nQ3 (July-September): Peak intensity. You're tired but can't quite stop. The Fire is demanding more Wood, and you're probably over-delivering. This is when you're most likely to burn out, snap at allies, or abandon projects out of sheer exhaustion. Build in rest ruthlessly. The Horse year doesn't pause naturally, so you must create boundaries artificially. Say no more than feels comfortable. Your autumn self will thank you.\n\nQ4 (October-December): Harvest and assess. Some of what blazed bright will have burned out. That's fine. Fire Horse years are as much about clearing as building. Look at what sustained and what didn't. The year ends with you feeling both accomplished and wrung out. Let yourself rest. Water season approaches, and you'll need those nourishing energies to recover from feeding this Fire year. Don't start new projects in Q4; complete, consolidate, rest.",
  "compatibilityMap": "Your relationship dynamics are shaped by one core tension: you need both growth and security, expansion and roots. The Rat in you wants safety, partnership, someone watching your back. The Wood in you needs space to grow, autonomy, room to pursue visions that others might not understand yet. Your ideal matches understand this paradox and don't force you to choose.\n\nElementally, Water signs are your natural nourishment. Water Monkeys, Water Dragons, even Water Pigs—they feed your Wood without trying to control it. These relationships feel easeful, supportive, emotionally honest. Water matches give you permission to grow while providing the emotional depth Rats crave. The sex is intuitive, the friendship loyal, the collaboration natural. But Water can also enable your worst tendencies. Water partners might not push back when you're overextending or losing perspective. Too much support becomes stagnation if you're not careful.\n\nFire signs are complex for you. Fire Horses, Fire Tigers, Fire Snakes—they're exciting, passionate, visible. You generate Fire naturally, so these relationships crackle with energy and mutual inspiration. Fire partners pull you out of Rat anxiety and into action. They push you toward bigger stages, bolder moves. But Fire also consumes Wood, remember? Fire relationships can drain you if they're always taking your energy without replenishing it. In romance, this manifests as passion that burns hot and fast. In friendship, Fire signs are your adventure buddies but not always your soft place to land.\n\nEarth signs create friction you might actually need. Earth Oxen, Earth Rabbits, Earth Roosters—they stabilize you, ground you, force you to make your visions practical. You control Earth in the cycle, which can make you dismissive of their caution. They seem slow, overly practical, resistant to your brilliant ideas. But healthy Earth relationships teach you completion, not just initiation. They help you build things that last rather than just sprout everywhere. Romantically, Earth signs feel safe but potentially boring. You need enough Fire elsewhere in your life to tolerate Earth's steadiness.\n\nMetal signs are your true challenge. Metal cuts Wood; it's the nature of the cycle. Metal Roosters, Metal Monkeys, Metal Snakes—they criticize your idealism, cut down your visions before they're fully formed, introduce doubt exactly when you need confidence. These relationships can be incredibly productive if the Metal is refined (constructive criticism, helpful pruning) rather than crude (harsh judgment, constant negativity). But they're exhausting. Metal partners see your flaws clearly and won't let you hide behind charm. This can foster growth or just make you defensive and brittle.\n\nWood-to-Wood relationships (other Wood Rats, Wood Tigers, Wood Rabbits) are either magical or competitive. Two visionaries can build empires together or just fight over whose dream to pursue. The friendship potential is huge—you understand each other's need for growth and autonomy. Romantically, you need to ensure someone is tending roots while the other chases sky.\n\nIn love, you're devoted but need independence. You want partnership that feels like co-creation, not constraint. You fight by over-explaining your perspective, sometimes condescendingly. You grow through relationships that challenge your control without crushing your spirit. Friendship is often easier for you than romance because it demands less compromise on your autonomy.",
  "elementalBalanceGuide": "Balancing your Wood energy is not optional—it's survival. Excess Wood makes you controlling, rigid, and exhausted from trying to manage everyone's growth. Deficient Wood leaves you anxious, scattered, disconnected from purpose. You need practices that keep your Wood nourished but not overgrown, flexible but not weak.\n\nSigns of excess Wood: You're micromanaging everything. Your idealism has become judgment—people should be better, work harder, see your vision. You can't rest because there's always one more thing to plan, fix, organize. Your jaw is tight, your shoulders are up near your ears, and you're getting tension headaches. You're irritable with people who move slower than you. You've stopped asking questions and started issuing directives. Your body feels wiry, restless, unable to soften. This is Wood overgrown, trying to control Earth, generating too much Fire without replenishing itself.\n\nSigns of deficient Wood: You've lost connection to your vision and are just reacting to demands. The Rat anxiety is running the show—scrambling, worrying, unable to think long-term. You start projects and abandon them. You feel brittle, like you might snap under any pressure. You're making decisions from fear rather than possibility. Your creativity is gone; everything feels obligatory. You're probably also getting sick more often because depleted Wood weakens your body's defense systems. You've stopped believing things can improve.\n\nDaily practices for Wood balance start with literal growth. Tend plants—seriously. The Wood Rat who keeps a garden, even just houseplants, stays more balanced than one who doesn't. Something about nurturing growth outside yourself regulates your tendency to control or abandon growth inside yourself. Morning walks, especially in nature, especially in spring, are non-negotiable. Your element is literally trees, grass, expansion. You need contact with growing things.\n\nEnvironment adjustments matter enormously. Your spaces should have living elements—plants, natural light, wood furniture. But also flow and openness. Rats need some enclosure (not too exposed), but Wood needs room to expand. Find the balance. Green and brown in your surroundings support Wood without overdoing it. Avoid too much Metal in your space—lots of white, sterile environments, harsh lighting, cold materials. They'll deplete you subtly but consistently.\n\nSeasonally, spring is your power time. You're aligned with the world's energy. Use spring for new projects, big growth moves, planting literal and metaphorical seeds. Summer (Fire season) can exhaust you if you're not careful—you're generating Fire naturally, and summer intensifies this. Build in rest during summer months. Autumn (Metal season) requires conscious nourishment because Metal controls Wood. This is when you're most vulnerable to criticism, doubt, cutting yourself down. Bolster your Water intake in autumn—spend time near water, prioritize emotional connections, let yourself be nourished. Winter (Water season) is for deep rest and vision-setting. Let Water feed your Wood rather than fighting the slower pace.\n\nLeveraging element cycles for growth means understanding when to push and when to yield. When you feel overgrown (too much Wood), spend time with Metal influences—get feedback, edit ruthlessly, cut away excess. When you feel depleted (too little Wood), seek Water—rest, emotional connection, fluid environments, literal time in or near water. When you need to manifest (turn vision into reality), feed Fire consciously—take action, increase visibility, collaborate with Fire types. When you need grounding (too much in your head), work with Earth—make things practical, build systems, complete rather than just initiate.\n\nYour work-rest cycle should follow seasonal logic, not industrial logic. You can't produce at the same rate year-round. Spring and early summer are for expansion. Late summer and autumn are for harvest and consolidation. Winter is for rest and planning. Fighting this rhythm depletes your Wood and makes you resentful. Finally, recognize that your Wood generates Fire naturally—you're always giving energy to others. This is beautiful but unsustainable without conscious replenishment. Schedule nourishment as non-negotiably as you schedule productivity. Water feeds Wood. Find your Water sources and drink deeply, regularly, without guilt."
}