{
  "elementalIdentity": "You are the Wood Monkey—a creature of endless ingenuity wrapped in spring's irrepressible growth force. While other Monkeys bounce around in their respective elements, you carry something they don't: the relentless upward drive of wood combined with the Monkey's gift for seeing seventeen solutions where others see a brick wall. This makes you the most idealistic of all Monkeys, and that's both your genius and your burden.\n\nWood is the element of expansion, vision, and benevolence. It pushes upward like bamboo through concrete. The Monkey is clever, restless, curious to the point of compulsion, and deeply allergic to boredom. Fuse these together and you get someone who doesn't just want to solve problems—you want to revolutionize systems, preferably while making it look easy and cracking jokes the entire time. You're the person who sees the broken structure everyone else accepts and thinks, \"I could rebuild that better by Tuesday.\" And you probably could.\n\nYour archetype—The Inventive Trickster—captures this duality perfectly. You trick not for chaos but for growth. You disrupt because you genuinely believe there's a better way forward. Other Monkeys might con for sport or status; you con for progress. There's an idealism embedded in your nature that people miss if they only see the surface cleverness. You actually care about improvement, about innovation that serves people, about making things grow. Wood gives you that compassionate forward vision. The Monkey gives you the mental agility to manifest it through unconventional means.\n\nBut here's where it gets complicated: Wood needs direction or it becomes invasive. Monkey needs challenge or it becomes destructive. You without a worthy problem to solve become scattered, meddling, unable to stop \"improving\" things that don't need your help. You're the friend who reorganizes someone's kitchen without asking—genuinely trying to help, genuinely making it more efficient, and genuinely not understanding why they're annoyed. Your growth impulse lacks an off switch.\n\nThe Wood Monkey combination also makes you more emotionally complex than you let on. Wood is associated with compassion and sensitivity, with the liver's role in emotional flow. You feel things deeply—deeper than your quick wit and easy laugh suggest. You use humor as wood uses leaves: as a beautiful distraction from the vulnerable trunk beneath. People think you're carefree because you move fast and think faster, but you're actually driven by genuine concern for how things could be better, how people could be happier, how systems could serve rather than trap.\n\nAmong the sixty signs, you're the one who most embodies innovative compassion. You're not just smart—lots of signs are smart. You're smart in service of growth. That's what sets you apart. Your inventiveness isn't cold calculation; it's warm-blooded problem-solving rooted in the belief that expansion and improvement are always possible. You're spring itself: irrepressible, optimistic, occasionally overwhelming, but fundamentally life-affirming.",
  "elementInDepth": "Wood in you manifests as perpetual forward momentum. You experience the world as a series of possibilities for growth and expansion. Where Fire signs see passion and Metal signs see structure, you see potential—the gap between what is and what could be. This makes you visionary but also occasionally exhausting, because you can't unsee the improvements that need making. Your wood nature means you're constantly generating new ideas, new approaches, new angles. The Monkey's mental agility ensures you can actually execute on these visions, but wood's nature means you're already three ideas ahead before you've finished the first one.\n\nIn the productive cycle, wood generates fire. This is your natural creative outlet—you're meant to feed the flame of action, enthusiasm, transformation. When you're balanced, your ideas spark genuine change. You inspire people, get them excited about possibilities, create momentum. You're the catalyst that turns stagnant situations into dynamic ones. Your wood energy feeds fire energy in others, which is why people often feel energized around you. You make them believe things can change because you genuinely believe it yourself.\n\nIn the destructive cycle, wood controls earth. You do this instinctively—you break up stagnation, you disrupt over-stability, you won't let things settle into comfortable dysfunction. This is necessary work. Earth energy can become stuck, complacent, resistant to needed change. Your wood nature intuitively knows when to crack that foundation open and let something new grow through. But unbalanced, this becomes intrusive. You control earth too much—you destabilize people who need grounding, you \"improve\" systems that are working fine, you can't let anything just be. You become the invasive root system that buckles the sidewalk.\n\nWhen your wood is strong—when you're well-resourced, purposeful, connected to genuine growth—you're magnificent. You're creative without being scattered, flexible without being flaky, visionary without being disconnected from reality. Strong wood in a Monkey means you can take that lightning-fast mind and channel it toward sustainable innovation. You build things that last while still being interesting. You're generous with your ideas, collaborative, able to see how your growth supports others' growth too. You embody wood's benevolent nature: you genuinely want everyone to thrive.\n\nWhen your wood is depleted, everything inverts. Weak wood loses its upward drive and either becomes rigid or collapses entirely. You might scatter into a thousand projects, finishing none. Or you might become strangely controlling, trying to force growth according to your timeline, your vision, unable to trust natural timing. Depleted wood loses its flexibility—you become brittle, defensive, unable to bend when life requires it. The Monkey's cleverness without wood's grounding vision becomes mere trickery without purpose. You're still quick-witted but now it's in service of nothing, just mental gymnastics to avoid feeling stuck.\n\nYou're also vulnerable to wood's tendency toward frustration when growth is blocked. Wood energy needs room to expand. When you feel constrained—by circumstances, relationships, systems, or your own limitations—you experience it physically. That restless irritability, that snappish impatience, that feeling of pressure building with nowhere to go. The Monkey in you wants to outsmart the obstacle; the wood in you wants to grow through it. When neither works, you spiral.\n\nThe element that nourishes you is water—it supports wood's growth, gives it the resources it needs. You need emotional depth, rest, reflection, the willingness to slow down and absorb. But Monkeys hate slowing down, which means you often run on depleted reserves, wondering why your brilliant ideas aren't landing like they should. You need water's patience to balance wood's drive and Monkey's speed.",
  "yearAhead2026": "The Year of the Fire Horse arrives like a wildfire, and for you, Wood Monkey, this is simultaneously your moment and your test. Fire is the element you naturally generate—wood feeds fire in the productive cycle—which means 2026 asks you to pour your creative energy into something that will burn bright and move fast. The Horse brings speed, independence, passion, and zero patience for half-measures. This combination demands you show up with your best ideas and the courage to let them catch flame.\n\nQ1 (Winter into Spring) starts with momentum. Fire Horse energy begins building even before the lunar new year fully arrives, and you'll feel it as creative restlessness, an urge to start something significant. This is your window to plant seeds—not cautiously, but boldly. The Horse doesn't tiptoe. Your wood nature wants to generate and grow; fire wants to burn bright. January through March is about initiating projects that genuinely excite you, even if they feel slightly too ambitious. The risk isn't thinking too big; it's playing it safe and missing the Horse's momentum. But here's the warning: Fire consumes wood. You're the fuel source this year. Make sure what you're feeding is worth burning for, because you will burn. Choose your fires carefully in Q1, because you're committing your energy for the long haul.\n\nQ2 (Spring into Summer) intensifies everything. Fire Horse at full gallop is not subtle. This is when your ideas either catch fire and take off or burn out because they lacked sustainable foundation. The Horse's independence clashes with your Monkey's need for mental stimulation from others—you might feel torn between going solo and collaborating. Choose collaboration, but with people who match your pace. Slow partners will frustrate you to the point of sabotage. Your wood element is strongest in spring, so April and May are your power months. Use them. By June, you need to be managing the fire you've started, not still trying to light it. The Horse energy can scatter into multiple directions; your job is to channel it. One or two major focuses, not seventeen.\n\nQ3 (Summer into Autumn) brings the test. Fire peaks in summer, and you'll be tired. The Horse asks for sustained speed, but your wood needs replenishment. July through September are about not burning out while keeping your fires fed. This is where many Wood Monkeys will crash—you've been generating and generating, feeding the flame, and suddenly you're exhausted. The temptation will be to quit or to scatter your energy even more widely looking for the next exciting thing. Don't. This quarter demands you develop what you started. Let the fire mature from explosive ignition to sustained heat. The Horse's independence means you won't get a lot of external support; you need to be your own source of consistency. Practical warning: watch for irritability and frustration (wood imbalance signs) in August especially. You're being asked to sustain, not just start.\n\nQ4 (Autumn into Winter) is about harvesting what survived the fire. By October, Fire Horse energy begins to wane, and you'll feel both relief and possibly disappointment. What you built this year either transformed into something real or consumed itself. The Monkey in you will want to immediately start something new; resist for once. October through December are for integration, for letting your wood energy restore, for reflecting on what this intense year taught you about where your creative energy actually wants to go versus where you force it out of restlessness. The Horse leaves behind clarity—you now know what you can sustain and what was just impressive-looking flame. \n\nThe core opportunity in 2026: You can launch something significant that combines your innovative vision with fire's transformative power. The core warning: You can also completely deplete yourself feeding fires that don't truly matter to you, mistaking intensity for purpose. Choose meaning over excitement. The Fire Horse will give you all the speed you can handle. Make sure you're running toward something worth reaching.",
  "compatibilityMap": "Your relationship dynamics are shaped by wood's need to grow and connect, filtered through the Monkey's need for mental stimulation and freedom. You don't just want a partner; you want a co-conspirator in making life more interesting. But wood's elemental nature means you also need genuine emotional depth, even if your Monkey speed makes you look like you're skating on surfaces. You're more relationship-oriented than you pretend, more affected by disconnection than you admit.\n\nBest element match: Fire signs understand you instinctively. You generate fire—wood feeds flame—which means fire people feel energized by you, and you feel purposeful with them. Fire brings the passion and transformative energy that gives your innovations actual heat. With a Fire Snake or Fire Horse, you get someone who matches your intensity and can actually keep up with your pace. The sexual chemistry is obvious—you literally fuel each other—but more importantly, you create together. You make each other braver. The risk is burnout: you can't feed fire endlessly without replenishing your wood. Fire partners need to understand that you require periods of rest, water energy, restoration, or you'll start to resent them for consuming everything you have.\n\nWater signs are your nourishment source. Water feeds wood in the productive cycle, which means Water Rat or Water Pig partners provide the emotional depth and support your wood nature craves. They slow you down in ways you need but resist. Water helps you rest, reflect, go deeper instead of faster. These relationships feel stabilizing—less exciting than fire, but more sustainable. The challenge is that water can dampen your enthusiasm if it's too heavy, and you can drain water partners with your relentless need for growth and change. You need their depth but they need your respect for their different rhythm. In friendship, water signs are your emotional anchors; in romance, they're your safe harbor. You need at least one water person in your inner circle or you'll run yourself into the ground.\n\nMetal signs are complex. Metal controls wood in the destructive cycle—they prune you, limit you, cut through your expansiveness. With Metal Rooster or Metal Ox partners, you get someone who provides structure and focus, which your scattered Monkey energy sometimes desperately needs. They help you finish what you start, they call out your bullshit, they don't let you charm your way out of commitments. This can be growth-inducing or suffocating depending on balance. If the metal energy is mature and respectful, it's like a master gardener pruning for better growth. If it's controlling or rigid, you'll feel claustrophobic and rebellious. You'll either grow stronger through the constraint or you'll break free and never look back. These relationships require enormous mutual respect.\n\nEarth signs trigger your controlling instinct. Wood controls earth in the destructive cycle—you naturally want to break up their stability, get them moving, disrupt their comfortable patterns. With Earth Dog or Earth Ox partners, you're the one who brings change and growth into their steady world. This can be revitalizing for them or destabilizing, depending on whether they want what you're offering. The danger is you become intrusive, always trying to fix or improve them, unable to let them be. Earth people can feel bulldozed by you. In turn, their stability can feel like stagnation to you, their groundedness like stubbornness. These relationships work when earth appreciates your growth energy and you appreciate their stability, but they fail when you can't stop trying to change each other.\n\nOther wood signs are mirror matches—Wood Rabbit or Wood Tiger gives you someone who understands the growth imperative instinctively. You collaborate beautifully, you're both flexible and creative, but you can also enable each other's worst tendencies. Two wood people together can scatter in every direction with no one providing focus. You need different animal energies to make this work—two Monkeys is too much clever chaos.\n\nIn all relationships, you need mental stimulation or you check out. The Monkey in you requires wit, banter, novelty, someone who challenges your thinking. Wood adds the requirement for emotional authenticity beneath the clever surface. You need someone who sees through your humor to the caring underneath and doesn't make you feel foolish for it.",
  "elementalBalanceGuide": "Balancing your wood energy is about managing the fundamental tension between growth and sustainability. Wood wants to expand endlessly; the Monkey wants to explore endlessly; together you become someone who can exhaust yourself innovating while wondering why you feel hollow. Your balance practice isn't about doing less—that will never work for you—it's about growing with intention instead of compulsion.\n\nSigns of excess wood: You can't stop improving things that don't need improvement. You're meddling in others' lives \"for their own good.\" You're irritable, snappish, frustrated by anything that doesn't move at your speed. You're starting seventeen projects and finishing none because you're already bored and onto the next vision. Your flexibility has become flakiness—you can't commit because you're always seeing the next possibility. You're invasive, both in relationships and in your own environment, unable to let anything exist in its natural state without your helpful intervention. Physically, you might experience tension headaches, jaw clenching, restless sleep, or digestive issues related to stress. Excess wood loses its benevolent quality and becomes aggressive expansion for its own sake.\n\nSigns of depleted wood: You've lost your vision. Everything feels pointless, and your usual optimism about what's possible has vanished. You're rigid where you're usually flexible, defensive where you're usually open. You can't generate new ideas, or if you can, they feel hollow and uninspired. You're either collapsed into passivity or frantically controlling, trying to force growth that won't come. The Monkey's cleverness is still there but it's serving nothing—just mental gymnastics without purpose. You feel stuck, blocked, unable to move forward, and deeply frustrated by your own stagnation. Emotionally, you might feel disconnected from your usual compassion, unable to care about others' growth because your own has stalled.\n\nDaily practices for balance: Morning movement that's flexible and expressive—yoga, tai chi, dance, anything that gets energy flowing without rigid structure. Wood energy needs to move or it stagnates. But not competitive movement—that's fire energy. You need movement that emphasizes flow and breath and the pleasure of your body's capability. Fifteen minutes beats an hour of forced intensity. You need to write or sketch daily—externalizing the ideas constantly generating in your mind. Not for any purpose, not to create anything finished, just to get the mental energy moving outward instead of swirling internally. Your wood-Monkey combination produces ideas faster than you can execute them; you need a daily release valve.\n\nEnvironment adjustments: You need plants—living, growing things in your space. Not plastic, not paintings of nature, but actual green growing life. Wood people are literally nourished by vegetation. Your space should have vertical elements, upward movement, nothing too heavy or squat. You need natural light, ideally eastern exposure (wood's direction), and you need your space to feel like it has room to breathe. Clutter blocks wood energy flow. But organization for its own sake isn't the answer either—you need creative chaos with breathing room. Windows you can open, spaces that feel expandable, nothing too confined. Color-wise, greens and blues support you; heavy browns and grays will drain you.\n\nSeasonal awareness: Spring is your power season. March through May, you should be initiating everything important. This is when your wood is naturally strong, when growth energy is universal, when your instincts align with the world's rhythm. Use spring ruthlessly—this is when you plant what you'll harvest all year. Summer tests you because fire energy pulls hard on your wood—you're generating and generating, feeding the flame. Summer requires you to manage your energy like a resource, not an endless supply. Autumn challenges you because metal energy prunes wood. September through November, you might feel criticized, limited, cut back. Don't fight it; let yourself be shaped. Winter is for restoration. December through February, embrace water energy—rest, reflect, go deeper not faster, let yourself be still without calling it stagnation.\n\nLeveraging element cycles: When you need to create or initiate, feed your wood with water energy—rest, emotional depth, time near actual water, deep conversations, adequate sleep. When you need to take action on your ideas, connect with fire energy—passionate people, physical movement, heat, inspiration, anything that transforms vision into reality. When you're scattered, invite metal energy—structure, editing, boundaries, someone who can focus your expansion productively. When you're exhausted from too much growth, allow earth energy—stability, routine, nourishing food, being rather than becoming. The cycle teaches you that you don't have to be in growth mode constantly. Wood that never rests becomes brittle. You need all five elements to stay balanced, even though only one is your home."
}