{
  "elementalIdentity": "You are the Wood Rooster, and that makes you the sign's conscience incarnate. Where other Roosters strut and crow, you grow roots. Where they preen, you prune. This is the only Rooster who actually stops to consider whether their critique will help something flourish or just leave it bleeding. Wood gives you what the Rooster naturally lacks: genuine care for the thing you're perfecting, not just the performance of perfection itself.\n\nThe Rooster brings precision, schedule-worship, and an almost pathological need for things to be correct. You notice the crooked picture frame, the logical fallacy, the half-assed effort from three rooms away. But Wood—the element of spring, of bamboo bending, of roots slowly cracking stone—adds purpose to that pickiness. You're not just pointing out flaws to hear yourself talk. You genuinely believe in improvement, in craft, in the patient elevation of raw material into something worthy. The Principled Craftsman isn't just a cute nickname. It's your operating system.\n\nThis combination makes you rarer than you realize. Most Roosters are Metal, and they're surgical in their cuts—clean, cold, efficient. Fire Roosters perform their excellence like theater. Earth Roosters dig in and judge from a position of supposed moral bedrock. Water Roosters adapt their standards to the audience. But you? You actually care about growth. You'll spend three hours teaching someone the right way to do something, not because you enjoy the sound of your own voice, but because you cannot stomach watching potential waste itself. That's Wood talking. That's the element that says everything deserves a chance to reach toward the light.\n\nYour archetype crystallizes in how you work. You don't just complete tasks—you cultivate them. You see the through-line from seed to harvest, and you're willing to do the inglorious middle work that everyone else skips. You'll revise, reconsider, start over if necessary. Not because you're indecisive, but because you understand that real quality requires seasons. The Rooster in you sets the standard absurdly high. The Wood in you actually has the patience to meet it.\n\nBut here's the shadow: You can become the person who confuses growth with endless revision. The craftsman who never ships because it's not quite ready. The teacher so focused on potential that you exhaust yourself trying to water concrete. Wood Roosters burn out not from laziness but from caring too precisely, too long, about things and people who didn't ask for that level of investment. You have to learn that not everything is your garden to tend. Some things need to stay wild or wither on their own timeline. Your discernment is a gift. Your inability to let things be imperfect without your intervention—that's the trap.",
  "elementInDepth": "Wood is the element of expansion, and in you it doesn't explode outward like Fire—it grows steadily, deliberately, with direction. Think of a vine that finds every crack, every opportunity, every structure to climb. That's your energy. You extend into spaces and relationships with purpose, always asking: What can develop here? What needs shaping? The Rooster's natural clarity combines with Wood's vision to make you someone who sees ten steps ahead, not in some mystical way, but because you understand growth patterns. You know what needs to happen in March for September to work out.\n\nWood generates Fire in the cycle, and this matters for you more than you think. When you're aligned, your careful standards and long-view patience actually ignite inspiration in others. People catch fire from your commitment. They see you showing up, refining, refusing to settle, and something in them wants to rise to that. You spark growth without being loud about it. But when your Wood is weak—when you're depleted, scattered, or cut off from your own roots—you can't generate that Fire. You just critique from a hollow place, and it lands as bitterness instead of belief. Empty Wood doesn't inspire. It just splinters.\n\nWood controls Earth, which means you have a natural ability to shape and direct stability. You can take someone's (or some project's) chaotic foundation and organize it into something load-bearing. You do this intuitively, almost compulsively. But the shadow here is control becoming constriction. When your Wood energy is excessive—overgrown, unmanaged—you start micromanaging Earth qualities in others. You try to control their pace, their process, their groundedness. You become the Rooster who can't let anyone else just be steady in their own way. You have to shape it. This is you at your most exhausting, both to yourself and everyone around you.\n\nWhen your Wood is strong, you're flexible. You can adjust your standards to the situation without abandoning them. You know when to push for more and when to let something grow at its own pace. You mentor without suffocating. You critique without crushing. Strong Wood in you looks like bamboo: upright but bending, rooted but not rigid. You can take feedback, consider other methods, and still maintain your principles. This is you at your most powerful—principled but not brittle.\n\nWhen your Wood is deficient, you lose that flex. You become the Rooster everyone dreads—shrill, nitpicking, exhausting. You cling to rules because you've lost touch with the living reasons behind them. Deficient Wood makes you dry, stiff, reactive. You snap instead of bending. You criticize without offering the growth component. You point out the problem but have no energy left to cultivate the solution. People stop coming to you because being around depleted Wood feels like standing in a dead forest—lots of structure, zero life.\n\nYour task is to keep your Wood vital. That means staying connected to actual growth—yours and others'. It means feeding your roots with rest, patience, and the willingness to let things unfold without your intervention. It means recognizing when you're trying to control Earth because your own Wood feels unstable. The cycle doesn't lie: healthy Wood generates warmth and light in others. Sick Wood just tries to pin everything down.",
  "yearAhead2026": "2026 is the Year of the Fire Horse, and for you, Wood Rooster, this is a year of combustion—both kinds. Fire Horse energy is fast, hot, dramatic, and completely uninterested in your meticulous timelines. The Horse sprints. You cultivate. The Fire Horse doesn't just sprint—it sprints while everything behind it goes up in flames. This will either ignite your best work or burn you out, depending on how you manage the elemental tension.\n\nHere's the fundamental dynamic: Your Wood generates Fire. In a Fire year, you are the fuel. That's not a metaphor. Your steady, patient, growth-oriented energy will be drawn on constantly. People will want your clarity, your standards, your ability to see the long game while everyone else is caught in Horse-year chaos. Opportunities will come fast, and they'll ask you to speed up your process. Resist the urge to abandon your craft for the sake of velocity. The gift of this year is that your work can finally get the spotlight and momentum it deserves. The trap is burning through your reserves trying to keep pace with energy that doesn't respect seasons.\n\nQ1 (Winter into Spring): The year opens with tension. Fire Horse years start loud, and you'll feel the pressure to launch, commit, or accelerate before you're ready. Don't. Use the first quarter to shore up your foundations—secure your resources, clarify your standards, and identify what actually deserves your energy this year. Late March and April, as your Wood season arrives, you'll feel the wind at your back. This is when you initiate. Plant what you want to grow before summer's heat arrives.\n\nQ2 (Spring into Summer): This is your power quarter. Your Wood is strong, the Fire energy of the year is pulling opportunities toward you, and the Horse's momentum finally syncs with your trajectory. Say yes to visibility. Say yes to collaboration with people faster and wilder than you'd normally tolerate. They need your structure. You need their spark. But watch for overcommitment. Fire consumes Wood when there's too much demand and not enough root depth. If you start feeling brittle or resentful by late June, you've overextended.\n\nQ3 (Summer into Autumn): The heat peaks, and so does the risk. Fire Horse summer is chaotic, dramatic, and full of false urgency. This is when everyone around you will be in crisis mode, and they'll want you to fix it with your careful precision. Some of those fires are real. Most are people finally reaping what they rushed into planting in Q1. You are not the year's firefighter. Protect your energy. Focus on your own garden. Let others learn their Horse-year lessons without making them your responsibility. Late August and September bring more clarity—use it to assess what's actually working and what was just Q2 enthusiasm.\n\nQ4 (Autumn into Winter): The Horse year winds down, and you'll feel the relief of deceleration. This is when you harvest what you carefully tended all year while others were sprinting in circles. November and December are for integration, not initiation. Process what you learned about working with—and generating—Fire. Notice where you fed the right flames and where you just got burned. Set your standards for 2027 based on what you now know about your capacity. Don't carry the Horse year's pace into the next cycle. Let it go.\n\nThe bottom line for 2026: Your Wood will be in demand. Protect it fiercely. Generate Fire for what matters. Let the rest burn without you.",
  "compatibilityMap": "You're a hard match, and you should know that upfront. Not because you're difficult, but because your standards for depth, growth, and actual follow-through eliminate about seventy percent of people before the third conversation. You don't do surface. You don't do potential without evidence. The Rooster in you needs proof. The Wood in you needs to see roots, not just pretty leaves. This makes you selective in a way that people with looser boundaries find intimidating or cold. You're neither. You're just not interested in watering relationships that refuse to grow.\n\nBest elemental match: Water signs. Water nourishes Wood, and you feel this in relationship as ease. Water people—Rat, Pig, certain Rabbits—bring flow to your structure. They soften your edges without dissolving your principles. They cry when they need to, adapt when it's wise, and don't mistake your high standards for lack of feeling. You relax around healthy Water. They get that your criticism comes from care. They don't take your precision personally. In romance, Water matches let you be both strong and soft. In friendship, they're the ones who'll listen to your rant about someone's shoddy work and not tell you to lighten up. They also pull you out of your head and remind you that not everything needs to be a project. Water signs keep you from drying out.\n\nSecond-tier match: Fire signs. Complicated but combustible. You generate Fire, remember, so there's natural chemistry here. Fire people—Snake, Horse, sometimes Tiger—ignite around your steady flame. They love your integrity, your refusal to cut corners, your ability to see something through. But Fire consumes Wood when the relationship isn't balanced. You can end up feeling like the perpetual fuel source for their drama, ambition, or ego. In romance, Fire matches are passionate but exhausting. You'll need clear boundaries and the willingness to let them burn on their own sometimes. In friendship, Fire people bring excitement and momentum, but you'll often be the one cleaning up after their impulsive decisions.\n\nChallenging match: Earth signs. On paper, this should work—you control Earth, you shape it, you bring structure to their stability. In reality, Earth signs (Ox, Dragon, Dog, Goat) often experience your Wood energy as invasive. You can't help trying to organize their process, improve their systems, or point out where they're stuck. They experience this as you trying to dig them up and replant them somewhere more optimal. Healthy Earth signs have their own rhythms, and they resent your interference even when you're right. In romance, this dynamic creates a parent-child vibe neither of you wants. In friendship, it works better if you can back off and let Earth be Earth.\n\nWorst match: Metal signs. Metal chops Wood. That's the cycle, and you'll feel it in relationship as constant cutting. Metal people—Rooster, Monkey—are sharp, precise, and have zero patience for your growth-takes-time philosophy. They want results now. They'll cut away what you're trying to cultivate because it's not efficient. Metal Roosters, especially, are your elemental opposite—you're the Rooster who bends, they're the Rooster who breaks things into compliance. In romance, Metal matches are brutal. Every disagreement becomes a battle of who's more right, and Metal plays to win, not to grow together. In friendship, keep it light and infrequent.\n\nHow you love: slowly, carefully, and with your whole system. You don't fall—you grow toward someone. You test the soil, check the light, see if roots can actually take hold. Once committed, you're loyal to the point of self-abandonment. You'll pour everything into making it work, often long past the point where it's clear the other person isn't growing with you.\n\nHow you fight: with devastating precision. You don't yell—you identify exactly where the other person failed and articulate it in excruciating detail. You fight like you're debugging code, which makes emotional people feel like you don't care. You do. You just think clarity solves things. Learn to fight softer.\n\nHow you grow in relationship: by learning that love isn't a craft project. Not everything needs your improvement. Sometimes presence matters more than progress.",
  "elementalBalanceGuide": "Balancing your Wood means understanding that you are not a machine that produces quality—you're a living system that needs seasons. The Rooster in you wants to optimize that system, run it at peak efficiency year-round. The Wood in you is quietly dying from that approach. Wood requires cycles: growth, bloom, harvest, rest. You skip rest. That's where the imbalance starts.\n\nSigns your Wood is excessive (overgrown, out of control): You can't stop revising. You're involved in everyone's process uninvited. You're giving feedback no one asked for. You're irritable, rigid, and secretly resentful that no one meets your standards—including yourself. Your body might show tension in the sides of your torso, neck, or shoulders. You're mentally inflexible, clinging to the \"right\" way even when it's clearly not working. This is Wood without pruning, Wood that's become invasive rather than supportive. You need Metal to cut back the excess. Not Metal people necessarily—Metal energy. Boundaries. Editing. The willingness to let some things go unrefined. Say no. Simplify your commitments. Let something be seventy percent and walk away.\n\nSigns your Wood is deficient (depleted, brittle, rootless): You've lost your patience for growth—yours or anyone else's. You're cynical about potential. You criticize without offering a path forward. You feel stuck, uninspired, and disconnected from purpose. Your flexibility is gone; you snap at small frustrations. You might notice you're getting sick more often, or that your energy crashes hard in the afternoon. This is Wood that's been over-harvested, Wood that gave and gave until nothing remained. You need Water to replenish. Actual rest, not productive rest. Time in nature without a goal. Relationships where you receive instead of give. Creative projects with no deadline or audience. Let yourself be nourished without having to earn it.\n\nDaily practices for Wood balance: Morning movement that's fluid, not aggressive. Tai chi, yoga, walking—anything that reminds your body it can bend. Wood needs to flow, and the Rooster in you will try to make even your relaxation regimented. Fight that. Let movement be imperfect. Spend time around living things—plants, trees, gardens. Your element is literally spring, and you regenerate fastest when you're around other growing systems. If you can't get outside, bring green into your space. Not fake green. Living green. Work with your hands on something low-stakes. Cook, draw, build, repair—anything that lets you practice craft without the pressure of perfection. This feeds Wood's need to create while giving your Rooster brain something to focus on besides optimizing your entire life.\n\nEnvironment adjustments: Your space should have natural light, living plants, and wood materials. Avoid sterile, all-white, or overly minimalist environments—they'll make you feel like you're withering. You need texture, life, and a little bit of managed chaos. Face east when you work if possible. That's your elemental direction, and even if it sounds woo-woo, you'll notice the difference. Reduce Metal energy in your space: harsh overhead lighting, too much chrome or glass, aggressive edges. Metal cuts Wood, and living in a Metal-dominant environment will leave you feeling perpetually criticized even when you're alone.\n\nSeasonal awareness: Spring is your season, and you should feel most alive, creative, and flexible from March through May. If you don't, your Wood is seriously imbalanced. Use spring to initiate, plant, and start new growth cycles. Summer asks you to generate Fire—to let your work shine and be seen. Don't hide in summer. Autumn is for harvesting what you grew and letting go of what didn't work. This is hard for you because letting go feels like failure. It's not. It's cycle completion. Winter is for rest, and you're terrible at it. Winter is when Wood stores energy in roots, invisible and underground. You need to do the same. If you fight winter's call to slow down, you'll hit spring depleted and wonder why nothing's growing.\n\nLeveraging the cycle for growth: Feed your Wood with Water energy—rest, reflection, emotional honesty, creative flow without agenda. Let your Wood generate Fire—share your work, mentor others, let your standards inspire action. Don't try to control Earth in your life—sometimes stability doesn't need your input. And when Metal shows up to cut you back, let it. Pruning isn't punishment. It's how you stay healthy. The goal isn't balance as stasis. The goal is balance as seasonal rhythm: grow, shine, release, rest, repeat. You're designed for cycles, not constant production. Honor that, and your Wood will stay vital for decades."
}