{
  "elementalIdentity": "You are the Wood Snake — a creature of paradox and precision. Where most Snakes coil inward, hoarding wisdom in shadow, you extend outward like bamboo shoots seeking light. Wood gives you something the other Snakes lack: a genuine impulse toward growth that isn't just strategic self-preservation. You're the Snake who actually wants to help people evolve, not merely manipulate them into position. The Thoughtful Philosopher archetype fits because you combine the Snake's penetrating insight with Wood's developmental urge. You don't just see through people — you see what they could become.\n\nWood is the element of spring, of expansion, of life pushing through concrete. In you, this manifests as intellectual and spiritual growth rather than raw ambition. You're not climbing corporate ladders; you're building frameworks of understanding. The Snake brings cunning and perception; Wood brings vision and flexibility. Together, they create someone who can read a room instantly, understand the hidden dynamics, and then — here's what makes you different — actually want to create conditions for everyone to thrive. Not from bleeding-heart idealism, but from Wood's structural understanding that growth is collective or it's hollow.\n\nYour core tension is this: Snakes are solitary by nature, but Wood is relational. You need alone time to process and regenerate, yet you're fundamentally oriented toward connection and development of others. This makes you the Snake most likely to be found teaching, counseling, or mentoring — but always on your terms, always with an escape route planned. You're generous with your wisdom but miserly with your energy. People find you simultaneously accessible and mysterious, warm and withholding.\n\nAmong the sixty signs, you occupy a unique position. You're introspective enough to satisfy the deepest philosophical inquiry, yet oriented enough toward growth to avoid the paralysis that traps Metal Snake or Water Snake in endless analysis. You're the Snake who actually implements insights rather than just collecting them. Wood gives you the courage to be wrong, to experiment, to revise your understanding — something most Snakes find excruciating. You can shed skins conceptually as well as literally.\n\nYour shadow? Wood Snake can become the manipulative guru, the teacher who creates dependency rather than autonomy. When your Wood energy gets twisted, you don't just help people grow — you decide the shape they should grow into. You can convince yourself that your vision for someone else's life is wisdom when it's actually control dressed in compassionate language. And because you're so perceptive, you know exactly which strings to pull. The Thoughtful Philosopher can become the Subtle Puppeteer if you're not careful. Your gift is seeing potential; your curse is thinking you always know the right way to actualize it.",
  "elementInDepth": "Wood energy in you manifests as relational intelligence and pattern recognition. You don't just accumulate information like Earth Snake or analyze systems like Metal Snake — you understand how things develop, how one stage leads to another, how potential unfolds into actuality. This is Wood's essential nature: directionality, growth, the capacity to envision what doesn't yet exist. In the Snake personality, this becomes almost prophetic. You see trajectories others miss because you understand developmental logic.\n\nThe productive cycle flows through you naturally. Wood feeds Fire — your insights and frameworks generate enthusiasm and action in others. You're the idea person whose concepts catch flame in other people's hands. You don't need to be the executor; you plant seeds and trust the Fire types to run with them. This is your creative output, your contribution. But here's what trips you up: Wood controls Earth. You have an instinctive capacity to stabilize, to provide structure, to contain chaos. People lean on you, and you let them — until suddenly you're buried under everyone else's problems, your roots strangled by their need.\n\nWhen your Wood is strong, you're flexible, resilient, generous. You bend in storms rather than breaking. You generate ideas effortlessly. Your presence helps others feel safe enough to grow. You're the friend who asks the question that reframes everything, the mentor whose single observation unlocks years of confusion. Strong Wood Snake is magnetic without trying, influential without forcing. You create space for transformation simply by being present.\n\nWhen your Wood is depleted, you become brittle, rigid, controlling. Depleted Wood Snake tries to force growth rather than facilitate it. You push your insights on people who aren't ready. You become impatient with natural timing, frustrated when seeds don't sprout on your schedule. You lose your flexibility and become dogmatic about your frameworks. Worst of all, you start hoarding your wisdom instead of sharing it, convinced that if you give too much away, you'll have nothing left. This is the opposite of Wood's nature — scarcity thinking replacing abundance consciousness.\n\nMetal cuts Wood in the destructive cycle, and you feel this as criticism that destabilizes your confidence. Metal types — especially Metal Rooster and Metal Monkey — can make you question your perceptions, which is your foundation. You need to learn that refinement isn't rejection. When Metal energy comes at you, it's not destroying your Wood; it's pruning it, shaping it, making your insights more precise. But it never feels that way in the moment.\n\nYou control Earth, which means you naturally provide structure and stability — but this is also where you get trapped. Earth signs lean on you. They want your frameworks, your clarity, your ability to make sense of chaos. And you give and give, not realizing that you're depleting yourself by over-functioning as everyone's philosophical anchor. You need to learn that controlling Earth doesn't mean becoming Earth for other people. Provide the framework, then let them do their own stabilizing work. Your Wood needs to stay supple, not become everyone else's load-bearing wall.",
  "yearAhead2026": "The Year of the Fire Horse comes at you like a wildfire in a bamboo forest — fast, consuming, transformative. Fire is your child element in the productive cycle, which means this year wants something from you: fuel. Your ideas, your vision, your frameworks are all raw material for Fire Horse's explosive momentum. The opportunity here is unprecedented influence. When you speak, people will run with your insights faster and further than ever before. The danger is depletion. Fire consumes Wood, and if you're not careful, Fire Horse year will burn through your creative reserves and leave you hollow by December.\n\nQ1 2026 (February-April): The year opens with intensity. Fire Horse energy is building even before the Lunar New Year fully lands. This is your planning quarter. Get clear on what you actually want to achieve this year versus what others want from you. The pressure to share your wisdom, lead initiatives, and provide vision will be immediate and flattering. Say yes selectively. Fire Horse rewards bold moves, but you're not a Horse — you're a Snake. Your power is in precise strikes, not sustained sprinting. Plant seeds deliberately this quarter. Choose one or two major projects that genuinely excite you, and protect everything else. Your Wood needs tending, not just spending.\n\nQ2 2026 (May-July): Peak Fire energy. This is when Fire Horse year either validates you or exhausts you, depending on your Q1 choices. If you've been strategic, this quarter brings recognition, opportunity, and the satisfaction of seeing your ideas catch fire. People want what you're offering. You'll be invited to teach, speak, lead, consult — possibly all at once. The temptation is to say yes to everything because the momentum feels good. Don't. Fire burns hottest at midday, and you need to remember you're feeding the fire, not becoming it. This is also when relationship dynamics intensify. Fire Horse energy is passionate and impatient. Conflicts escalate quickly. Use your Snake perception to navigate, but don't get drawn into drama that isn't yours.\n\nQ3 2026 (August-October): Correction phase. If you've overextended, you'll feel it now as autumn energy starts pulling inward. Fire Horse doesn't do subtlety, and you'll see clearly what's sustainable versus what was just momentum. This is your recalibration quarter. Pull back from commitments that drain you. Delegate. Disappear if you need to — Snake prerogative. Late September and October are crucial for protecting your energy reserves heading into year-end. The Wood Snake gift is knowing when to retreat. Use it. This quarter also brings unexpected insights about long-term direction. Pay attention to what you've learned about yourself under Fire's harsh light.\n\nQ4 2026 (November-January 2027): Integration and rest. Fire Horse energy starts winding down as we move toward the Yin Fire Goat year ahead. This quarter is about harvesting wisdom, not pushing for more output. What did this intense year teach you? What do you want to carry forward? Fire Horse year will have shown you your capacity — both your strength and your limits. Honor both. Use these months to replenish your Wood energy through rest, reflection, and connection with nature. The philosopher needs solitude to process. Take it. Set boundaries now that will protect you in the year ahead. You've fed enough fires. Time to tend your own roots.",
  "compatibilityMap": "Your elemental compatibility is more complex than most signs because Wood is relational by nature, but Snake is solitary by instinct. This creates fascinating relationship dynamics. You need people, but you need them at a distance you control. Understanding this paradox is everything.\n\nBest elemental matches: Fire signs — Fire Snake, Fire Horse, Fire Monkey — are your natural partners in the productive cycle. You feed Fire; Fire receives your gifts enthusiastically and transforms them into action. With Fire types, you feel appreciated, understood, utilized. They get excited about your ideas, which lights you up in return. The chemistry is real. But here's the nuance: Fire can exhaust you. Short-term, these relationships are electric. Long-term, you need to maintain your boundaries or Fire will consume everything you offer and then ask for more. Fire Horse especially will drain you dry if you let them. Best dynamic: collaborator or passionate short-term romance, not necessarily life partnership unless you have very clear containers.\n\nWater signs — Water Rat, Water Pig, Water Rabbit — nourish your Wood in the productive cycle. These relationships feel replenishing. Water types provide emotional depth, intuition, and the fluid support that helps your growth orientation flourish. You don't have to perform with Water signs; you can just be. They nourish without demanding. The challenge is that Water can be overwhelming in its emotional intensity, and you're a Snake — you process internally, not through endless feeling-conversations. Water Pig especially will want more emotional availability than you naturally offer. Best dynamic: deep friendship or long-term partnership if you can communicate your need for space without them taking it personally.\n\nEarth signs are complicated. You control Earth in the destructive cycle, which means you provide stability for Earth Ox, Earth Dragon, Earth Dog. They lean on you, trust you, want your frameworks and guidance. This feels good initially — you like being needed for your wisdom. But Earth's weight accumulates. They want you to be their rock, and you're not a rock, you're bamboo — you need to sway. Earth relationships can become caretaking dynamics where you're constantly providing structure for someone else's chaos. Best dynamic: mentorship, coaching relationships, or partnerships where roles are very clearly defined and Earth sign does their own stabilizing work.\n\nMetal signs cut your Wood, which feels like criticism of your core self. Metal Rooster, Metal Monkey, Metal Dog — they're precise, exacting, and they'll poke holes in your beautiful frameworks. This is either growth or torture, depending on your maturity level. Metal's refinement can make your insights sharper, but their delivery often makes you want to bite. You'll feel judged, pruned, reduced. Mature Wood Snake learns to value Metal's clarity. Immature Wood Snake just feels attacked and withdraws. Best dynamic: professional relationships where Metal's precision improves your work, not intimate partnerships unless you're very secure.\n\nIn love, you're devoted but need freedom. The paradox again. You'll commit deeply, but you must have spaces your partner doesn't access — your solo walks, your thinking time, your private processing. You love through insight, through seeing your partner's potential and helping them grow into it. Your shadow in relationships is thinking you know better than your partner what they need. You can become subtly controlling, steering growth rather than supporting it. In conflict, you go cold rather than hot. You withdraw, analyze, and strike precisely when you're ready — which can feel manipulative to more direct signs. Learn to fight in real-time occasionally. Not everything needs strategic processing.\n\nFriendship versus romance: You're actually easier as a friend than a partner. Friends get your wisdom without feeling controlled by your vision for their life. You're the friend people call for perspective, and you deliver brilliantly without the complicated entanglement of shared living space and life decisions. In romance, your need for control and your partner's need for autonomy will clash unless you choose someone who values growth as much as you do and has their own strong sense of direction. You cannot be the only philosopher in the relationship. Find someone who thinks for themselves, or you'll be bored and they'll be suffocated.",
  "elementalBalanceGuide": "Balancing Wood energy means understanding the difference between growth and overextension. You're naturally oriented toward development — of yourself, your ideas, other people — but Wood can grow itself into depletion if there's no pruning, no rest, no inward consolidation. Your work is learning when to expand and when to root down.\n\nSigns of excess Wood: You're overcommitted. You've said yes to teaching, mentoring, or leading too many initiatives, and now you're spread thin. Excess Wood Snake is everywhere and nowhere, generous to the point of depletion. You feel brittle despite being busy. You're irritable, especially with people who drain your energy. You're forcing insights on people who aren't ready. You've lost your flexibility — your frameworks have become rigid rules. You're trying to control outcomes instead of facilitating growth. You're not sleeping well because your mind won't stop generating ideas, solving problems, planning next moves. Your body feels tense, especially neck and shoulders.\n\nSigns of deficient Wood: You've withdrawn completely. You're hoarding your wisdom instead of sharing it. You feel creatively blocked, like your ideas have dried up. You're stuck in analysis paralysis, unable to move forward because you're questioning your own perceptions. You feel hopeless about growth — yours or anyone else's. You're rigid, defensive, brittle. You've lost your capacity to bend with circumstances. You're isolating beyond healthy Snake solitude into loneliness. You feel purposeless, like your philosophical orientation has nowhere to go. Your confidence in your insights has evaporated.\n\nDaily practices for balance: Morning alone time is non-negotiable. You need space to process before you engage with anyone else's energy. Walk, sit, think, drink tea — whatever, just do it solo. Wood energy is replenished by nature connection. Literal trees, plants, outdoor spaces. You're not an Earth sign; you don't need hours in the garden. But you need regular contact with growing things. Even fifteen minutes helps. Establish clear boundaries around your teaching/mentoring energy. Decide in advance how much you're willing to give, then stop. Don't wait until you're depleted to say no. Practice flexibility daily through small choices — take a different route, change your plan, let someone else decide. Wood in balance bends easily.\n\nEnvironment adjustments: Your space should support both growth and retreat. Plants, yes, but also private corners where you can disappear. Wood Snake needs a room of one's own — actual or metaphorical. If you share space, claim specific areas that are yours alone. East-facing windows or time in eastern light during morning hours strengthens Wood energy. Green in your environment, but not overwhelming — you're Wood Snake, not Wood Rabbit. You need sophisticated, intentional design, not just greenery everywhere. Create spaces that facilitate thinking — good chairs, good light, minimal clutter. Your environment should support philosophical work, not distract from it.\n\nSeasonal awareness: Spring is your power season, but it's also when you risk overextending. The natural growth energy matches yours, and you'll be tempted to start everything. Start fewer things, tend them better. Summer feeds your Fire output — this is teaching season, sharing season, but watch for depletion. Autumn is correction time. Pull back, prune commitments, consolidate gains. This is hard for Wood Snake because it feels like retreat, but it's actually strategic regeneration. Winter is essential rest. You need true dormancy, not just reduced activity. Let yourself go fully inward. Your wisdom deepens in winter's darkness.\n\nLeveraging element cycles: Use the productive cycle consciously. When you need motivation, spend time with Fire types — their enthusiasm reignites your purpose. When you need replenishment, seek Water signs or Water activities — emotional depth, intuition work, fluid movement. When you need grounding, engage Earth energy through structure and routine, but don't become Earth's caretaker. When you need refinement, invite Metal's precision to sharpen your thinking, but protect yourself from Metal's harshness. Understanding what you need and finding the elemental energy that provides it is advanced-level self-care. You're smart enough to do this consciously. The question is whether you will, or whether you'll just keep growing until you collapse. Choose wisely, Philosopher. Your Wood is renewable, but only if you tend it as carefully as you tend everyone else."
}