{
  "elementalIdentity": "You are the Wood Horse — a creature of perpetual spring, galloping through life with an almost reckless optimism that others find either infectious or exhausting. While other Horses burn hot or dig in stubborn, you bend like bamboo in wind, which is both your genius and your curse. Your wood element doesn't just soften the Horse's natural volatility; it channels that kinetic energy into growth, exploration, and an almost compulsive need to expand your horizons. You're the wanderer who always believes the next valley holds something better, not because you're dissatisfied but because growth itself is your nature. Where Metal Horses build empires and Fire Horses blaze trails, you're mapping territories of possibility — often leaving half-finished projects in your wake like breadcrumbs.\n\nThe fusion here is fascinating because wood and Horse shouldn't work as smoothly as they do. Horses are yang fire creatures by nature — impulsive, freedom-obsessed, allergic to constraint. Wood is the element of patience, steady upward growth, the long game. But in you, these forces create something unexpected: a wanderer with roots that travel. You don't flee commitment like other Horses; you outgrow it. You don't abandon people; you evolve past the version of yourself they fell in love with. This makes you maddeningly hard to hold but impossible to forget. Your compassion is real — wood gives you that — but it's the compassion of someone always looking toward the horizon while holding your hand.\n\nYour archetype as the Free-Spirited Wanderer isn't about geographic nomadism, though many of you do that too. It's about psychological mobility. You're here to teach people that growth and loyalty aren't opposites, that you can love deeply while refusing to calcify into predictability. The shadow side? You confuse motion with progress. You mistake the act of leaving for the act of evolving. Wood Horses often spend their twenties and thirties in perpetual departure mode, only to realize in their forties that wisdom isn't found in the next place but in the depth of presence wherever you are. The challenge isn't to stop moving — that would kill something essential in you — but to learn that sometimes the most radical growth happens in stillness.\n\nWhat makes you unique among the sixty signs is this: you have the Horse's charisma and the wood element's genuine interest in others' flourishing. You're not performing freedom; you're living it. You don't lecture about authenticity; you simply can't function as anything else. This makes you a natural teacher, guide, and inspiration — but only to those willing to keep pace. You have little patience for people who mistake comfort for safety or routine for stability. Your medicine to the world is the reminder that humans are meant to grow until they die, and that the opposite of growth isn't rest — it's stagnation dressed up as responsibility.",
  "elementInDepth": "Wood in Chinese elemental cosmology is the energy of spring — not the gentle unfurling of a single flower but the aggressive, unstoppable force of life breaking through frozen ground. In the Five Element cycle, wood generates fire and controls earth. In you, this plays out as a personality that naturally inspires others (generating fire) while simultaneously disrupting established structures (controlling earth). You're not a revolutionary by ideology but by nature. Wherever you go, things start growing or start breaking — sometimes both.\n\nWhen your wood is strong and balanced, you're magnetic. People feel more alive around you. You have this gift of making others believe in their own potential just by believing in yours so unselfconsciously. Strong wood in a Horse gives you flexibility without weakness, adaptability without loss of self. You can pivot, adjust, bend with circumstances while maintaining your core direction. This is when you're at your best: moving through life with purposeful spontaneity, if such a thing exists. You take risks that pan out because they're not really risks to you — they're expressions of trust in the growth process itself.\n\nBut wood can become excessive, especially in a Horse. Overgrown wood manifests as scattered energy, too many projects, chronic restlessness that you mistake for vitality. You start things with genuine enthusiasm and abandon them not from laziness but from the next thing already sprouting in your mind. Excessive wood makes you overbearing in your optimism, dismissive of others' need for stability, almost tyrannical in your insistence that everyone should be growing and changing as constantly as you are. You become the friend who can't understand why someone would stay in the same job for ten years or the partner who interprets contentment as complacency.\n\nDepleted wood is perhaps more dangerous for you because you don't recognize it as quickly. When wood is deficient, the Horse's fire nature takes over without wood's tempering flexibility. You become rigid in your freedom-seeking, brittle rather than bendable. Depleted wood shows up as exhaustion masked by frantic activity, compassion that's become performative, growth that's actually just chronic dissatisfaction. You might find yourself moving constantly but feeling stuck, connecting with everyone but intimate with no one. Your natural optimism curdles into a desperate positivity that denies real problems.\n\nThe productive cycle matters intensely for you. Wood generates fire — meaning your natural state is to fuel inspiration, passion, action in yourself and others. But you need water to nourish your wood. Without it, you burn yourself out generating fire until there's nothing left. Water for you isn't rest exactly — it's depth, introspection, emotional honesty, time near actual water, engagement with what you're feeling rather than what you're doing about it. The destructive cycle shows your power and your problem: wood controls earth. You're meant to break up stagnant structures, but you can become addicted to disruption. You might unconsciously sabotage your own stability because stability feels like stagnation. Learning to distinguish between earth that needs breaking (restrictive situations) and earth that provides necessary grounding (commitments that support your growth) is your life's work.\n\nMetal cuts wood in the destructive cycle, and for you this means structure, discipline, and boundaries can feel threatening. But here's the secret: you actually need metal to prune you into your best shape. Without it, you're all wild growth and no fruit. The Horses who master this integrate enough metal to complete what they start without becoming imprisoned by method.",
  "yearAhead2026": "2026 is the Year of the Fire Horse, and for you as a Wood Horse, this is like coming home to find your house has been redecorated by a version of yourself with less impulse control and more gasoline. Fire Horse year will amplify everything Horse about you while simultaneously consuming your wood element. Remember: wood generates fire. You're going to be feeding this year's energy whether you want to or not, so the question isn't whether you'll be burning fuel but whether you're burning fuel or burning out.\n\nThe core dynamic to understand is that Fire Horse years are notoriously chaotic in Chinese astrology — they're the years when revolution, liberation, and spectacular disasters happen with equal probability. For you, this manifests as an almost unbearable urge to break free from anything that's been constraining you. If you've been tolerating a situation, relationship, or version of yourself that feels too small, 2026 will make tolerance impossible. The opportunity here is liberation. The warning is that you might burn down things worth keeping in your enthusiasm to burn down things that genuinely need to go.\n\nQ1 (January-March): The year opens with wood energy still present (late winter moving into spring), which gives you a window of relative balance. Use these months to honestly assess what's working and what's not in your life. This is your pruning season. Make deliberate choices about what you're bringing into the Fire Horse intensity and what you're releasing before the acceleration begins. Any relationship or project that's on life support needs to either be revived or released now — by Q2, you won't have the patience for life support.\n\nQ2 (April-June): Fire peaks, and with it your energy, visibility, and likelihood of doing something dramatically out of character that turns out to be exactly in character. This is your power quarter. Launch things. Take stages. Have conversations you've been avoiding. Your wood generates this fire beautifully if you're not already depleted. Watch for: moving so fast you disconnect from your body, making promises your future self can't keep, mistaking intensity for intimacy. The fire wants to consume; make sure it's consuming obstacles, not your foundations.\n\nQ3 (July-September): Mid-year brings earth energy (late summer), which will feel like hitting a wall after Q2's intensity. Earth controls water, and you need water to replenish your wood. This quarter requires you to deliberately slow down and do the inner work of integrating whatever changed in Q2. If you try to maintain Q2's pace, you'll start making mistakes born of exhaustion. This is when Wood Horses typically get sick, have accidents, or create drama because drama feels more alive than the stabilization work that's actually needed. Resist this. Use earth season to ground your gains.\n\nQ4 (October-December): Metal season arrives (autumn), which cuts wood but also provides the structure to contain and direct fire. This is your harvesting quarter — time to complete things, make commitments that reflect your new reality, and prepare for the Water Rabbit year ahead in 2027. The tendency will be to start new projects as fire wanes, fighting the natural cycle. Don't. Finish, refine, and rest. The Wood Horses who end 2026 in better shape than they started are the ones who learned to work with the elemental seasons rather than against them. December especially is for restoration, for letting water begin to nourish your depleted wood, for remembering that rest is the root of growth.",
  "compatibilityMap": "Your relationship dynamics are governed by a fundamental tension: you need freedom like air, but your wood element makes you genuinely care about others' growth and wellbeing. This isn't the aloof independence of Metal Horses or the self-focused passion of Fire Horses. You want intimacy and autonomy, depth and movement, roots and wings. This makes you exhausting and exhilarating in equal measure. Partners never quite know if you're leaving or deepening — the truth is you're always doing both.\n\nBest elemental matches start with Fire partners. Wood generates fire, meaning you naturally energize and inspire fire-element people. Fire types (Tiger, Snake, Horse, Sheep in fire years) match your pace, understand your need for growth and change, and won't try to cage you. The relationship danger is mutual burnout — two wood and fire people can consume each other if there's no water or earth to balance. Fire partners get your restlessness because they share it. Romance here is adventure, growth spurts, traveling together toward ever-expanding horizons. But someone needs to pay the bills and remember anniversaries.\n\nWater partners are your secret best match — not the most exciting, but the most sustainable. Water nourishes wood in the productive cycle. Water-element people (Rat, Pig, or anyone in water years) provide the emotional depth, introspection, and restoration you need but don't naturally generate. They teach you that stillness isn't stagnation, that feeling deeply is its own kind of movement. The challenge is that water's depth can feel like quicksand to your Horse nature. Water partners might interpret your need for space as emotional unavailability. You have to learn their language of intimacy-through-feeling rather than intimacy-through-experience.\n\nEarth relationships are complicated because wood controls earth in the destructive cycle. Earth partners (Ox, Dragon, Sheep, Dog in earth years) offer stability, loyalty, and groundedness — everything you claim not to want but actually need. The dynamic can be beautiful: you bring growth and possibility to their structures; they provide the foundation that lets your wild growth bear fruit. But it can also be destructive: you experience their need for stability as constraint; they experience your need for change as rejection. These relationships work when both understand the cycle — that healthy control isn't domination but pruning, shaping, directing growth. When it's unhealthy, you're just destroying their garden while they're desperately trying to fence you in.\n\nMetal partnerships are the most challenging. Metal cuts wood — and while this can be the pruning you need, it more often feels like being dismantled. Metal-element partners (Monkey, Rooster in metal years) bring structure, discipline, refinement — all things that can perfect your wild growth or destroy your spirit, depending on how it's wielded. These relationships often have intense attraction because you're drawn to what challenges you, but the long-term dynamic requires metal to soften and wood to strengthen. If you're in a metal relationship, you're learning to accept boundaries without experiencing them as imprisonment. That's advanced work.\n\nOther Wood Horses or wood-element people are mirror matches — you recognize yourselves in each other immediately, finish each other's sentences about needing space while also wanting connection. The danger is you're both generating fire with no one bringing water or earth. These relationships are often profound friendships or early-life romances that teach both parties what unconditional positive regard feels like, but they rarely go the distance because there's no counterbalance.\n\nIn friendship, you're loyal but not available. You genuinely love your people and will show up in a crisis, but you won't show up for regular coffee dates. Friends who need consistent contact will feel neglected; friends who value quality over quantity will treasure you. In romance, you need partners who understand that your independence isn't about them — you're not leaving them; you're being yourself. The ones who can love you while letting you move are the ones you might actually stay with.",
  "elementalBalanceGuide": "Balancing your wood element isn't about becoming less Horse — it's about becoming more sustainably Horse. The work is teaching your wood to grow deep roots while reaching for sky, to understand that the tallest trees survive storms because they're anchored, not despite being anchored. Your daily practice needs to address the core wood imbalance: you're excellent at generating (growth, ideas, connections, movement) and terrible at sustaining (completion, depth, rest, integration).\n\nSigns your wood is excessive: You're starting new things constantly while finishing nothing. You feel restless even when you're moving. You're irritable with people who move slower or want to process longer. Your body feels wired but exhausted — that specific tired-but-can't-rest state. Your optimism has become aggressive, dismissive of real obstacles. You're confusing busy-ness with aliveness. You might be experiencing muscle tension, especially in neck and shoulders, digestive issues, or explosive anger that seems to come from nowhere. The anger is wood trying to break through constraints — except the constraints are often your own structures trying to keep you functional.\n\nSigns your wood is deficient: You feel stuck despite being constantly in motion. Connection feels performative. Your natural optimism has become empty positivity or cynical jadedness. You're exhausted but can't rest. You've lost your flexibility — you're rigid about your freedom, dogmatic about spontaneity. Physical signs include fatigue that sleep doesn't fix, vulnerability to every passing illness, lack of motivation that you're masking with forced enthusiasm, or injuries from overextension.\n\nDaily practices for wood balance start with morning. Wake with the sun when possible — wood is the energy of dawn, of spring, of things beginning. Your morning practice should include movement (you're a Horse; stillness-based meditation alone won't work) but movement that's contained and completing. Yoga, qi gong, or even a walk with a specific route and return point. The practice is learning that completion isn't confinement. Fifteen minutes of this is worth more than an hour of scattered activity.\n\nEnvironmental adjustments matter more for you than for most signs. You need regular exposure to actual wood element — trees, plants, forests. A weekly nature immersion isn't optional self-care; it's elemental maintenance. Your living space needs wood colors (greens, browns), living plants (not fake ones — you'll unconsciously register the deadness), and importantly, it needs incompleteness. Don't over-design your space. Leave room for growth and change. The Horse who tries to create the perfect minimalist container will end up feeling caged by their own aesthetic.\n\nSeasonal awareness is crucial. Spring is your power season — use it for initiating, launching, beginning. But you must consciously work with the other seasons rather than trying to make every season spring. Summer (fire season) you'll naturally burn bright, but build in restoration practices. Autumn (metal season) is pruning time — deliberately cut back, complete things, let metal structure your wild growth. Winter (water season) must be for genuine rest, not rest-as-strategic-pause-before-more-growth. Water season is when you replenish the resource that lets your wood flourish.\n\nLeveraging element cycles for growth means understanding that wood generates fire, and fire eventually depletes wood. Your pattern is likely: enthusiasm/launch/burnout/repeat. Instead: enthusiasm/build/sustain/complete/rest/repeat. Add the middle and ending phases. Practically, this means when you start something, immediately schedule its completion date and rest period. Don't wait until you're depleted to rest. Nourish your wood by deliberately engaging with water element — actual water (swimming, baths, ocean time), water practices (deep emotional processing, therapy, genuine rest), and water relationships (people who slow you down in a good way). The Wood Horses who thrive long-term are the ones who learned that growth requires cycles, and that winter isn't the death of spring but the condition of its return."
}