{
  "elementalIdentity": "You are the Wood Dog, and that makes you one of the most naturally ethical beings in the entire sixty-sign cycle. Wood is the element of growth, expansion, and moral vision—it reaches upward toward light, insists on doing things right, and carries an almost painful sensitivity to injustice. The Dog is loyalty incarnate, the guardian who cannot rest when something feels wrong, who will sacrifice personal comfort for principle. Put these together and you get someone who doesn't just have values—you ARE your values. You can't separate your sense of self from your sense of what's right. This is both your superpower and your burden.\n\nThe Dog in other elements can be rigid (Earth Dog), aggressive (Fire Dog), or suspicious (Metal Dog). But Wood softens the Dog's natural defensiveness into something more redemptive. You believe people can grow. You believe in second chances, in rehabilitation, in the possibility that broken things can be fixed. Where other Dogs might write someone off, you see potential. Where other Wood signs might be too accommodating, the Dog in you draws a line. You're the friend who will drive across town at 3am because someone needs help, but you're also the one who will tell hard truths when everyone else stays silent. You guard, yes—but what you're really guarding is growth itself, the possibility of better.\n\nYour archetype is the Loyal Guardian, and it's crucial to understand what you're guarding. It's not property or tradition for its own sake. You guard the vulnerable, the growing, the not-yet-realized. You're the teacher who stays late with the struggling student, the manager who fights for the overlooked employee, the friend who refuses to let someone self-destruct. You have an almost parental quality, but it's the good parent—the one who protects AND lets go, who sets boundaries AND believes in autonomy. You understand that real guardianship means creating conditions for others to flourish, not controlling them.\n\nBut here's the shadow you need to face: Wood Dogs can become martyrs. You can pour yourself out so completely in service of others' growth that you forget you're also a living thing that needs tending. The Dog's loyalty becomes self-abandonment. The Wood's flexibility becomes doormat energy. You can spend years building others up while your own roots starve. And when Wood depletes, it doesn't just wither quietly—it becomes brittle, resentful, passive-aggressive. You start keeping score. You start feeling like everyone takes and no one gives. This is your danger zone, and you need to recognize it before bitterness hardens into something uglier.\n\nAmong the sixty signs, you're one of the few who can hold both firmness and compassion without collapsing into either extreme. You're not the most flashy or ambitious sign—Wood Dogs rarely are—but you're the one people remember as having actually mattered in their lives. You change people not through grand gestures but through consistent presence, through showing up, through refusing to give up on what matters. That's the gift of Wood expressed through the Dog's devotion: you make growth possible for others simply by being who you are.",
  "elementInDepth": "Wood is the element of spring, and if you understand spring, you understand yourself. Spring is not gentle—it's forceful, insistent, relentless. Seeds crack concrete. Shoots push through frozen ground. Wood is yang energy ascending, and it will not be denied. In you, this manifests as a kind of moral momentum. Once you've decided something is right, you move toward it with surprising force. People mistake Wood for passive because it bends, but bending is a strategy, not a weakness. You bend around obstacles the way a river bends around rocks—not because you've given up, but because you're still moving forward.\n\nIn the Five Element productive cycle, Wood generates Fire. This is critical for you. Your natural state is to fuel others, to give energy, to be the kindling that helps others burn bright. You're generous with your life force—maybe too generous. Every Wood sign has to learn this lesson, but as a Dog, you're especially vulnerable because your loyalty compounds the issue. You don't just give energy; you give it faithfully, repeatedly, to the same people and causes even when they're not reciprocating. You can spend decades feeding fires that don't warm you back. The productive cycle flows one way—Wood to Fire—but you need to understand that healthy relationships require exchange, not just donation.\n\nWood controls Earth in the destructive cycle, and this is where your power lives. Earth represents stability, accumulation, boundaries, and worry. You have a natural ability to break up stagnation, to prevent Earth's tendency toward immobility. In practical terms, this means you're good at getting stuck people unstuck, at challenging overthinking, at introducing movement where there's been paralysis. But here's the catch: when your Wood energy is excessive—when you're overextended, stressed, trying to grow in too many directions—you attack Earth too aggressively. You become controlling, invasive, unable to respect others' boundaries. You justify it as helping, but really you're forcing. Healthy Wood controls Earth gently, like roots preventing erosion. Excessive Wood strangles.\n\nMetal controls Wood in turn, and you need to understand this as your governor. Metal is precision, cutting, pruning, discipline. When Metal energy is healthy in your environment or relationships, it helps you focus, teaches you when to stop growing, shows you that not every direction is worth pursuing. But when Metal is excessive—criticism, rigidity, harsh judgment—it wounds you deeply. Wood Dogs can be absolutely devastated by criticism, especially when it comes from people you respect. You internalize it, let it cut into your sense of moral worth. Learning to distinguish between helpful pruning and destructive cutting is essential for your mental health.\n\nWhen your Wood is strong—when you're rested, supported, living in alignment with your values—you're magnificent. Flexible but unbreakable. Kind but not naive. You grow toward light and you help others do the same. You have energy to spare. You recover quickly from setbacks. Your optimism is real, not performed. But when Wood depletes—chronic stress, betrayal, years of giving without receiving—you become something else. Brittle Wood snaps. You get rigid, defensive, exhausted. You lose faith in growth itself, which for you is like losing faith in life. You can fall into depression that has a specific flavor: the sense that trying is pointless, that nothing gets better, that you've been a fool for believing. This is depleted Wood talking, and you need to recognize it as an elemental imbalance, not truth.\n\nYour task is learning to tend your own roots as devotedly as you tend others. Wood requires water to thrive—in elemental terms, Water generates Wood. You need rest, depth, stillness, the downward energy that replenishes. For a Dog, this is hard. Dogs are alert, active, responsive. But you must learn the art of strategic withdrawal, of letting yourself go dormant when needed. Your growth is not infinite. It's cyclical. Honor the cycle.",
  "yearAhead2026": "The Year of the Fire Horse runs from January 29, 2026, to February 16, 2027, and this is a volatile year for you. Fire Horse years are intense, passionate, unpredictable—the Horse brings speed and independence, Fire brings combustion and transformation. For Wood Dog, this creates both opportunity and danger. In the productive cycle, Wood generates Fire, which means this year will draw on your energy reserves significantly. You'll feel in demand. People will want your time, your insight, your support. Projects will require fuel, and you're the fuel. The question is whether this consumption serves you or just burns you down.\n\nQ1 (Jan-Mar 2026) begins with the transition into Horse energy, and you'll feel the acceleration immediately. The Horse doesn't do the Dog's patient guardian routine—it wants movement, freedom, action now. This quarter is about recalibrating your relationship with loyalty. Some commitments you've been carrying need to be dropped, not because you're disloyal, but because they're dead wood. Fire Horse energy is merciless with dead wood—it burns it away. Let it. You'll be tempted to hold on out of duty, but the cost will be too high. Watch for opportunities that promise growth and alignment with your values. These are worth pursuing. Watch for opportunities that just promise to need you. Those are traps. The new moon in February is particularly potent for setting intentions around what you'll actually tend this year.\n\nQ2 (Apr-Jun 2026) brings the test of overextension. Fire is blazing now, and if you haven't set boundaries in Q1, you'll hit depletion. This is when Wood Dogs typically crash—you've given too much, said yes too often, fueled too many other people's fires. If you feel resentment building, that's your signal. Resentment in Wood signs means your roots are starving. You need to withdraw, replenish, possibly disappoint people. The Dog in you will hate this, but it's necessary. On the flip side, if you've managed your energy well, Q2 can be incredibly productive. Your natural Wood-Fire flow means you can initiate things that take off quickly. Creative projects, new relationships, advocacy work—anything that requires both vision (Wood) and passion (Fire) benefits from your energy right now. Just track your reserves.\n\nQ3 (Jul-Sep 2026) shifts the energy. Summer fire peaks and begins to wane, and you'll feel the season turning even if others don't. This is your moment to redirect, to do course corrections before the year's final push. Pay attention to what's actually growing versus what you're just keeping alive through sheer will. Wood understands the difference—natural growth is easy, forced growth is exhausting. The Horse energy wants you to be more independent than you're comfortable with, and this quarter, try it. Take space. Travel if possible. Break routines. The Dog likes familiar territory, but Fire Horse is dragging you out of it regardless, so you might as well go willingly. Relationships that depend on your constant presence will strain now. Let them. If they can't survive your autonomy, they were draining you anyway.\n\nQ4 (Oct-Dec 2026) is integration time. The year has burned away something, and now you're seeing what remains. For Wood Dog, this often means a clearer sense of purpose—you've learned what's actually worth guarding versus what you were guarding out of habit. The end of a Fire Horse year can feel depleting for Wood signs, so prioritize restoration practices. Say no more than yes. Delegate. Rest without guilt. The lessons of 2026 are about sustainable loyalty—how to be devoted without being destroyed, how to serve without becoming a servant, how to generate Fire without burning yourself to ash. If you've learned this, 2027's Fire Goat energy will be far gentler with you. If you haven't, you'll enter the new year already exhausted. Use Q4 to replenish deeply. Your roots need winter.",
  "compatibilityMap": "Your elemental compatibility is nuanced because you're Wood, which is inherently relational, expressed through Dog, which is inherently selective. You don't love easily, but when you do, you love completely. Understanding element dynamics helps you recognize why some connections energize you while others drain you, and why some conflicts are productive while others are just painful.\n\nWater element people (Rat, Pig) are your natural generators. In the productive cycle, Water generates Wood—it nourishes you, replenishes you, helps you grow. Water Dog, Water Pig, even Water Rat (though Rats and Dogs have animal-level tension) can be deeply restorative for you. These people offer emotional depth, intuition, and the kind of reflective space that lets you root down. In romance, Water partners help you access vulnerability without judgment. They don't need you to perform strength constantly. In friendship, they're the ones who let you rest, who understand that the guardian needs guarding sometimes. The shadow side: you can become dependent on Water's nourishment, and if they withdraw, you feel it acutely. Also, Water can be indirect and emotionally complex in ways that frustrate the Dog's need for straightforwardness.\n\nFire element people (Snake, Horse) are who you generate. You fuel them naturally—Wood generates Fire—and this can feel purposeful and energizing when it's reciprocal. Fire Horse, Fire Snake, even Fire Dog (another Dog who speaks your language) can inspire you, pull you into passion and action you might otherwise avoid. Fire people appreciate your integrity and will defend you fiercely. The sexual chemistry can be intense because the element flow is so natural. But here's the danger: Fire consumes Wood. In unbalanced relationships, Fire partners take and take and take, and you give and give and give, and everyone thinks it's working until you're ash. You must—must—establish boundaries with Fire people. They're not doing it maliciously; consumption is just Fire's nature. In friendship, Fire people are exciting but exhausting. Dose carefully. In romance, incredible when balanced, devastating when not.\n\nEarth element people (Ox, Dragon, Goat, Dog) represent control dynamics. Wood controls Earth in the destructive cycle, which sounds negative but can actually be healthy. You break up Earth's tendency toward stagnation and worry. Earth Dog is particularly interesting—same animal, different element. You can help Earth Dog lighten up, and they can help you ground. Earth partners (especially Ox and Goat) benefit from your ability to initiate movement and growth in their lives. You prevent them from getting stuck. But when you're depleted or controlling, you become invasive with Earth people—pushing when they need stillness, disrupting when they need stability. And when they're unbalanced, Earth people can be smothering, needy, or worried in ways that drain your Wood energy. Friendship with Earth signs is often easier than romance because the stakes are lower. Romantically, it requires conscious effort to balance control and support.\n\nMetal element people (Monkey, Rooster) control you in the elemental cycle. Metal controls Wood—it prunes, cuts, shapes. Healthy Metal partners (Metal Rooster especially) can be incredible for you because they provide the discipline and focus you sometimes lack. They help you stop overextending, teach you discernment, cut away what's not working. The Dog-Rooster combination has natural respect built in. But unbalanced Metal is brutal for you. Excessive criticism, rigidity, emotional coldness—these wound Wood deeply. Metal people can devastate you with a few cutting words because you take their judgment seriously. In romance, Metal partners challenge you to grow but can also make you feel like you're never enough. In friendship, they're the ones who tell you hard truths, which you need, but the delivery matters enormously.\n\nOther Wood element people create peer dynamics. Wood Rabbit, Wood Tiger—these are people who understand your nature inherently. You don't have to explain why you care so much, why injustice bothers you so deeply, why you can't just let things go. But two Wood people can also enable each other's overextension, or compete for the same sunlight. Wood-Wood friendships are often more successful than romances because romantic partnerships need more elemental diversity to create dynamic flow. That said, if both partners are self-aware and committed to mutual growth, Wood-Wood romance can be genuinely beautiful—two people devoted to becoming their best selves together.",
  "elementalBalanceGuide": "Balancing your Wood energy is not optional—it's the core task of your life. Every other goal depends on this. When your Wood is balanced, you're unstoppable: flexible, generous, optimistic, effective. When it's imbalanced, everything falls apart. Here's how to recognize imbalance and what to do about it.\n\nSigns of excess Wood: You're overcommitted and can't say no. You're managing everyone's problems but ignoring your own. You're growing in too many directions—multiple projects, too many relationships, constant expansion. You feel wired and tired simultaneously. You're becoming controlling, pushing people toward growth they haven't asked for. Your body shows tension in Wood-governed areas: tight jaw, shoulder pain, headaches, digestive issues from stress. You're irritable, snapping at people, frustrated by others' pace. Excess Wood attacks Earth—you can't tolerate stillness, can't stop moving, can't rest without anxiety. This is the guardian who's guarding so vigilantly they've forgotten what they're guarding for.\n\nSigns of depleted Wood: You've lost optimism. Growth feels pointless. You can't access your natural flexibility—everything feels brittle, defensive. You're exhausted but can't pinpoint why. You've stopped believing people can change, including yourself. You feel resentful, taken advantage of, invisible. Your generosity has curdled into bitter scorekeeping. You've withdrawn from commitments that once mattered. Physically, you might experience fatigue, lack of motivation, depression with that specific 'nothing will ever get better' flavor. Depleted Wood can't generate Fire—you have nothing left to give, and this terrifies you because giving is how you know yourself.\n\nDaily practices for Wood balance: Start your day with gentle movement—stretching, yoga, walking. Wood needs physical expression but not aggressive exercise. You need flow, not force. Spend time with plants, literally. Garden if possible, or keep living things you're responsible for watering and tending. This reminds Wood of natural cycles. Practice boundary-setting as a daily discipline. One 'no' per day minimum. Say no to something small—it builds the muscle. Journal your resentments. Wood Dogs carry resentment silently until it poisons everything. External processing prevents internal rot. Find one person who nourishes you—your Water source—and spend time with them weekly. Make time for creative expression with no purpose beyond enjoyment. Wood needs to grow for its own sake sometimes, not always in service of something else.\n\nEnvironment adjustments: Bring Wood element into your space through living plants, wooden furniture, the color green, vertical lines. Face east when you need clarity about growth direction. Reduce Metal in your immediate environment if you're feeling criticized or wounded—minimize white, reduce sharp angles, limit exposure to cutting energy. Increase Water elements when depleted—add blues, install a small fountain, keep water visible. Your bedroom especially should have nourishing Water energy to support overnight restoration. Reduce Fire elements when you're feeling drained—less red, fewer triangular shapes, dimmer lighting. You're generating Fire all day; your home shouldn't demand more.\n\nSeasonal awareness: Spring is your power season. This is when Wood is naturally dominant, and you should initiate major projects, make significant decisions, push forward on what matters. Summer requires careful energy management. Fire is blazing and will pull on your Wood constantly. This is when you most need boundaries and restoration practices. Autumn challenges you. Metal is ascendant, and you'll feel more criticized, more cut back. Use this for helpful pruning—eliminate what's not working—but protect yourself from excessive cutting. Winter is for deep replenishment. Water is dominant, and you should lean into rest, reflection, planning rather than action. Wood Dogs resist winter, but you need it desperately.\n\nLeveraging element cycles for growth: When you want to initiate something, enhance your Wood energy—spend time in nature, wear green, work with growing things, connect with your values. When you need passion or completion, consciously generate Fire—take action, increase intensity, connect with Fire people. When you're scattered, bring in Earth—create routine, touch soil, practice stillness. When you need clarity or focus, work with Metal energy—edit ruthlessly, get critical feedback, use precision tools. When you're depleted, seek Water—rest, go to actual water, cry if you need to, spend time with Water people. The cycle is always available. You're not stuck with just Wood. You can move through all five elements as needed, but you must do it consciously. Your default is to give Wood until there's nothing left. Don't default. Choose."
}