{
  "elementalIdentity": "You are the Wood Tiger — and if that sounds like a contradiction, you're starting to understand yourself. The Tiger is raw power, instinct, territorial dominance. Wood is growth, bending, compassion, the gentle unfurling of a fern in spring. Put them together and you get someone who charges forward with genuine care for who gets trampled in the process. You're the adventurer who stops mid-quest to help a stranger. The warrior who fights for the underworld's forgotten. You have the Tiger's courage and the Wood element's insistence on connection, which means you can't just conquer — you have to heal what you touch.\n\nThis makes you rare among Tigers. Most Tigers burn (Fire), cut through (Metal), or dominate (Earth). But you? You grow around obstacles. You're flexible in ways other Tigers aren't, which confuses people who expect you to be predictable in your aggression. You'll back down from a fight that doesn't matter, then suddenly become immovable when your values are threatened. That's Wood's nature — it looks soft until you try to uproot it, then you discover the whole root system is interconnected and you've picked a fight with a forest.\n\nThe Compassionate Adventurer archetype means you're driven to explore, expand, discover — but never alone, never without purpose beyond yourself. You're not collecting experiences like trophies. You're gathering wisdom to distribute. You adventure because growth requires new soil, and you're compassionate because Wood element understands that all living things share the same source water. This combination makes you magnetic to people who need direction but exhausting to people who want you to just settle down and stop caring so much about everything.\n\nYour core wound is the gap between your Tiger instinct to dominate and your Wood nature to nurture. When you're healthy, these forces create dynamic tension — you lead with vision, not ego. When you're out of balance, you either become a doormat (Wood without Tiger) or a tyrant (Tiger without Wood). The integration point is understanding that true strength grows things rather than destroying them. A Tiger who has internalized Wood wisdom doesn't become less powerful; they become powerful in ways that last beyond their lifetime.\n\nYou are here to prove that fierce and kind are not opposites. That protection and growth can come from the same source. That the wildest parts of nature are also the most interconnected. When people meet you, they feel both challenged and safe, which is an unusual combination. You make them want to be braver and softer at once. That's your elemental signature — the adventurer who brings people home to themselves.",
  "elementInDepth": "Wood in Wu Xing is the element of spring, of dawn, of beginnings. It's the Yang force that pushes the seed through soil, that insists on expansion even when conditions aren't perfect. In you, this manifests as relentless forward motion coupled with an almost irritating optimism about growth. You genuinely believe people can change, systems can evolve, and dead things can regenerate. This isn't naïveté — it's elemental nature. Wood doesn't question whether growth is possible; it just grows.\n\nFor the Wood Tiger specifically, your element amplifies certain Tiger traits while tempering others. The Tiger's territorial instinct becomes about protecting growth rather than hoarding resources. Your anger — and you have Tiger anger, don't pretend you don't — expresses as frustration with stagnation rather than personal offense. You get enraged when you see potential being wasted, talent being suppressed, life being constrained. That's Wood energy experiencing blockage, which is the one thing Wood cannot tolerate.\n\nIn the productive cycle, Wood generates Fire. This means your natural outlet is inspiration, vision, creative energy. When your Wood is strong, you ignite other people. You walk into rooms and suddenly everyone has ideas, energy, direction. You're a catalyst. But this also means you can burn yourself out trying to be everyone's spark. Wood that generates too much Fire becomes depleted — the tree that fruits too heavily, the teacher who gives until they're hollow. You must learn that not every fire is yours to start.\n\nWood controls Earth in the destructive cycle, which gives you power over stability, structure, and material concerns. When balanced, this means you can break through stuck systems, challenge ossified thinking, and refuse to be buried by convention. You have an instinct for where the cracks are in any foundation. But when your Wood is excessive, you become destabilizing. You uproot things that needed to stay planted. You grow so fast you crack the container. You mistake all structure for prison.\n\nWhen Wood is depleted in your chart — through overwork, disconnection from nature, too much Metal energy (criticism, cutting) around you — you lose flexibility. Brittle Wood breaks instead of bends. You become rigid in your thinking, harsh in your judgments, unable to adapt. The Tiger comes out without the Wood's tempering influence, and you're just aggression without growth. You'll notice this when you start seeing obstacles as enemies rather than teachers, when you stop believing in second chances, when you'd rather burn bridges than build new ones.\n\nStrong Wood in your chart looks like: easy resilience, quick recovery from setbacks, genuine excitement about the future, ability to see potential in everyone, comfortable with change, naturally generous. Depleted Wood looks like: defensiveness, inability to rest, compulsive productivity, resentment toward people who need you, feeling trapped by your own commitments. The key is remembering that Wood needs water (rest, stillness, depth) and space (freedom, open horizons). Your element is strong, but it's not invincible.",
  "yearAhead2026": "The Year of the Fire Horse starting January 29, 2026 is going to light you up — literally. Fire Horse energy is fast, free, passionate, and absolutely uninterested in anyone's limitations. For Wood Tiger, this is a productive cycle year: your Wood feeds Fire, which means you're resourced, not drained. The Horse gallops and the Tiger prowls, both are movement animals, so expect a year of momentum. But here's the warning: just because you CAN sustain this pace doesn't mean you should. Fire Horse will take everything you give and ask for more.\n\nQ1 (Late January through March): The year opens with Fire energy demanding bold moves. This is your window for launches, proposals, new directions. Whatever you've been planning, start it now. The Horse energy favors speed over perfection, and your Wood nature will want to prepare more, but resist that urge. This quarter rewards the leap. Watch for opportunities that feel too fast — they're not. Your challenge is trusting your instincts without overthinking. Fire burns away your usual compassion for process; this quarter is about results. Romantically, expect intensity. New connections happen fast; existing relationships need adventure or they'll feel stagnant.\n\nQ2 (April through June): Fire Horse energy peaks and you might feel manic. This is maximum output time. You'll accomplish an absurd amount, but watch your Wood reserves. Are you growing or just burning? The difference is whether you're building something sustainable or just creating heat. Professionally, you'll be visible — potentially too visible. The shadow side emerges here: Fire can make Wood showy, and Tiger energy loves the spotlight. Don't let performance replace substance. This is when you're most likely to overcommit. Say no to anything that doesn't feed your core growth direction. Health-wise, your nervous system is taxed. The Fire-Wood connection is energizing but depleting.\n\nQ3 (July through September): The Horse starts to tire, which means you do too. This quarter is about harvest, not planting. Finish what Q1 and Q2 started. Your Wood nature wants to start new growth, but Fire Horse is moving toward autumn, completion energy. Resist the urge to take on more. This is integration time. What did all that Fire energy actually create? What remains when the flames die down? Relationships that started intensely either deepen now or reveal themselves as just sparks. Financially, this is collection time — bring in what's owed to you, close deals, convert energy into resource.\n\nQ4 (October through December): Fire Horse winds down and you'll feel the shift hard. Suddenly you have space again, and it might feel uncomfortable. Your Wood needs this recovery time, but Tiger energy hates feeling slow. Use this quarter for planning 2027, which is Fire Goat (still Fire, but much gentler). This is also relationship repair time — anyone you neglected during the wild momentum of the year needs attention now. The Horse energy fades but Tiger remains, so channel that into depth rather than distance. End the year with gratitude practices. Fire years can make Wood Tigers feel invincible; you're not. Acknowledge what the year took as much as what it gave.\n\nKey themes overall: velocity, visibility, creative output, passion projects, leadership opportunities. Warnings: burnout masked as productivity, relationships sacrificed for momentum, mistaking activity for growth. Your strategic advantage is that Fire needs Wood to exist, so you're essential this year in ways you weren't in 2025's Wood Snake year. Use that leverage wisely.",
  "compatibilityMap": "Wood Tiger, your relationship patterns are shaped by the fundamental tension between Tiger's solitary nature and Wood's connective drive. You need people but also need to run alone in the forest. Partners who understand this paradox last; those who don't get confused and hurt. Element compatibility matters more than animal signs because your relating style is filtered through Wood's growth orientation — you see every relationship as evolution or stagnation.\n\nBest element match is Water. Water nourishes Wood in the productive cycle, which means Water people naturally resource you without trying. Water Dog, Water Pig, Water Rat — these are your deep wells. They provide emotional depth, intuitive understanding, and the stillness that balances your motion. With Water partners, you feel safe enough to stop performing. They don't need you to be strong all the time, which paradoxically makes you feel stronger. The challenge is Water's tendency toward formlessness; your Wood needs something to grow toward, and Water doesn't always provide clear direction. In romance, this is soul-bond territory. In friendship, these are your truth-tellers.\n\nFire signs are complicated. Fire Dragon, Fire Horse, Fire Snake — they excite you because Fire is Wood's natural offspring. You feel purposeful around Fire people; they give you something to fuel. But Fire also consumes, and you can mistake being needed for being loved. Fire partners will burn bright with you then leave ash. These relationships are passionate but rarely sustainable. You'll accomplish incredible things together and damage each other in the process. Best kept as collaborators or short-term lovers rather than life partners. The sex is exceptional, though. Fire and Wood in bed is exactly what you'd expect.\n\nEarth signs are your control dynamic. Wood controls Earth, which means you naturally dominate Earth Ox, Earth Goat, Earth Dog. These relationships can feel easy because you're in charge, but easy isn't the same as good. Earth provides stability you need but also the stagnation you fear. You'll get bored. Earth partners will feel undermined by your constant growth pushing. The successful Wood-Earth partnerships are where Earth is strong enough to withstand your roots breaking their foundation — think Earth Ox, who doesn't move for anyone. Avoid weak Earth signs; you'll destroy them accidentally.\n\nMetal is your nightmare match. Metal controls Wood in the destructive cycle — Metal cuts, chops, shapes, limits. Metal Monkey, Metal Rooster, Metal Dog — they will try to prune you into their vision. Every criticism feels like an axe. You'll either become rigid defending yourself or lose your form trying to please them. The only Metal that works is one who understands their cutting as refinement, not destruction, and that's rare. These relationships bring out defensive Tiger with none of Wood's flexibility. Sexually, there's tension, but it's the kind that leaves scars.\n\nOther Wood signs are sibling energy. Wood Rabbit, Wood Dragon, Wood Horse — you understand each other but compete for the same resources (sunlight, space, attention). Great as friends who champion each other's growth. As partners, you'll need very separate domains or you'll tangle and choke each other out.\n\nIn relationship, you love by facilitating growth. You see potential and nurture it. Your shadow is loving the project more than the person. You fight when you feel constrained or when you see your partner limiting themselves. Your Wood compassion means you rarely fight dirty, but Tiger comes out if you feel trapped — then you're vicious. You grow through relationships that challenge you to integrate independence with intimacy. You need partners who adventure WITH you, not ones waiting at home. Distance actually helps you — Wood expands, so space in relationships feels like freedom, not abandonment.",
  "elementalBalanceGuide": "Balancing Wood energy means understanding you're not trying to reduce yourself — you're trying to maintain optimal conditions for growth. Wood out of balance manifests in two directions: excess (overgrowth, intrusion, rigidity) or deficiency (brittleness, stagnation, disconnection). For Wood Tiger, the Tiger nature tends toward excess while ignoring deficiency until you crack.\n\nExcess Wood signs: You can't stop starting things. Every conversation becomes about future plans. You feel physically restless, unable to sit still. You're irritable with people who move slowly. You experience your environment as constantly constraining. Your jaw clenches. Your shoulders rise toward your ears. You interrupt people. You give advice nobody asked for. You see obstacles everywhere and your first instinct is to break through them. This is Wood growing without wisdom — all expansion, no consolidation.\n\nDeficiency Wood signs: Decision paralysis. You can't imagine the future. Colors look duller. You're cynical about change. Your body feels stiff, especially in the morning. You're resentful of people who need you. You fantasize about burning your life down. You stop believing people can grow. Your compassion dries up and you're just tired Tiger, which is the saddest version of you. This is Wood depleted of water — dried out, ready to snap.\n\nDaily practices for balance start with morning movement. Wood energy is kinetic — it needs to move or it stagnates. But not aggressive exercise; that's Fire. Wood needs flexibility practices: yoga, tai chi, dancing, walking in nature. Your element is literally trees, so being among trees isn't metaphorical medicine — it's elemental alignment. Ten minutes barefoot on earth daily will do more for you than therapy. This sounds like hippie nonsense, but it's Wu Xing physics. Wood connects to earth through roots.\n\nEnvironment adjustments matter more for Wood than other elements. You need space with growth in it — plants, windows with views, rooms that don't feel closed. Clutter is death to Wood energy. You need clear pathways, literal and visual. Color-wise, green is obvious but also blue (Water nourishes Wood). Avoid excessive white or gray (Metal energy). Your space should feel alive, not decorated. Living things over expensive things.\n\nSeasonal awareness is critical. Spring is your power season — you're naturally aligned, everything flows. Summer you're fueling Fire, which is purposeful but draining. Late summer (Earth season) you'll feel heavy; this is when you need to rest most but will resist it. Autumn (Metal season) is your hardest time. Metal cuts Wood, so fall brings criticism, doubt, and the urge to defend. This is when you need extra water element (rest, depth, stillness). Winter (Water season) should be regenerative, but Tiger nature resists hibernation. Override that instinct. Winter rest determines spring growth.\n\nTo leverage element cycles for growth: identify what element you're deficient in and pursue it deliberately. Lacking Fire? Chase inspiration, take creative risks. Lacking Earth? Build routine, save money, eat regularly. Lacking Metal? Seek feedback, edit ruthlessly, create structure. Lacking Water? Rest, reflect, do nothing. Your Wood will resist this because growth wants to be the answer to everything, but sometimes you need non-growth elements to support sustainable growth.\n\nPractical daily rhythm: Morning movement, midday productivity (your Wood peak), afternoon connection (use that Wood compassion when you have energy for it), evening wind-down with Water activities (reading, baths, stillness). Eat green vegetables not because of nutrition but because it's elemental alignment. Drink more water than you think you need. Sleep in darkness — Wood needs the rest cycle to grow properly.\n\nFinal truth: Your balancing act is between the Tiger who wants to conquer and the Wood that wants to connect. Neither is wrong. The integration is understanding that the strongest growth happens through relationship, not domination. You're not balancing away your power; you're rooting it deep enough to weather any storm. That's what Wood Tiger mastery looks like — the adventurer who carries their forest with them."
}