{
  "elementalIdentity": "You are the Wood Pig, and that makes you the most quietly radical force in the entire sixty-sign cycle. While others strut and posture, you grow things. While they scheme and calculate, you give. This isn't naivety—it's strategy written in a language most people have forgotten how to read. Your wood element fuses with the pig's fundamental nature to create something rare: genuine generosity backed by renewable energy. You're not giving from a depleting well; you're giving from an aquifer that refills as it flows.\n\nLet's be clear about what wood means in your chart. This isn't the rigid timber of construction or the decorative bamboo in someone's minimalist apartment. Your wood is the forest floor in spring—mycelial networks exchanging nutrients, saplings reaching for light gaps, everything growing in relationship to everything else. The pig brings sincerity, sensuality, and an almost painful openness to experience. Wood brings direction, expansion, and the ability to bend without breaking. Together? You're someone who can hold space for others' growth while maintaining your own trajectory. You don't just accommodate—you metabolize experience into wisdom and turn it back into nourishment for your community.\n\nThe archetype of the Generous Soul isn't about martyrdom or codependence. It's about understanding a fundamental truth that the Metal signs miss and the Fire signs burn through too quickly: abundance is a practice, not a destination. You create wealth—emotional, social, sometimes material—by keeping things moving. Stagnant water breeds mosquitoes; flowing water sustains ecosystems. You intuitively understand this. Your generosity isn't random; it's ecological. You give where growth is possible, where reciprocity might emerge not as transaction but as natural consequence.\n\nHere's what makes you different from the other wood animals. The Wood Rabbit is too careful, too image-conscious. The Wood Tiger is too hungry, too conquering. You have the pig's groundedness, that connection to earth-as-foundation, which means your wood doesn't just reach up—it roots down. You're not grasping; you're establishing. This makes you the slowest to anger of the wood signs and the hardest to uproot. People mistake your flexibility for weakness until they realize you've quietly become indispensable, that the entire structure depends on the support system you've been growing all along.\n\nBut let's talk shadow, because you have one. The Generous Soul can become the Depleted Martyr when you forget that wood must also draw nourishment inward. You can over-extend, giving to people who are consuming rather than reciprocating, growing in directions that lead nowhere. And because you're the pig, you might not notice until you're exhausted, because you have this dangerous gift of finding pleasure even in your own exploitation. Your challenge isn't learning to give—you'll do that until your last breath—it's learning to be as generous with yourself as you are with everyone else.",
  "elementInDepth": "Wood in Chinese elemental logic is the morning, the east, the color green, the energy of spring. It's the first movement after winter's stillness—the Yang emerging from Yin, the seed cracking open, the undeniable push toward manifestation. In your chart, wood isn't a static trait; it's a dynamic process. You are always in some state of growth, expansion, or renewal. The question is never whether you're growing but what direction that growth takes and what it's feeding on.\n\nThe productive cycle matters enormously for you. Wood feeds Fire—you naturally energize the passionate, the creative, the charismatic. You're the person who makes other people's ideas possible, who provides the steady fuel for their brilliance. This is your gift and your trap. Wood Pigs often find themselves in support roles not because they lack ambition but because they're genuinely good at making things grow, and others sense this. You need to watch that you're not just feeding fires that consume you without warmth in return. The productive cycle should flow, not drain.\n\nWood controls Earth in the destructive cycle, and this is where your power lives. Earth represents stability, accumulation, worry, overthinking. Your wood energy can break up stuck earth—you help people who are trapped in rumination, who've calcified around their wounds. You bring movement to stagnation. But control goes both ways, and when you're weak, Earth can smother you. Metal-heavy people can exhaust you by cutting at your growth. Fire types can burn through your resources if you're not careful. You need to understand these dynamics not as personality conflicts but as energetic realities.\n\nWhen your wood is strong—when you're well-rested, inspired, connected to purpose—you're unstoppable in the gentlest way. You grow projects from nothing. You see potential in people others have written off. You create abundance by refusing to operate from scarcity logic. Strong wood in the pig means you're flexible enough to adapt to anything while maintaining your core integrity. You bend in the storm; you don't break. You also know when to grow fast and when to consolidate, because you're connected to natural timing that others have to learn intellectually.\n\nBut depleted wood in the pig is a specific kind of suffering. You become rigid where you should be flexible, brittle where you should be strong. You lose your capacity for renewal and start operating from a fixed resource model—there's only so much love, so much energy, so much opportunity. This isn't your natural state; it's what happens when you've been cut at repeatedly or starved of what wood needs: space to grow, light to reach toward, water to draw from, and room for your roots. Depleted wood pigs become cynical, which is heartbreaking because cynicism is just disappointed idealism, and your idealism is one of your most valuable qualities.\n\nYou also need to understand that wood has a season. Spring doesn't last forever, and you shouldn't try to make it. There are times to push growth and times to consolidate, times to give and times to draw inward. The pig's natural rhythm is slower than wood's natural urgency, and this is actually your advantage. You grow things that last because you're not just chasing expansion—you're building living systems. Other wood signs burn out young. You're playing a longer game, whether you realize it or not.",
  "yearAhead2026": "The Year of the Fire Horse is not subtle, and it's not asking for your permission. 2026 brings intensity, speed, and the kind of chaotic creativity that either exhilarates or exhausts you—sometimes both in the same week. For the Wood Pig, this year is about learning to feed the fire without burning yourself up. Fire needs wood, and you're going to feel that pull constantly. The question is whether you're tending a hearth or watching a wildfire.\n\nQ1 (January through March) hits immediately with Horse energy demanding movement. You'll feel pressure to commit, launch, or accelerate before you're ready. Resist the urge to match the Horse's pace just because everyone around you is galloping. Your wood needs time to establish roots before it can support real growth. This quarter is about discernment—which fires are worth feeding? Which passionate people and urgent projects actually align with your long-term vision? The Horse year will present a dozen opportunities; your job is to choose the two that matter. Watch for Fire types entering your orbit with big energy and bigger promises. Some will be genuine collaborators; others will be resource vampires with good PR. Trust your pig instincts about who's real.\n\nQ2 (April through June) is your power season because it's spring, your natural element's time. This is when you can actually match the Fire Horse's energy without depleting yourself. Launch what you carefully chose in Q1. Say yes to visibility, collaboration, and creative risk. Your wood is strong now; use it. The Horse's fire will amplify your natural growth cycle instead of competing with it. This is your window for bold moves—asking for what you want, initiating projects, putting yourself forward. Just remember: spring eventually yields to summer. Don't plant more than you can tend through the rest of the year.\n\nQ3 (July through September) brings the reckoning. Fire Horse energy peaks in summer, and if you've overextended, you'll feel it now. This is the burnout zone for Wood Pigs who didn't pace themselves. The antidote is strategic withdrawal—not quitting, but consolidating. Tend what you've planted rather than starting new things. The Horse year will tell you this is boring; your exhaustion will tell you it's necessary. Listen to your body. If you're depleted, you're no good to anyone. This quarter also brings relationship intensity—Fire Horse years are notorious for passionate entanglements that start fast and burn out faster. If you're single and someone extraordinary appears, enjoy it but don't make permanent decisions in temporary fire.\n\nQ4 (October through December) is about harvest and evaluation. The Fire Horse year is winding down; you're preparing for the Yin Earth Sheep of 2027, which will be far gentler on your system. This quarter asks: what did you actually build? What fires were worth feeding? What burned you for nothing? The Wood Pig's gift is turning experience into wisdom, and you'll need to do that deep alchemy now. Process what happened this year before moving forward. The wins and the losses both contain information. This is also when you'll see which relationships survived the intensity and which were only possible in fire conditions. Let what needs to fall away go without drama. You're making space for what's next.\n\nAll year long: protect your rest, guard your roots, and remember that your generosity is most sustainable when it comes from overflow, not depletion.",
  "compatibilityMap": "Wood Pig, you need to understand something about your relationship pattern: you're attracted to intensity but sustained by steadiness. Fire signs light you up—Fire Rabbit, Fire Tiger, Fire Horse—they make you feel alive, seen, creatively activated. The sex is great, the conversation sparkles, you feel like the best version of yourself. But Fire consumes wood, and unless they're unusually mature, Fire types will burn through your generosity without realizing they're doing it. You'll give and give, feeding their brilliance, until you're depleted. Then they'll wonder why you've gone cold. This doesn't make them villains; it makes them fire. You need to enter these connections with your eyes open and your boundaries clear.\n\nYour best elemental matches are Water and Earth, but for different reasons. Water Pig, Water Rabbit, Water Rat—these are your sustainable partnerships. Water nourishes wood in the productive cycle; they resource you as you grow. Water signs match your depth, your emotional complexity, your need for genuine intimacy. They're not trying to consume you; they're trying to merge with you, which you're actually built for. The challenge with Water matches is they can dampen your growth if they're in their shadow—too much emotion, too much need, pulling you into their undertow. But when Water is healthy, these relationships feel like coming home. You rest with them. You can be generous without depleting because they're giving back.\n\nEarth signs—Earth Dog, Earth Ox, especially Earth Rabbit—give you something different: stability, grounding, practical support for your dreams. You control Earth in the destructive cycle, which sounds negative but actually creates incredible dynamic tension. You loosen their rigidity; they contain your tendency to overextend. Earth partners help you build lasting structures from your generous impulses. The friction between wood and earth generates heat—good heat, the kind that forges something durable. These relationships work when you both respect what the other brings. They fail when Earth becomes controlling or when you become dismissive of their need for security.\n\nMetal signs are your education in boundaries. Metal Monkey, Metal Rooster, Metal Dragon—they'll cut at you, prune you, challenge your every assumption. Metal controls wood in the destructive cycle, and you'll feel it. These relationships are rarely comfortable but often transformative. Metal teaches you to shape your growth, to say no, to value quality over quantity. If you're strong in your wood, you can withstand the cutting and become something more refined. If you're already depleted, Metal will just wound you. These are not your refuge relationships; these are your growth-through-friction relationships.\n\nIn friendship versus romance, you're surprisingly different. As a friend, you're everyone's emotional support system—reliable, nonjudgmental, endlessly available. You can sustain this because friendship boundaries are clearer. In romance, you dissolve those boundaries, and that's where you get into trouble. You merge too fast, give too much, mistake intensity for intimacy. Your romantic relationships need more structure than your friendships, not less. You need partners who understand that your generosity is precious and finite, who actively ensure you're receiving as much as you're giving.\n\nThe hard truth about Wood Pig compatibility: you can make almost any combination work because you're adaptable and committed, but not every combination should work. Sometimes the growth is in walking away from someone who only knows how to take.",
  "elementalBalanceGuide": "Balancing your wood element isn't about moderation—it's about rhythm. Wood is a seasonal energy; it has phases of explosive growth and necessary dormancy. Your problem as a Wood Pig is that you try to be in spring all year long, always giving, always growing, always available. This is how you deplete yourself. Real balance means honoring the full cycle: growth, maturation, harvest, rest, renewal.\n\nExcess wood shows up in your body and your life in specific ways. You become scattered—too many projects, too many commitments, all of them half-finished. Your flexibility becomes instability; you're so adaptable you've lost your center. Physically, excess wood manifests as tension headaches, jaw clenching, shoulder tightness—all that growth energy with nowhere to go, turning inward and creating pressure. Emotionally, you become irritable, which people find shocking because you're usually so even-tempered. That irritation is wood trying to grow through obstacles, getting frustrated by resistance. When you notice these signs, you're overextended. Stop planting new things and tend what already exists.\n\nDeficient wood is more dangerous because it feels like depression but it's actually depletion. You lose your vision, your sense of possibility. Everything feels heavy, stuck, pointless. You're still giving to others because that's your default, but there's no juice in it anymore—you're running on duty and habit. Physically, deficient wood shows up as fatigue that sleep doesn't fix, a sense of being dried out, brittle. Your flexibility is gone; you're either rigid or collapsed. This is what happens when you've fed too many fires, controlled too much Earth, withstood too much Metal, without drawing nourishment back in. Recovery from deficient wood takes time—you can't think your way out of it.\n\nDaily practices for balance start with morning. Wood is the energy of dawn, and you need to align with that. Wake with light if possible, spend the first thirty minutes in growth-oriented activity—movement, creative work, planning your day with intention. Feed your wood by literally being around growing things: plants, gardens, forests. This isn't metaphor; this is elemental resonance. Your nervous system calms around green, around growth. If you're urban-bound, fill your space with plants and actually tend them. The act of nurturing growth outside yourself reminds you that not all giving is to people.\n\nEnvironment matters more for wood types than almost anyone else. You need space—visual space, physical space, energetic space. Clutter smothers you. Windowless rooms deplete you. You need sight lines, natural light, and the ability to see horizon. If your current environment is compressed, you need to create pockets of spaciousness: a corner that's just yours, a park you visit religiously, anywhere you can breathe fully. Wood needs to expand, and if it can't expand outward, it turns inward and causes problems.\n\nSeasonally, honor spring as your power time and winter as your necessary dormancy. In spring, say yes to growth, visibility, new projects, social expansion. In winter, pull inward without guilt. This is when you read, reflect, rest, and let your roots go deeper. Summer and autumn are your working seasons—you maintain what you started in spring and harvest what's matured. If you try to operate at spring intensity all year, you'll burn out by thirty-five and spend the next decade recovering.\n\nTo leverage element cycles for growth, understand that you generate fire and are generated by water. Surround yourself with water when you're depleted—literally spend time near water, drink more water, slow down. When you need to activate, amplify fire—not by exhausting yourself but by connecting with inspired people, creative projects, passionate purpose. Use earth to ground excess wood—practical tasks, physical work, anything that requires you to consolidate rather than expand. And use small doses of metal to prune and refine—editing, eliminating, sharpening your focus. You're playing a long game, Wood Pig. Balance isn't a destination; it's a practice you'll refine for the rest of your life."
}