{
  "elementalIdentity": "You are the Wood Rabbit — the Gentle Visionary — and you embody a contradiction that most people never resolve: you are both soft and unstoppable. Your wood element gives you the nature of bamboo: flexible, upward-reaching, persistent in growth even when the conditions aren't ideal. Your rabbit animal brings diplomatic grace, intuitive sensitivity, and a preference for indirect routes over confrontation. Together, these forces create someone who can navigate complexity with remarkable finesse while maintaining an almost naive belief that things can be better than they are.\n\nThis is what sets you apart from the other wood signs. The Wood Dragon bulldozes forward with wood's explosive growth energy. The Wood Tiger attacks obstacles directly. But you? You grow around problems. You find the path of least resistance not because you're weak, but because you understand that water flowing around a stone eventually shapes the canyon. Your wood element doesn't manifest as aggressive expansion — it manifests as persistent, gentle infiltration. You change environments by being in them, not by declaring war on them.\n\nThe archetype of the Gentle Visionary captures your essential paradox. You can see possibilities that others miss, futures that haven't yet taken shape, because your wood nature is always oriented toward what's emerging, what's about to bloom. Spring energy lives in you permanently. But your rabbit side ensures you'll never be the one shouting these visions from a mountaintop. You whisper them in private conversations. You plant seeds in people's minds and let them think the ideas were their own. This isn't manipulation — it's strategy born from understanding that people accept change more readily when they don't feel forced.\n\nYour combination also means you carry wood's shadow more subtly than other wood signs. When wood becomes excessive, it can be rigid, judgmental, controlling — insisting that growth happen on your timeline, in your preferred direction. In you, this shows up as passive aggression, as retreating into your warren when others don't follow your gentle guidance, as building resentment when people can't see what seems obvious to you. Your flexibility can become avoidance. Your diplomacy can become dishonesty. Your vision can become escapism when reality disappoints.\n\nBut when you're balanced, you're genuinely magical to be around. You make spaces feel safer. You help people access their own creativity without them quite knowing how you did it. You build networks and communities through authentic connection, not forced networking. You embody wood's highest potential: growth that serves life itself, not just your own expansion. Among the sixty signs, you're the one who proves that power doesn't have to announce itself, that influence can be wielded with compassion, that strength and gentleness aren't opposites at all.",
  "elementInDepth": "Wood in you is not theoretical — it's your operating system. Every decision you make, every relationship you build, every problem you face is filtered through wood element consciousness. This means you are fundamentally oriented toward growth, possibility, and forward movement. Stagnation isn't just uncomfortable for you; it's existentially threatening. When you feel stuck, you don't just get frustrated — you start to wither. Your mental health, your physical vitality, your sense of purpose are all directly tied to whether you're expanding into new territory, learning something novel, or building toward a vision.\n\nIn the productive cycle, wood feeds fire — and this is crucial for understanding yourself. Your natural direction is toward fire energy: passion, expression, joy, visibility. When you're healthy, you generate enthusiasm in others. Your ideas spark action. Your gentle presence creates warmth. But here's what you need to understand: you must allow yourself to feed fire, to be consumed partially in the process of creating heat and light. Wood Rabbits often hold back, reluctant to burn their energy on behalf of others, afraid of depletion. This creates internal congestion. You're meant to share your visions, to let your creativity fuel projects and movements and relationships. Hoarding your wood energy doesn't preserve it — it causes it to rot.\n\nWood controls earth in the destructive cycle, and this shows up in your psychology whether you like it or not. Earth represents stability, routine, practicality, and groundedness. Your wood nature will always want to break through earth's containment. You'll resist other people's rules, chafe against bureaucracy, feel suffocated by too much structure. This can be your superpower when earth energy around you is excessive or stagnant — you're the one who can introduce new growth into calcified systems. But it also means you can be unrealistic, flighty, unable to follow through on practical necessities. You need some earth influence in your life, even as you naturally push against it.\n\nWhen your wood is strong — well-watered by rest, nourished by inspiration, given space to grow — you're at your best. You're confident without being aggressive. You're flexible without being spineless. You make decisions with clarity. You set boundaries kindly but firmly. You pursue your visions with patient determination. Strong wood in you looks like someone who knows where they're going but doesn't need to drag anyone along.\n\nWhen your wood is depleted, everything inverts. Deficient wood becomes brittle, rigid, controlling in reactive ways. You'll become indecisive, paralyzed by too many options. You'll retreat from challenges instead of flexibly adapting. You'll lose your vision, feeling directionless and purposeless. Physically, deficient wood shows up as tension, especially in the neck and shoulders, as frustration that has nowhere to go. You'll snap at people you love. You'll feel irritable without clear cause. You'll crave stimulation but nothing satisfies.\n\nThe key is recognizing that your wood needs tending like an actual plant. It needs water (rest, emotional nourishment, space for feelings), sunlight (inspiration, new experiences, creative challenge), and room for roots (enough stability and earth energy to keep you anchored). Neglect any of these, and your wood suffers. Try to force growth when conditions aren't right, and your wood suffers differently. Your task is learning to read your own seasons, to know when to push growth and when to allow dormancy.",
  "yearAhead2026": "The Year of the Fire Horse arrives in 2026, and for you, Wood Rabbit, this is simultaneously exhilarating and exhausting. Fire Horse years are not subtle. They're loud, fast, passionate, and demanding. The fire element that you naturally feed through the productive cycle is now dominant in the collective energy, and it's hungry. This year will either catalyze your visions into reality or burn you out trying — the difference depends entirely on how consciously you engage with the fire.\n\nHere's what you need to understand: fire needs wood to burn, and you are made of wood. This year will draw on your resources more than most. People will want your ideas, your energy, your creative input. Opportunities will appear that seem tailor-made for you. Projects you've been germinating might suddenly catch fire and demand immediate attention. This is good — it's your wood fulfilling its purpose. But the fire horse doesn't just take a little wood; it consumes. You must be strategic about what you feed the flames and what you protect.\n\nQ1 (February-April): The year opens with intensity. Fire Horse energy comes in hot, and everyone around you is suddenly full of new initiatives and ambitious plans. You'll be tempted to say yes to everything, to support every vision that aligns with yours. Don't. This quarter is for ruthless discernment. Choose one or two major focuses and protect them fiercely. Feed those fires well, and let other opportunities pass. Your diplomatic rabbit nature will want to avoid disappointing people — ignore that instinct. Saying no now prevents collapse later.\n\nQ2 (May-July): This is your power quarter. Fire and wood are in natural harmony during late spring and early summer, and you'll feel energized in ways you haven't for years. Your visions will have unusual clarity. Your ability to influence others will be heightened. Use this time to build, to launch, to make your move. But watch for the shadow: wood can become over-controlling when fueling fire, trying to micromanage how the flames spread. Let your creations take on their own life. Release control over outcomes. Your job is to provide excellent fuel, not to dictate how brightly things burn.\n\nQ3 (August-October): Fire Horse peaks in late summer, and you'll start feeling the cost. This is when deficient wood symptoms will appear if you've been over-giving. Watch for decision fatigue, irritability, physical tension, and a creeping sense that nothing you do is enough. The solution isn't to push harder — it's to actively replenish. This quarter requires you to be selfish in ways that feel unnatural. Take space from social obligations. Say no to new requests. Focus on receiving rather than giving. Water your own roots before you worry about anyone else's garden.\n\nQ4 (November-January 2027): The year winds down, but fire energy doesn't disappear immediately. You'll be tempted to coast, assuming the hard part is over. Actually, this quarter is crucial for integration. Look at what caught fire this year and ask: what do I want to continue feeding? What needs to burn down completely? What wants to transform into something new? Use your natural wood wisdom to plant seeds for the next cycle rather than desperately trying to keep every fire burning. This is how you exit the Fire Horse year intact and wiser.",
  "compatibilityMap": "You connect with others through wood consciousness, which means your relationships are fundamentally about growth — yours, theirs, the relationship's own evolution. You don't do static partnerships. You need relationships that are going somewhere, that are becoming something, even if that direction is undefined. This makes you compatible with people who embrace change and challenging with those who crave stability above all else.\n\nYour best elemental matches are with fire and water signs, though for completely different reasons. Fire signs recognize you instinctively. They need what you offer — fuel, vision, creative spark — and they give you what you crave: passion, enthusiasm, a sense of purpose through shared excitement. A Wood Rabbit with a healthy fire partner is magic. You provide direction and substance; they provide energy and visibility. The danger is fire's hunger can deplete you if they take without replenishing. Watch for relationships where you're always giving ideas, support, emotional labor while fire burns bright at your expense. Healthy fire signs will ensure you're fed too, that the relationship nourishes your wood rather than just consuming it.\n\nWater signs are your other natural match, though this operates through the productive cycle in reverse. Water generates wood — they nourish you. Water partners offer emotional depth, intuition, adaptability, and restoration. They help you rest, provide the space for your roots to drink deeply. With water signs, you feel permission to be vulnerable, to not always be the visionary or the guide. The challenge with water is its formlessness can frustrate your wood need for direction. Water without wood guidance can become scattered, stagnant, depressed. You'll need to provide structure without controlling, which is a delicate balance for you.\n\nEarth signs are your most complex relationship dynamic. You control earth in the destructive cycle, which means there's inherent tension. Earth wants stability, tradition, practical results, proven methods. You want growth, innovation, new possibilities, experimental approaches. This can be complementary when both sides are mature — earth grounds your flights of vision, and you prevent earth from becoming rigid and stuck. But immature versions of this pairing are terrible. You'll feel suffocated, controlled, criticized for your impracticality. Earth will feel destabilized, disrespected, exhausted by your constant need for change. If you're with an earth sign, the relationship requires conscious work. You must develop genuine appreciation for what stability provides, and they must learn to see change as opportunity rather than threat.\n\nMetal signs offer an interesting middle ground. Metal controls wood in the destructive cycle, so they can cut through your indecisiveness, challenge your avoidance patterns, demand you take concrete action. This can be incredibly valuable if the metal sign wields their cutting energy with respect. They can be the pruning shears that help you grow more beautifully. But metal that's too aggressive will simply wound you, criticize your gentleness, mock your sensitivity. You'll shut down and retreat.\n\nIn friendship versus romance, your needs shift slightly. Friendships can sustain more elemental tension because the stakes are lower. You can enjoy earth friends for specific contexts without living with their different rhythm. You can appreciate metal friends' directness without it feeling like daily judgment. But in romance, you need more fundamental harmony. You need a partner who either shares your growth orientation or deeply respects it. You need someone who understands that love for you is an evolving garden, not a finished monument.",
  "elementalBalanceGuide": "Balancing your wood requires understanding that your element operates on seasonal rhythms whether you acknowledge them or not. You cannot be in spring growth mode year-round, though you'll try. Learning to work with your natural cycles rather than against them is the foundation of staying balanced.\n\nSigns of excess wood: You're over-scheduled and resentful about it. You're saying yes to everything while secretly wishing people would leave you alone. You're rigid about how things should unfold, impatient with others' slower pace. You're living entirely in future plans, unable to be present. Your jaw is clenched. Your shoulders are up near your ears. You're irritable over small things. You're starting projects obsessively but finishing none. You feel scattered, like your energy is growing in too many directions simultaneously. This is wood unchecked, expanding without wisdom.\n\nSigns of deficient wood: You can't make decisions, even small ones. You feel directionless, like you've lost the thread of why you do anything. You're unusually passive, letting others dictate your schedule and choices. You've lost your flexibility — everything feels hard, rigid, effortful. You're avoiding challenges instead of adapting to them. You feel stuck but can't articulate where you want to go. Your creativity is offline. You're disconnected from your body. This is wood depleted, unable to fulfill its nature.\n\nDaily practices for balance start with morning movement. Your wood needs physical expression to stay supple. This doesn't mean aggressive exercise — it means gentle, flowing movement that creates space in your body. Stretching, yoga, tai chi, walking while actually paying attention to your body. Wood stores tension when blocked, and you're prone to blocking yourself.\n\nEnvironment matters more for you than you realize. You need living things around you. Actual plants, windows with views of trees or sky, natural materials. Sterile, artificial environments deplete your wood quickly. If you work in such spaces, compensate aggressively. Spend lunch outside. Fill your home with green. Choose natural fibers. Your wood recognizes its own element and draws nourishment from it.\n\nSeasonal awareness is non-negotiable. Spring is your power season — use it to initiate, to start projects, to plant seeds both literal and metaphorical. Summer extends your spring energy with fire support — this is when you build on spring's initiatives. Fall requires you to consolidate, to harvest what grew, to let some things die back. This is hard for you. Your wood resists fall's energy, wanting to keep growing. But fighting fall leads to depletion. Winter demands rest, and you'll resist this even harder. You'll fill winter with planning for spring, with maintaining activity, with anything but genuine dormancy. This is why you burn out. Winter rest isn't optional — it's how wood prepares for spring's explosion. Force yourself into at least partial dormancy during winter months.\n\nLeveraging element cycles means feeding fire intentionally. Share your visions. Teach what you know. Collaborate with passionate people. Let your wood fuel projects that matter. But also invite water. Spend time with emotionally deep people. Engage with art, music, poetry. Allow yourself to feel without immediate action. Rest near actual water when possible. And paradoxically, befriend some earth energy. Build routines that support your visions. Create structures that enable rather than constrain your growth. Finish things occasionally instead of just starting them. Your wood thrives not in chaos but in directed growth, and earth provides the container that makes direction possible."
}