{
  "elementalIdentity": "You are the Wood Dragon — the Creative Titan, and there's nothing subtle about you. Where other wood signs bend and adapt quietly, you explode upward like a forest breaking through concrete. You carry the dragon's cosmic authority and wood's relentless growth drive, which makes you both visionary and dangerous. You're not here to follow anyone's blueprint. You're here to build entirely new structures, and you'll tear down what doesn't serve that vision without hesitation.\n\nThe dragon gives you mythic scale. The wood element gives you the actual substance to manifest it. Most dragons dream big but lack follow-through. Not you. Your wood nature means you grow into your ambitions organically, year after year, building root systems that can support your wildest visions. You don't just want success — you want to create living ecosystems of influence. That's the difference. You think in terms of forests, not trees.\n\nBut here's the edge you walk: wood is about flexibility and compassion, while dragon energy is about dominance and spectacle. Inside you, these forces are in constant negotiation. When you're balanced, you're the benevolent innovator — someone who uses their power to elevate others, who creates spaces where creativity flourishes. When you're imbalanced, you're the tyrant gardener — pruning people out of your life the moment they don't serve your growth, steamrolling over others' needs because your vision feels more important.\n\nYour archetype as Creative Titan means you're built to pioneer new territories. You don't refine existing systems well — you'd rather burn them down and plant something unprecedented. This makes you either revolutionary or destructive, depending on your level of self-awareness. The titan part isn't just about size; it's about lasting impact. You're not interested in trends. You want to create things that outlive you, that change the landscape permanently.\n\nThe shadow side? You can become so identified with your growth trajectory that you forget you're also mortal and limited. Wood Dragons often crash hard because they overextend, planting seeds in too many directions, demanding too much from themselves and their environment. You struggle with rest because rest feels like stagnation, and stagnation feels like death. Learning that dormancy is part of the growth cycle — that winter serves spring — is your lifetime work. Until you integrate that, you'll keep burning out spectacularly, wondering why your mighty roots can't sustain the canopy you're trying to build.",
  "elementInDepth": "Wood is the element of spring, emergence, and upward motion. It's yang in nature but not in the aggressive fire way — wood's yang quality is about persistent expansion, the slow-motion explosion of a seed becoming a sequoia. For you as a dragon, this element tempers your natural intensity with direction. Dragons without grounding tend to dissipate their power in display. Wood gives you somewhere to actually GO with all that energy.\n\nIn the productive cycle, wood feeds fire. This is your natural exhale. You generate ideas, inspiration, creative fire in everyone around you. People feel more alive in your presence because you're literally feeding their fire element with your abundant wood energy. This is why you're often surrounded by people wanting your attention, your endorsement, your energy. But here's the problem: if you're not careful, you become kindling. You burn yourself up feeding everyone else's flames, and then wonder why you feel depleted and resentful. Learning to choose who and what gets your wood energy is crucial.\n\nWood controls earth in the controlling cycle, and this is where your power gets complicated. Earth represents stability, boundaries, practical limitation. Your wood nature wants to break through all of that. At your best, you're excellent at disrupting stagnant systems, pushing through bureaucratic earth-heavy structures that need shaking up. At your worst, you destabilize everything you touch, unable to let anything solidify or take form. You start businesses and abandon them. You begin relationships and bolt when they require commitment. You can't let the earth element do its job of consolidation because you're allergic to anything that feels like constraint.\n\nWhen your wood is strong — when you're well-resourced, rested, aligned with your purpose — you're unstoppable. Your creativity flows, your body feels vital, your mind generates solutions faster than problems appear. You're generous, visionary, magnetic. Strong wood makes you the mentor everyone wishes they had, the leader who actually sees people's potential and helps them grow into it.\n\nWhen your wood is depleted, everything inverts. You become rigid instead of flexible. Brittle. Irritable. You might notice your jaw clenching, your shoulders hunching forward, a sense of constant frustration just beneath your skin. Depleted wood shows up as creative block, yes, but also as a loss of compassion. You stop seeing people as individuals with their own growth paths and start seeing them as obstacles or resources. This is when you're at your most destructive — not because you're actively malicious, but because you're in survival mode, trying to force growth from empty reserves.\n\nWood Dragons need to understand that their element requires nourishment. Water feeds wood in the productive cycle. This means you need emotional depth, rest, reflection, and mystery — all the things your dragon nature tends to avoid. You'd rather stay in the realm of action and manifestation. But without sufficient water element in your life, your wood becomes dry, cracked, vulnerable to fire that consumes rather than illuminates. The practice is learning to seek water before you're desperate for it.",
  "yearAhead2026": "The Year of the Fire Horse arrives in 2026, and for you, Wood Dragon, this is gasoline meeting match. Fire Horse years are explosive, passionate, reckless, and transformative — everything moves faster, burns hotter, demands more courage. Since you generate fire naturally through the productive cycle, this year will amplify everything you are. Your creative output could be extraordinary. Your visibility will increase whether you seek it or not. But there's real danger here too: fire consumes wood, and if you're not careful, you'll burn through your reserves by May.\n\nQ1 (February through April, beginning with Lunar New Year): The year opens with momentum that feels like destiny. Fire Horse energy hits your wood nature like perfect kindling, and projects you've been building will suddenly catch flame. This is your launch window. Whatever you've been preparing, refining, holding back — release it now. The cosmic timing favors bold moves, not cautious ones. But here's the warning: distinguish between confidence and recklessness. Fire Horse energy makes everything feel urgent and critical. Not everything is. Choose your one or two major initiatives and feed those. Trying to do everything will scatter your power. Watch for conflicts with earth-element people (Ox, Dragon, Goat, Dog) who will feel threatened by the pace you're setting. You'll need to decide whether to slow down for them or let them fall away.\n\nQ2 (May through July): Mid-year brings the test. Fire element peaks in summer, and you'll feel simultaneously energized and exhausted. This is when many Wood Dragons crash — you've been feeding the fire for months, and your wood reserves are running low. The opportunity here is collaboration with water-element people (Rat, Pig) who can replenish you, and metal-element people (Monkey, Rooster) who can give structure to all the fire you've been generating. Expect a major decision point in June about whether to double down or pull back. The correct answer is probably neither — instead, redirect. Find the sustainable version of what you're building.\n\nQ3 (August through October): Autumn brings earth energy, which you naturally control, but in a Fire Horse year, earth feels more resistant than usual. You'll encounter more obstacles, more people saying no, more systems that won't bend to your will. Don't interpret this as failure. It's the universe asking you to consolidate. What you built in Q1 and Q2 needs to take root now. This is your season to formalize, structure, commit. It won't feel as exciting as the year's beginning, and that's the point. If you fight the earth energy, you'll exhaust yourself. If you work with it, you'll build foundations that can support next year's growth.\n\nQ4 (November through January 2027): The year closes with metal energy (late autumn into early winter), which controls wood — meaning you'll feel constrained, possibly criticized, definitely aware of your limitations. This is good. You need this. Metal cuts away what's excessive, and after a Fire Horse year, you'll have excess. Use these months to prune ruthlessly. What projects, relationships, commitments no longer serve your core vision? Cut them. Metal energy gives you permission to be surgical about your life. The year ends with you leaner, more focused, and ready for the Earth Goat year that follows — which will be slower and more relational, requiring different skills.\n\nOverall strategy for 2026: Feed the fire consciously. You'll be tempted to give everything to this year's momentum. Don't. Reserve 30% of your energy for replenishment, or you'll spend 2027 recovering. Find your water sources — literal time near water, emotional intimacy, spiritual practice, whatever fills your well. And remember, fire creates ash, which becomes earth. Everything you burn through this year will need to be rebuilt later. Make sure you're burning the right things.",
  "compatibilityMap": "Your elemental nature makes you most compatible with people who can either sustain your growth or benefit from your generative power without depleting you. This isn't about surface-level personality matching — it's about whose energetic system actually works with yours over time.\n\nBest elemental matches: Water-element signs (Rat, Pig) are your natural allies. Water feeds wood in the productive cycle, which means these people replenish you without trying. They bring emotional depth, intuition, and flow to your driven, upward nature. In romance, water signs help you access vulnerability without feeling weak. They teach you that rest is productive, that mystery is valuable, that not everything needs to be manifested immediately. The challenge with water partners is that they can feel formless to you — you might try to give them too much structure, grow them in directions they don't want to go. The gift is learning that nourishment doesn't require control.\n\nFire-element signs (Snake, Horse) are exciting but dangerous. They're the people you have chemistry with immediately — conversations spark, projects launch, passion runs high. You feed their fire naturally, and when it works, you feel purposeful and alive. But here's the trap: fire consumes wood. Over time, fire partners can drain you if the relationship is unbalanced. You give and give, feeding their enthusiasm, their projects, their emotional intensity, and wake up one day feeling like a husk. These relationships work when the fire person consciously gives back — through action, reciprocity, tending to YOUR needs. In friendship, fire signs are your best collaborators for short-term, high-intensity projects. In romance, you need clear boundaries about energy exchange.\n\nWorst elemental matches: Metal-element signs (Monkey, Rooster) control wood in the destructive cycle, meaning they naturally limit and shape you. Sometimes you need this — metal partners can provide structure, discernment, quality control. But in intimate relationships, metal's cutting nature often feels like criticism. They see your excess and want to prune it. They question your vision, point out flaws, slow you down. This can be valuable if you're secure enough to hear it, but most Wood Dragons experience metal partners as joy-killers. The relationship becomes a constant negotiation between your need to expand and their need to refine. These dynamics work better in professional contexts where you need an editor, not in romance where you need a champion.\n\nEarth-element signs (Ox, Dragon, Goat, Dog) are complex. You control earth, which means you naturally destabilize them. They want security, predictability, accumulation. You want disruption, growth, breakthrough. In small doses, you're exciting to earth signs — you shake up their world in ways they secretly crave. Over time, though, you become threatening. They dig in, resist, try to slow you down. You feel suffocated and controlled. The earth signs who work for you are the ones who understand they're signing up for permanent transformation, who want to be grown by you rather than staying static. This is rare.\n\nIn relationships generally, you need to understand your own pattern: you're attracted to people you can help grow. This is your wood nature expressing itself through relationship. The shadow version is that you choose projects, not partners — people with potential rather than people who are already whole. You try to garden them into your vision of who they could be, and then feel betrayed when they resist or fail to blossom on your timeline. The mature version of your relational nature is learning to appreciate what's already present rather than only seeing what could be. Finding someone who has their own growth trajectory and inviting them to grow alongside you, not according to you — that's the work.",
  "elementalBalanceGuide": "Balancing wood energy isn't about dampening your nature — it's about sustaining it. Think of yourself as a forest. Forests need sun, yes, but also rain, seasonal die-back, periods of dormancy, and the occasional fire to clear deadwood. Your job is learning the rhythms that keep your ecosystem healthy rather than extracting from it until it collapses.\n\nSigns of excess wood: You'll know your wood energy is out of balance when you feel constantly agitated, like you're pushing against invisible resistance. Excess wood shows up as rigidity disguised as determination — you can't change course even when the path clearly isn't working. Physically, you might experience tension headaches, jaw clenching, neck and shoulder tightness, tendon issues. Emotionally, you lose compassion and become judgmental, frustrated with anyone who isn't moving at your pace. You overcommit, overbuild, overplant, and then resent the maintenance required. Excess wood makes you a tyrant — to others and to yourself.\n\nTo balance excess wood, you need metal and earth elements. Metal practice means pruning — ruthlessly cutting back commitments, projects, relationships that aren't essential. You likely need to say no to 50% of what you're currently doing. Earth practice means grounding — literal time on earth (gardening, hiking, sitting on ground), working with your hands in physical reality, focusing on one thing until it's complete rather than starting ten things and finishing none. Eat root vegetables. Slow down your speech. Finish your sentences. These sound like small things, but they bring earth element into your system.\n\nSigns of deficient wood: Depleted wood feels like creative death. You lose your vision, your sense of purpose, your ability to imagine anything growing or improving. You become depressed but in a frustrated way — you want to move but can't find the will. Your body might feel stiff, inflexible. You lose your generosity and become withholding, protective of resources. Deficient wood makes you brittle and defensive.\n\nTo nourish deficient wood, you need water element first, then gentle fire. Water practice means rest, but not passive rest — restorative activities that fill your well. Time near moving water (rivers, ocean). Deep conversations about emotions and meaning. Spiritual practice that connects you to something larger. Dream work. Music. Anything that introduces mystery and depth. Once your reserves are replenished, then add fire — inspiring books, dynamic people, creative challenges that excite rather than deplete you. But fire before water just burns you up further.\n\nSeasonal awareness: Spring is your power season. Use March through May to launch initiatives, start new projects, make bold moves. Your wood energy is naturally amplified by seasonal wood, and you'll have reserves you don't have other times. Summer (fire season) is productive if you're well-resourced, but dangerous if you're already depleted — the heat will consume you. Use summer for visibility and collaboration, but build in more rest than feels necessary. Autumn (metal season) will feel restrictive. Don't fight it. Use these months to edit, refine, complete, and release what's no longer serving. Winter (water season) is your replenishment time. This is when you should be doing the least external work and the most internal work — planning, dreaming, restoring.\n\nDaily practices for balance: Morning practice should involve gentle movement that lengthens and stretches — yoga, tai chi, anything that reminds your body that wood is flexible, not rigid. Midday, spend at least fifteen minutes outside without agenda — just present with trees, plants, living growing things. They'll teach you about sustainable growth if you pay attention. Evening, practice completion — finish one thing, clean one space, close one loop. This trains you in the cycle of growth AND harvest, not just endless expansion.\n\nEnvironment adjustments: Your living and working spaces should have living plants, but not so many that you can't care for them — that becomes another depletion source. East-facing windows give you sunrise, which is your directional power. Wood furniture, green colors, vertical lines all support your element, but you also need earth tones and metal elements (whites, grays, circular shapes) to keep from becoming unbalanced. Avoid all-wood environments — they amplify you past the point of sustainability.\n\nThe ultimate practice: Learn to love the fallow period. Your wood nature wants constant spring, constant growth, constant upward movement. But real forests have winter. Real growth includes die-back. The trees that live longest aren't the ones that try to grow twelve months a year — they're the ones that know when to draw energy back into their roots and wait. Your creative titanism will be infinitely more powerful if you learn to cycle between expansion and consolidation, vision and rest, doing and being. That's not weakness. That's mastery."
}